Расскажи о себе
Расскажи про свой опыт работы с Docker
Чем занимаешься в свободное время
В чем разница между фреймворком и библиотекой
Как пришел в разработку
Расскажи про опыт работы
К чему стремишься
Есть ли вопросы
Как расставлять приоритеты у задач
Что такое SOLID
Расскажи про опыт работы с PostgreSQL
С какими БД работал
Какие будут первые действия если придешь на проект где нет предыдущего Backend-разработчика
Работал ли с RabbitMQ
Как оцениваешь свои знания Docker
Работал ли с NestJS
Расскажи про опыт работы с Kafka
С каким стеком работал
Что такое dependency injection
Как оцениваешь свои знания по TypeScript
Что такое идемпотентность
Как оцениваешь свой уровень знания SQL
Выберешь для проекта микросервисы или монолит
Как оцениваешь знания Node.js
Как оцениваешь свои знания в Node.js
Как приоритизируешь задачи в отсутствии Project Manager
Как сейчас развиваешь свои навыки
Каким образом поддерживаешь свой уровень знаний
Какой опыт работы с NestJS
Работал ли с чистым SQL
Твои первые действия на проекте, который до тебя вел другой Backend разработчик
Что такое REST
Что такое npm
Какие специалисты были в команде на прошлом проекте
Где живешь
Как организуешь свое рабочее время
Как оцениваешь свои знания NestJS
Как поддерживаешь свой уровень знаний Node.js
Какие плюсы и минусы использования монолитной архитектуры
Какой опыт работы с Express
Какой опыт работы с TypeScript
Какой опыт разработки на Node.js
На что будешь обращать внимание при выборе компании
Почему решил стать программистом
Работал ли с Kubernetes
10%
Расскажи про проекты на которых работал
10%
Расскажи про самые сложные задачи, которые решал
Что лучше: монолитная архитектура или микросервисная
Что такое Middleware
Что такое ООП
В каком направлении хочешь развиваться
9%
В чем разница между null и undefined
9%
Вносил ли идеи в команду
9%
Есть ли опыт в Kubernetes
9%
Есть ли у тебя вопросы
9%
Занимался ли тестированием
9%
Использовал ли TypeScript в проектах
9%
К чему стремишься в разработке
9%
Как оцениваешь свои знания PostgreSQL
9%
Как справлялся с чужими задачами
9%
Каким достижением в работе больше всего гордишься
9%
Какой у тебя стек
9%
Какую самую яркую идею реализовал
9%
Можешь ли объяснять сложные вещи простым языком
9%
Почему решил сменить место работы
9%
Предлагал ли изменить рабочие процессы
9%
Принимал ли чужие задачи в работу
9%
Работал ли с TypeScript
9%
Работал ли с нативным SQL
9%
С какими базами данных работал
9%
Сталкивался ли с Express
9%
Чем должна обладать идеальная компания для комфортной работы
9%
Что знаешь про ООП
9%
Что такое фреймворк
7%
В чем разница между LEFT JOIN и RIGHT JOIN
7%
В чем разница между PostgreSQL и MongoDB
7%
В чём разница между INNER JOIN и RIGHT JOIN
7%
Для чего используется оператор Infer
7%
Для чего нужен middleware
7%
Для чего нужны транзакции в БД
7%
Как будешь реагировать на задачу сверх нагрузки
7%
Как планируешь рабочий день
7%
Как работает Node.js
7%
Какие знаешь принципы ООП
7%
Какие знаешь свойства транзакции в БД
7%
Какие инструменты используешь для прокачки hard skills
7%
Какие плюсы и минусы микросервиса
7%
Какие плюсы и минусы монолита и микросервиса относительно друг друга
7%
Какие проекты реализовал на Node.js
7%
Какие требования к компании в которой хочешь работать
7%
Какие читал книги по программированию
7%
На всех ли проектах использовал TypeScript
7%
Приведи пример использования Single Responsibility Principle
7%
Приведи пример принципа Dependency Inversion
7%
Работал ли с Generics
7%
Работал ли с TypeORM
7%
Работал ли с docker compose
7%
Расскажи о своих проектах
7%
Расскажи про самую яркую идею, которую удалось реализовать в работе
7%
Расскажи про свой опыт работы с SQL

С какими брокерами работал
7%
Сталкивался ли с NestJS
7%
Что значит буква D в SOLID
7%
Что такое CRUD
7%
Что такое Closures в JavaScript
7%
Что такое DRY
7%
Что такое Websocket
7%
Что такое libuv
7%
Что такое Транзакция
7%
Что такое библиотека в программировании
7%
Что такое нормализация БД
7%
Что такое полиморфизм
6%
Сколько человек было в команде на предыдущей работе
5%
Было ли большинство проектов на NestJS
5%
В каких проектах приходилось работать
5%
В каком формате работаешь
5%
В чем разница между Backend и Frontend
5%
В чем разница между CROSS JOIN и INNER JOIN
5%
В чем разница между GET и POST
5%
В чем разница между INNER JOIN и LEFT JOIN
5%
В чем разница между TCP и UDP
5%
В чем разница между kafka и RabbitMQ
5%
В чем разница между оператором == и ===
5%
В чем разница между типом и интерфейсом в TypeScript
5%
Все проекты были с нуля или подключался в процессе разработки
5%
Для чего используется Dependency Injection
5%
Для чего используется async/await
5%
Для чего используется npm
5%
Для чего используется нормализация
5%
Для чего нужен Redux
5%
Заканчивал ли какие-то курсы или учился сам
5%
Зачем нужен npm
5%
Зачем нужны индексы в БД
5%
Используешь ли инструменты тайм-менеджмента
5%
К чему стремишься в работе
5%
Как будешь оспаривать предложенную кем-то идею, если понимаешь, что она навредит проекту
5%
Как оцениваешь свои знания Express
5%
Как оцениваешь свои знания Kafka
5%
Как оцениваешь свои знания RabbitMQ
5%
Как планируешь свое время
5%
Как поддерживаешь свои знания Node.js
5%
Как поддерживаешь уровень знаний в разработке
5%
Как работает Event Loop в Node.js
5%
Как работает garbage collector в JavaScript
5%
Как распределишь равные по приоритету задачи
5%
Как часто вносил инициативу в проект
5%
Как часто выдвигаешь идеи в проект
5%
Как часто предлагал изменить процессы в работе
5%
Какие HTTP методы идемпотентные
5%
Какие знаешь ORM для Node.js


Какие знаешь виды JOIN
5%
Какие знаешь виды join
5%
Какие знаешь методы управления асинхронными операциями
5%
Какие знаешь неидемпотентные методы HTTP
5%
Какие знаешь парадигмы ООП
5%
Какие знаешь паттерны проектирования
5%
Какие знаешь способы управления асинхронными операциями
5%
Какие знаешь типы JOIN
5%
Какие знаешь типы index в БД
5%
Какие знаешь уровни изоляции в БД
5%
Какие знаешь фреймворки Node.js
5%
Какие книги читаешь
5%
Какие плюсы и минусы GraphQL
5%
Какие плюсы и минусы использования микросервисной архитектуры
5%
Какие плюсы и минусы микросервисной архитектуры
5%
Какие проекты реализовал с использованием MySQL
5%
Какие проекты реализовал с использованием PostgreSQL
5%
Какие реализовал pet-проект
5%
Какое было самое сложное решение в твоей жизни
5%
Какое самое сложное решение принимал
5%
Какой видишь свою будущую компанию
5%
Какой опыт работы в Node.js
5%
Когда лучше использовать микросервисы
5%
Можешь ли объяснять сложные вещи простыми словами
5%
На каком стеке работал
5%
Писал ли на TypeScript
5%
Писал ли сложные SQL запросы
5%
Пользуешься ли инструментами для тайм-менеджмента
5%
Почему выбрал разработку
5%
Почему решил сменить компанию
5%
Приведи пример использования Interface Segregation Principle
5%
Приведи пример использования Liskov Substitution Principle
5%
Приведи пример использования Open-Closed Principle
5%
Приведи пример, когда приходилось перенимать задачи других людей
5%
Привносил ли полезную идею в проект
5%
Проходил ли курсы
5%
Работаешь ли сейчас
5%
Работаешь ли удаленно
5%
Работал ли с Linux
5%
Работал ли с Prisma
5%
Работал ли с Sequelize
5%
Работал ли с реляционными БД
5%
Работал ли с реляционными базами данных
5%
Работал ли с транзакциями
5%
Расскажи о последнем проекте
5%
Сколько проектов писал с NestJS
5%
Сталкивался ли Kubernetes
5%
Сталкивался ли legacy проектами
5%
Сталкивался ли с Docker
5%
Сталкивался ли с Kafka


Сталкивался ли с транзакциями
5%
Что значит буква I в SOLID
5%
Что значит буква L в SOLID
5%
Что значит буква O в SOLID
5%
Что значит буква S в SOLID
5%
Что такое Closures
5%
Что такое Event Loop в Node.js
5%
Что такое EventEmitter
5%
Что такое EventLoop
5%
Что такое HTTP-протокол со стороны Frontend
5%
Что такое Singleton
5%
Что такое TCP протокол
5%
Что такое VDOM
5%
Что такое агрегатная функция
5%
Что такое индексация в БД
5%
Что такое инкапсуляция
5%
Что такое первичный ключ (Primary Key)
5%
Что такое уровень изоляции транзакции в PostgreSQL
5%
Является ли Node.js однопоточным
4%
Что хочешь достичь работая разработчиком
3%
Express это библиотека
3%
Express это фреймворк
3%
Большая ли была команда в проекте
3%
Большая ли команда на текущем проекте
3%
Больше нравятся реляционные или нереляционные базы данных
3%
Больше опыта в работе с монолитом или с микросервисом
3%
Больше стремишься к архитектуре или к менеджменту
3%
Будет ли один процесс знать что делает другой процесс
3%
Будешь ли замотивирован перейти в другую компанию к своему окружению
3%
Бывало ли выгорание
3%
Был ли во всех проектах NestJS
3%
Был ли опыт перехода с монолитной архитектуры на микросервисную
3%
Был ли прав в дискуссии
3%
Был ли проект с PostgreSQL
3%
Был ли проект с TypeORM
3%
Были ли дополнительные проекты
3%
Были ли какие-либо навыки при устройстве на первое место работы
3%
Были ли проекты под Linux
3%
Были ли ситуации когда взгляды не совпадали со взглядами руководства
3%
Было ли тестирование в проекте
3%
Было ли чувство выгорания
3%
В будущем хочешь углубляться в Backend или в архитектуру
3%
В дальнейшем хочешь уходить в лидерство или в архитектуру
3%
В каких компаниях не будешь работать
3%
В каких крупных проектах участвовал
3%
В каких проектах участвовал
3%
В каких форматах доводилось работать
3%
В каких форматах работы доводилось работать
3%
В какой сфере хочешь развиваться
3%
В каком городе проживаешь


В каком крупном проекте участвовал
3%
В каком случае первичный ключ равен null
3%
В каком формате работал
3%
В скольких командах работал
3%
В чем плюсы и минусы оператора in
3%
В чем преимущество третьей нормальной формы базы данных
3%
В чем разница между .then и await
3%
В чем разница между Arrow Functions и Standard Functions
3%
В чем разница между Asyc/Await и Promise.all
3%
В чем разница между BASE и ACID в БД
3%
В чем разница между Business Model и Entity Model
3%
В чем разница между Call и Bind
3%
В чем разница между Cluster и Child Process
3%
В чем разница между DELETE и TRUNCATE
3%
В чем разница между DOM и VDOM
3%
В чем разница между Decorator и Function
3%
В чем разница между Dependency Inversion и Injection
3%
В чем разница между ES5 и ES6
3%
В чем разница между FULL JOIN и INNER JOIN
3%
В чем разница между HAVING и WHERE в SQL
3%
В чем разница между HTTP и HTTPS
3%
В чем разница между HTTP и REST
3%
В чем разница между INNER JOIN и JOIN OUTER
3%
В чем разница между INNER JOIN и LEFT JOIN в SQL
3%
В чем разница между INNER JOIN и OUTER JOIN
3%
В чем разница между JOIN в MongoDB и PostgreSQL
3%
В чем разница между LEFT, RIGHT и INNER JOIN
3%
В чем разница между MySQL и PostgreSQL
3%
В чем разница между REST API и GraphQL
3%
В чем разница между SSG и SSR
3%
В чем разница между Throttle и Debounce в JavaScript
3%
В чем разница между WebSocket и HTTP
3%
В чем разница между any и unknown в TypeScript
3%
В чем разница между async/await и Promise
3%
В чем разница между cookie и localStorage
3%
В чем разница между cookie и sessionStorage
3%
В чем разница между interface и class в TypeScript
3%
В чем разница между let и const
3%
В чем разница между localStorage и SessionStorage
3%
В чем разница между module.export и exports
3%
В чем разница между readFile и readStream
3%
В чем разница между return undefined и отсутствием return
3%
В чем разница между spawn и fork
3%
В чем разница между type и class в TypeScript
3%
В чем разница между undefined и any в TypeScript
3%
В чем разница между var и let
3%
В чем разница между абстрактным класом и интерфейсом
3%
В чем разница между вертикальным и горизонтальным масштабированием баз данных
3%
В чем разница между видами JOIN
3%
В чем разница между вызовом Then-метода и Await-метода


В чем разница между запросом и ответом сервера
3%
В чем разница между императивным и декларативным программированием
3%
В чем разница между использованием .gif и .jpeg
3%
В чем разница между использованием .gif и .png
3%
В чем разница между использованием .png и .jpeg
3%
В чем разница между использованием BEM и Scoped-стилей
3%
В чем разница между использованием this в Arrow Function и Basic Function
3%
В чем разница между использованием тега img и свойством background-image
3%
В чем разница между методом bind и методом apply
3%
В чем разница между методом call и методом apply
3%
В чем разница между методом call и методом bind
3%
В чем разница между методом then и await
3%
В чем разница между модулем HTTP и HTTPS
3%
В чем разница между перегрузкой и переопределением функции в TypeScript
3%
В чем разница между перегрузкой метода и переопределением метода
3%
В чем разница между реляционной и документоориентированной БД
3%
В чем разница между типами JOIN
3%
В чем связь между Event Loop и Async/Await
3%
В чем твоя мотивация работы на Node.js по сравнению с Java
3%
Владеешь ли принципами SOLID
3%
Во что преобразуется JS-код при использовании Node.js
3%
Все ли проекты были с Docker
3%
Все ли проекты делал с NestJS
3%
Все ли проекты делал с PostgreSQL
3%
Все ли проекты писал на Node.js
3%
Всегда ли бинарный поиск при индексах
3%
Вызывает ли ререндер страницы useEffect
3%
Выносишь ли 5 DTO с одинаковыми полями в одно
3%
Где берешь новую информацию
3%
Где находится информация в POST-запросе
3%
Где черпаешь знания и новости
3%
Где черпаешь новые знания
3%
Для чего использовал ClickHouse
3%
Для чего использовал Docker
3%
Для чего используется Branching Strategy
3%
Для чего используется CORS
3%
Для чего используется CSR-технология
3%
Для чего используется DOM
3%
Для чего используется Event Emitter в Node.JS
3%
Для чего используется Falsy значение
3%
Для чего используется Foreign Key в БД
3%
Для чего используется HTTP
3%
Для чего используется Hook useSellect
3%
Для чего используется JSON Web Token
3%
Для чего используется Patroni в PostgreSQL
3%
Для чего используется RabbitMQ
3%
Для чего используется SOLID
3%
Для чего используется SSG
3%
Для чего используется Set
3%
Для чего используется Stream в Node.JS


Для чего используется Truthy значение
3%
Для чего используется TypeScript
3%
Для чего используется closures в JavaScript
3%
Для чего используется n в Big O Notation
3%
Для чего используется package-lock.json
3%
Для чего используется queue
3%
Для чего используется return undefined
3%
Для чего используется stack
3%
Для чего используется tsconfig.json
3%
Для чего используется атрибут SameSite в cookie
3%
Для чего используется библиотека Socket.IO
3%
Для чего используется два вида сравнения в JavaScript
3%
Для чего используется денормализация
3%
Для чего используется инкапсуляция
3%
Для чего используется команда tail
3%
Для чего используется массив
3%
Для чего используется метод Map
3%
Для чего используется метод Reduce
3%
Для чего используется метод apply
3%
Для чего используется метод bind
3%
Для чего используется метод call
3%
Для чего используется модуль HTTP
3%
Для чего используется модуль HTTPS
3%
Для чего используется несколько типов Index в БД
3%
Для чего используется оператор ==
3%
Для чего используется первый аргумент useCallback
3%
Для чего используется тройное равно
3%
Для чего используется формат .gif
3%
Для чего используется формат .jpeg
3%
Для чего используется формат .png
3%
Для чего используется фреймворк
3%
Для чего используется элемент <a>
3%
Для чего используется элемент Button
3%
Для чего используется элемент Label
3%
Для чего используются Generics
3%
Для чего используются денормализованные данные
3%
Для чего используются контроллеры в Nest.js
3%
Для чего используются модули в Nest.js
3%
Для чего используются сервисы в Nest.js
3%
Для чего нужен Redis
3%
Для чего нужен SQL
3%
Для чего нужен паттерн Decorator
3%
Для чего нужны guards
3%
Для чего нужны интерфейсы в TypeScript
3%
Для чего пришел на собеседование
3%
Для чего указывается размер изображения в коде
3%
Доводилось ли отстаивать идеи и предложения
3%
Документировал ли код
3%
Есть какие-то вопросы
3%
Есть ли Singleton в NestJS


Есть ли body в server response
3%
Есть ли высокая цель по развитию
3%
Есть ли какая-либо глобальная цель
3%
Есть ли какая-либо цель
3%
Есть ли многопоточность в Node.js при запросах к файловой системе
3%
Есть ли множественное наследование в TypeScript
3%
Есть ли моменты, которые хочется изменить в текущей компании
3%
Есть ли опыт общения с заказчиками
3%
Есть ли опыт погружения в действующие проекты
3%
Есть ли опыт работы с Generic в TypeScript
3%
Есть ли опыт работы с Jenkins
3%
Есть ли опыт работы с Unit тестами
3%
Есть ли профильное образование в разработке
3%
Есть ли список требований к коду для Code Review
3%
Есть ли хобби
3%
Есть ли цель для развития
3%
За что отвечает NPM
3%
Заполняешь ли документацию в проекте
3%
Зачем нужен Dependency Inversion
3%
Зачем нужен Promise
3%
Зачем нужен SOLID
3%
Зачем нужен WebSocket
3%
Зачем нужен индекс
3%
Зачем нужен связанный список
3%
Зачем нужен слой в Docker
3%
Зачем нужна MongoDB
3%
Зачем нужна инкапсуляция
3%
Зачем нужны guards
3%
Знаешь ли теорию БД
3%
Из каких компонентов состоит Nest.js
3%
Из каких компонентов состоит Node.js
3%
Из каких компонентов состоит runtime Node.js
3%
Из чего состоит Express.js
3%
Из чего состоит Node.js
3%
Из чего состоит структура HTTP-запроса
3%
Изменится ли состояние сервера при многократном обновлении записи с одними и теми же параметрами
3%
Изменяем ли String в JavaScript
3%
Изучал ли другие языки программирования
3%
Использовал ли Foreign Key
3%
Использовал ли GitFlow
3%
Использовал ли Grafana
3%
Использовал ли Index в БД
3%
Использовал ли Kubernetes
3%
Использовал ли ORM
3%
Использовал ли REST на проекте
3%
Использовал ли Redis для кэширования
3%
Использовал ли Redis только для кэширования
3%
Использовал ли Swagger
3%
Использовал ли generic вместе с infer
3%
Использовал ли infer в TypeScript


Использовал ли в работе Kafka
3%
Использовал ли другие реляционные базы кроме PostgreSQL
3%
Использовал ли нетипичные библиотеки
3%
Использовал ли паттерн Revealing Constructor
3%
Использовал ли фреймворк
3%
Используешь ли кодогенерацию в проекте
3%
Используешь ли терминал
3%
К какому паттерну относится шаблонный метод
3%
К какому типу БД относится MongoDB
3%
К какому уровню модели OSI относится HTTP
3%
К чему стремишься в Backend разработке
3%
К чему стремишься в профессиональном развитии
3%
К чему хочешь прийти
3%
Как Node.js обрабатывает большое количество request
3%
Как TypeScript позволяет реализовывать полиморфизм
3%
Как аргументируешь свои идеи руководителю
3%
Как браузер узнает размер изображения
3%
Как будешь делать систему авторизации с тремя ролями - пользователь, менеджер, администратор
3%
Как будешь планировать рабочий день на удаленке
3%
Как был настроен процесс деплоя в проекте
3%
Как было сделано тестирование в проекте
3%
Как в JavaScript можно обойти использование наследования
3%
Как в БД указать несколько ролей пользователя
3%
Как в проекте взаимодействовал с нейросетями
3%
Как велась разработка до появления async/await
3%
Как видишь свое дальнейшее развитие
3%
Как видишь себя в будущем
3%
Как вставить элемент в БД
3%
Как выбираешь СУБД на новом проекте
3%
Как выполнить все асинхронные запросы
3%
Как выстраиваешь тайм-менеджмент
3%
Как гарантировать чтобы при работе с RabbitMQ в него не клал значение другой микросервис
3%
Как глубоко знаешь Docker
3%
Как глубоко погружался в чистый SQL за рамками ORM
3%
Как давно изучаешь TypeScript
3%
Как давно переехал
3%
Как давно работаешь на Linux
3%
Как делить очереди
3%
Как дождаться выполнения Promise
3%
Как дождаться результата выполнения асинхронной операции
3%
Как должны храниться данные в третьей форме
3%
Как запускал новые коды в Kubernetes
3%
Как защититься от SQL Injection
3%
Как изменить контекст в JavaScript
3%
Как исполняется код на TypeScript
3%
Как использовал генератор
3%
Как использовать Bind
3%
Как используется guard
3%
Как используешь мета-данные
3%
Как минимизировать время когда приложение не работает при деплое

Как можно использовать инкапсуляцию
3%
Как настраивал взаимодействие между микросервисами
3%
Как обеспечивал транзакции между двумя базами данных
3%
Как обеспечить чтобы два приложения с RabbitMQ не перезатерли друг друга
3%
Как обрабатываются ошибки в NestJS
3%
Как обработать ошибку обратной несовместимости изменений
3%
Как определить Layout Shift
3%
Как оптимизировать большую таблицу в MongoDB
3%
Как оптимизировать запросы к БД
3%
Как организовываешь свой день
3%
Как организуешь свое время
3%
Как относишься к DevOps
3%
Как относишься к приемке проекта не с нуля
3%
Как относишься к приемке проекта не с нуля где некому рассказать о проекте
3%
Как относишься к работе разработчиком
3%
Как относишься к соблюдению регламентов
3%
Как относишься к трудностям
3%
Как отобразится изображение, если не указан размер
3%
Как отстаивал свою точку зрения
3%
Как оцениваешь свои знания
3%
Как оцениваешь свои знания TypeORM
3%
Как оцениваешь свои навыки в Express
3%
Как оценить быстродействие приложения на Node.js
3%
Как передаются параметры функций в JavaScript
3%
Как перенимал чужие задачи
3%
Как планируешь время
3%
Как планируешь рабочее время
3%
Как планируешь рабочий день при удаленном формате работы
3%
Как планируешь свой день
3%
Как планируешь свою работу
3%
Как поддерживаешь свой уровень как разработчик
3%
Как поддерживаешь свой уровень разработки
3%
Как поддерживаешь уровень знаний в других языках программирования
3%
Как подключить модуль в Node.js
3%
Как получал задачи в проекте
3%
Как пришёл в IT
3%
Как проверить значение на NaN
3%
Как проверить наличие поля у объекта
3%
Как проверяешь свою работу на наличие ошибок
3%
Как проверял токен в приложении
3%
Как происходит взаимодействие в команде
3%
Как происходит загрузка страницы в браузере
3%
Как происходит отображение страницы в браузере
3%
Как прокачиваешь свои навыки как разработчик
3%
Как прокачиваешь свою экспертизу в Node.js
3%
Как проходил день при удаленном формате работы
3%
Как проходила адаптация
3%
Как проходила адаптация в проектах не с нуля
3%
Как проходило тестирование в проектах
3%
Как проходит Code Review на текущем месте работы


Как проходит твой день
3%
Как работает Event Loop
3%
Как работает Relation в TypeORM
3%
Как работает Replace
3%
Как работает SSR-технология
3%
Как работает bind для функций
3%
Как работает асинхронность в Node.js
3%
Как работает принцип Dependency Injection
3%
Как работает цепочка в NestJS
3%
Как разместить БД в контейнере не нарушив ее целостность
3%
Как разнесешь по таблицам массив автомобилей, марок и владельцев
3%
Как распараллелить процесс с большим количеством данных в очереди
3%
Как распределяешь важные задачи в течение дня
3%
Как распределяешь рабочее время
3%
Как расставлял приоритет у задач в проекте
3%
Как реализовать Fallback alignment в CSS
3%
Как реализовать взаимодействие frontend и API
3%
Как реализовать восстановление ресурсов с сервера
3%
Как реализовать многопоточность в Node.js
3%
Как реализовать многопоточность используя userland в Node.js
3%
Как реализовывал принципы SOLID на практике
3%
Как реализуется многопоточность в Node.js
3%
Как реализуется сортировка в NestJS
3%
Как решаешь циклические зависимости
3%
Как решал возникающие проблемы
3%
Как решить проблему утечки памяти на проекте
3%
Как с помощью замыканий реализовать инкапсуляцию в JavaScript
3%
Как саморазвиваешься в Backend
3%
Как сделать lock на уровне базы данных
3%
Как сделать чтобы сложная математическая функция не занимала много процессов в Event Loop
3%
Как сейчас развиваешься
3%
Как систематизируешь свою работу
3%
Как скоро готов принять решение по офферу
3%
Как совершенствуешь знания
3%
Как справлялся с выгоранием
3%
Как удалить элемент из БД
3%
Как удалось принять сложное решение
3%
Как указать в методе что должен прийти какой-либо тип
3%
Как указать формат изображения в коде
3%
Как устраивал взаимодействие с worker threads
3%
Как устроен pipeline проекта
3%
Как хорошо знаешь RabbitMQ
3%
Как часто вносил идеи в команду
3%
Как часто инициируешь изменения в проект
3%
Как часто инициируешь изменения в работе
3%
Как часто предлагал менять процессы в работе
3%
Как часто привносишь свои идеи в работу
3%
Какая архитектура помимо микросервисной реализована в Nest.js
3%
Какая временная сложность полного перебора двумя вложенными циклами
3%
Какая временная сложность получения элемента из Map


Какая используется модель гарантии доставки на проекте
3%
Какая команда в Linux отвечает за смену прав доступа к файлу
3%
Какая оценка времени доступа к элементу hash table
3%
Какая оценка времени доступа к элементу linked list
3%
Какая оценка времени доступа по индексу к элементу массива
3%
Какая разница с московским временем
3%
Какая структура у HTTP-запроса
3%
Какая структура цикла у Event Loop в Node.js
3%
Какая характеристика отвечает за быстродействие приложения на Node.js
3%
Какие Backend задачи делал в проекте
3%
Какие HTTP-методы должны быть идемпотентны
3%
Какие Hooks позволяют оптимизировать React
3%
Какие Quality Gates используешь
3%
Какие БД использовал
3%
Какие аргументы принимает useEffect
3%
Какие библиотеки использовал для работы с WebSocket
3%
Какие библиотеки использовал при работе с БД
3%
Какие были БД на последнем проекте
3%
Какие были способы ожидания выполнения асинхронной операции до появления async/await
3%
Какие данные браузер кеширует по умолчанию
3%
Какие должны быть свойства у транзакции
3%
Какие есть неустранимые дефекты в Node.js
3%
Какие есть принципы у REST приложений
3%
Какие есть способы управления потоками в Node.js
3%
Какие есть фазы в SDLC
3%
Какие есть функции чтения файлов в FS Module
3%
Какие задачи решал на WebSocket
3%
Какие знаешь Branching Strategy
3%
Какие знаешь ORM
3%
Какие знаешь RESTful принципы
3%
Какие знаешь асинхронные операции
3%
Какие знаешь асинхронные функции в Node.js
3%
Какие знаешь версии HTTP
3%
Какие знаешь виды СУБД
3%
Какие знаешь виды тестов
3%
Какие знаешь встроенные типы в TypeScript
3%
Какие знаешь идемпотентные методы
3%
Какие знаешь инструменты для работы с БД в Node.js
3%
Какие знаешь инструменты масштабирования кроме worker threads
3%
Какие знаешь команды в Linux
3%
Какие знаешь методы управления асинхронными операциями в Node.JS
3%
Какие знаешь основные операторы в SQL
3%
Какие знаешь паттерны в программировании
3%
Какие знаешь практики обеспечения безопасности на проекте
3%
Какие знаешь принципы REST
3%
Какие знаешь принципы REST-приложений
3%
Какие знаешь принципы RESTful приложений
3%
Какие знаешь принципы RESTful приложения
3%
Какие знаешь принципы транзакций
3%
Какие знаешь свойства транзакций


Какие знаешь сетевые протоколы
3%
Какие знаешь синхронные операции
3%
Какие знаешь синхронные функции в Node.js
3%
Какие знаешь способы изоляции в CSS
3%
Какие знаешь способы объявления переменных в JavaScript
3%
Какие знаешь способы работы с асинхронным кодом
3%
Какие знаешь способы реализации RealTime взаимодействия
3%
Какие знаешь структурные паттерны проектирования
3%
Какие знаешь типы Stream в Node.JS
3%
Какие знаешь типы stream
3%
Какие знаешь типы данных в JavaScript
3%
Какие знаешь типы полей таблицы в SQL
3%
Какие знаешь типы связи между таблицами БД
3%
Какие знаешь уровни Node.js
3%
Какие знаешь уровни изоляции в базе данных
3%
Какие знаешь уровни изоляции транзакции в PostgreSQL
3%
Какие знаешь уровни нормализации
3%
Какие знаешь фазы Node.js
3%
Какие знаешь форматы изображений
3%
Какие знаешь формы баз данных
3%
Какие знаешь этапы обработки запросов в NestJS
3%
Какие инструменты используешь для повышения профессиональных навыков
3%
Какие инструменты используешь для развития
3%
Какие инструменты тайм-менеджмента используешь в работе
3%
Какие использовал функциональные языки
3%
Какие используешь паттерны проектирования
3%
Какие книги по программированию читаешь
3%
Какие красные флаги в компании, в которой не будешь работать
3%
Какие курсы проходил
3%
Какие материалы изучал по Node.js
3%
Какие методы жизненного цикла можно реализовать в классовом компоненте
3%
Какие методы жизненного цикла нельзя реализовать в функциональном компоненте
3%
Какие могут быть проблемы при сортировки с параметризуемым методом
3%
Какие негативные аспекты в компании считаешь неприемлемыми
3%
Какие основные ограничения у REST
3%
Какие основные цели создания Node.js
3%
Какие паттерны разработки знаешь
3%
Какие писал тесты
3%
Какие планы на профессиональное развитие
3%
Какие плюсы и минусы Django
3%
Какие плюсы и минусы Knex.js
3%
Какие плюсы и минусы MongoDB
3%
Какие плюсы и минусы Node.js
3%
Какие плюсы и минусы PostgreSQL
3%
Какие плюсы и минусы Prisma
3%
Какие плюсы и минусы Python
3%
Какие плюсы и минусы SSR-технологии
3%
Какие плюсы и минусы TypeORM
3%
Какие плюсы и минусы индексирования каждой колонки
3%
Какие плюсы и минусы использования Index в БД

Какие плюсы и минусы использования JSON Web Token
3%
Какие плюсы и минусы использования MongoDB
3%
Какие плюсы и минусы использования PostgreSQL
3%
Какие плюсы и минусы использования Sequelize
3%
Какие плюсы и минусы использования this в javaScript
3%
Какие плюсы и минусы использования var
3%
Какие плюсы и минусы компании в которой работаешь
3%
Какие плюсы и минусы массива
3%
Какие плюсы и минусы работы с Effector
3%
Какие плюсы и минусы расположения БД в контейнере
3%
Какие плюсы и минусы связанных списков
3%
Какие плюсы и минусы созвонов
3%
Какие проблемы возникали при работе с Kafka
3%
Какие проблемы возникают при использовании динамического import в Node.js
3%
Какие проекты были по масштабу
3%
Какие проекты на TypeScript реализовывал
3%
Какие проекты реализовал на Express.js
3%
Какие проекты реализовал на NestJS
3%
Какие проекты реализовал на TypeScript
3%
Какие ресурсы используешь для изучения новых знаний
3%
Какие самые часто используемые функции в SQL
3%
Какие системные модули использует Node.js
3%
Какие существуют системы модульности в Node.js
3%
Какие тесты писал
3%
Какие типы данных в JavaScript относятся к простым
3%
Какие типы данных в JavaScript относятся к сложным
3%
Какие утилиты чаще всего используешь в TypeScript
3%
Какие уязвимости показывает npm audit
3%
Какие форматы изображений поддерживает тег <img>
3%
Какие шаги предпримешь для погружения в действующий проект
3%
Каким образом развиваешь свои навыки
3%
Какими инструментами пользуешься для получения новых знаний
3%
Какими языками интересуешься помимо основного
3%
Каково нести ответственность за чужой код
3%
Какое было самое сложное решение
3%
Какое значение вернет асинхронная функция без return
3%
Какое значение у NaN в JavaScript
3%
Какое количество API разработал на Express
3%
Какое количество API разработал на NestJS
3%
Какое цветовое ограничение у .gif
3%
Какое цветовое ограничение у .jpeg
3%
Какое цветовое ограничение у .png
3%
Какой Task Tracker использовал
3%
Какой был состав команды на последнем проекте
3%
Какой диапазон нормальных значений Event Loop Latency
3%
Какой запрос быстрее: DELETE или TRUNCATE
3%
Какой используешь стек на backend части проекта
3%
Какой любимый фреймворк
3%
Какой опыт на Express
3%
Какой опыт работы с AI


Какой опыт работы с Java
3%
Какой опыт работы с Kubernetes
3%
Какой опыт работы с TypeORM
3%
Какой опыт работы с БД
3%
Какой опыт работы с брокерами
3%
Какой опыт работы с декораторами
3%
Какой опыт работы с чистым SQL
3%
Какой опыт разработки на NestJS
3%
Какой опыт разработки на TypeScript
3%
Какой опыт с настройкой CI/CD
3%
Какой опыт с нативным SQL
3%
Какой основной фреймворк используешь
3%
Какой подход обработки запросов использует Express.js
3%
Какой принцип работы у queue
3%
Какой принцип работы у stack
3%
Какой самый масштабный проект делал на Node.js
3%
Какой стек был в проекте
3%
Какой у тебя грейд
3%
Какой уровень знания в MongoDB
3%
Какой уровень знания в PostgreSQL
3%
Какой формат работы предпочитаешь: удалённый или офисный
3%
Какой фреймворк в Node.js предпочитаешь
3%
Какой фреймворк используешь чаще всего
3%
Какой язык программирования больше всего нравится
3%
Какую ORM используешь в NestJS
3%
Какую OS используешь
3%
Какую идею привнес в проект
3%
Какую инициативу вносил в работу
3%
Какую используешь Branching Strategy
3%
Какую используешь ОС
3%
Какую используешь семантику модели доставки сообщения
3%
Какую профессиональную цель хочешь достичь
3%
Какую самую интересную задачу решал
3%
Какую статистику собираешь во время разработки
3%
Кешируется ли модуль при подключении с помощью require
3%
Когда в Node.js появилась JIT-компиляция
3%
Когда используется any в TypeScript
3%
Когда используется null
3%
Когда используется type в TypeScript
3%
Когда используется undefined
3%
Когда используется undefined в TypeScript
3%
Когда можно не использовать NestJS
3%
Когда начал изучать SQL
3%
Когда начал писать на TypeScript
3%
Когда не стоит использовать дублирующий код
3%
Когда не стоит использовать микросервисы
3%
Когда первичный ключ является составным
3%
Когда происходит контроль изменений в VDOM
3%
Когда происходит миграция базы данных при деплое
3%
Когда происходит оптимизация JS-кода в Node.js


Когда стоит использовать MongoDB
3%
Когда стоит использовать PostgreSQL
3%
Когда стоит продолжать дублировать код
3%
Комфортнее работать в офисе или на удаленке
3%
Комфортнее работать удаленно или в офисе
3%
Кто был инициатором отправки данных на WebSocket в проекте
3%
Кто принимал решение между выбором монолита и микросервиса
3%
Могут ли interface расширять друг друга в TypeScript
3%
Может ли CSS заблокировать rendering HTML-страницы
3%
Может ли JavaScript заблокировать rendering HTML-страницы
3%
Может ли NoSQL база подвиснуть на несколько секунд
3%
Может ли Node.js исполнять файл TypeScript
3%
Может ли быть заблокирован Event Loop
3%
Может ли первичный ключ быть составным
3%
Можно ли использовать объект в качестве ключа внутри объекта
3%
Можно ли оценить производительность приложения с помощью Libuv
3%
Можно ли очистить кеш во время выполнения кода
3%
Можно ли передать id в POST-запросе
3%
Можно ли передать данные с помощью GET запроса
3%
Можно ли скрыть только поля при инкапсуляции
3%
Можно ли унифицировать CRUD операции
3%
На всех ли проектах был RabbitMQ
3%
На какой платформе построен Node.js
3%
На каком протоколе основан HTTP-запрос
3%
На каком стеке не работал
3%
На каком этапе проекта подключался к нему
3%
На какую заработную плату ориентируешься
3%
На основе чего создан фреймворк на котором работаешь
3%
На сколько покрываешь код тестами
3%
На уровне операционной системы Node.js является однопоточным или многопоточным
3%
На что будешь ориентироваться при выборе оффера
3%
На что делится HTTP
3%
Над какими проектами работал
3%
Над какими проектами хотел бы поработать
3%
Насколько глубоко изучала TypeScript
3%
Насколько хорошо владеешь PostgreSQL
3%
Насколько хорошо владеешь TypeScript
3%
Нравится ли работать на NestJS
3%
Нужен ли DRY при использовании SOLID
3%
Нужно ли было масштабировать проект
3%
Нужно ли добавлять в commit package-lock.json
3%
Обучался ли разработке самостоятельно
3%
Обязательны ли тесты в Backend
3%
Однопоточен ли Event Loop в Node.js
3%
Организовывал ли пересылку событий через RabbitMQ
3%
Осознанно выбрал место учебы
3%
От чего внедрение зависимостей оберегает на практике
3%
Относятся ли сессии к REST
3%
Ощущаешь выгорание к компании или к работе
3%
Писал ли generic в TypeScript


Писал ли геттеры
3%
Писал ли документацию на проектах
3%
Писал ли проекты с нуля
3%
Писал ли сначала на JavaScript
3%
Писал ли только на TypeScript
3%
Пишешь ли тесты
3%
Поддерживают ли декораторы только методы
3%
Покрываешь свой код тестами
3%
Пользуешься ли принципами SOLID
3%
Почему DELETE-запрос является идемпотентным
3%
Почему Node.JS считается однопоточным ЯП
3%
Почему Node.js однопоточный
3%
Почему PostgreSQL может отказаться делать поиск по индексу на поле
3%
Почему PostgreSQL может отменить индексирование
3%
Почему выбрал Backend
3%
Почему выбрал Backend а не Frontend
3%
Почему выбрал Node.js
3%
Почему выбрал именно Frontend
3%
Почему выбрал работу программистом
3%
Почему заинтересовался разработкой
3%
Почему изображение выгружается через GET-запрос
3%
Почему интерпретируемые ЯП медленнее компилируемых
3%
Почему лучше использовать hasOwnProperty
3%
Почему не выбрал Frontend
3%
Почему не устроило предыдущее место работы
3%
Почему некоторые HTTP-методы должны быть идемпотентны
3%
Почему некоторые методы в HTTP идемпотентные
3%
Почему некоторые методы в HTTP не идемпотентные
3%
Почему нельзя везде использовать индексы
3%
Почему предпочитаешь микросервисы
3%
Почему пришел в разработку
3%
Почему работа может не идти в какое-либо время
3%
Почему решил стать разработчиком
3%
Почему уходишь с нынешнего места работы
3%
Почему функция в setTimeout может вызваться позже чем указано время задержки
3%
Почему хочешь сменить компанию
3%
Почему хочешь сменить место работы
3%
Почему хочешь углубляться в архитектуру
3%
Предпочитаешь работать с нативным SQL или ORM
3%
Приведи базовые команды работы с NPM
3%
Приведи пример задачи на производительность
3%
Приведи пример запроса на чтение в БД
3%
Приведи пример идеи, которую удалось реализовать в работе
3%
Приведи пример инкапсуляции
3%
Приведи пример использования clouser
3%
Приведи пример использования микросервисной архитектуры
3%
Приведи пример использования монолитной архитектуры
3%
Приведи пример использования составного первичного ключа в БД
3%
Приведи пример как согласовывал новую фичу с руководством
3%
Приведи пример проекта который реализовал в последнее время


Приведи пример реализованных идей оптимизации работы команды
3%
Применяешь ли инструменты тайм-менеджмента
3%
Принимал ли запущенный проект
3%
Принимал ли проект не с нуля
3%
Принимал ли решение какую базу данных использовать в проекте
3%
Приходилось ли отстаивать свои идеи
3%
Приходилось ли отстаивать свои идеи в команде
3%
Приходилось ли отстаивать свои идеи на проекте
3%
Приходилось ли отстаивать свои предложения на проекте
3%
Проводил ли Code Review
3%
Продолжит ли работу Promise.all если какая-либо ветка запросов упадет
3%
Проходил ли дополнительные курсы
3%
Проходил ли собеседования
3%
Проходишь ли какие-либо курсы
3%
Работает ли Redux без React
3%
Работаешь больше с JavaScript или с TypeScript
3%
Работаешь в аутсорсе
3%
Работаешь в аутстаффе
3%
Работаешь ли с брокером RabbitMQ
3%
Работал Backend-разработчиком в команде или один
3%
Работал ли Fullstack-разработчиком
3%
Работал ли в команде
3%
Работал ли в последнее время во Frontend
3%
Работал ли в разных компаниях
3%
Работал ли на одном проекте с одной командой
3%
Работал ли одним Backend-разработчиком на микросервисе
3%
Работал ли с CRUD
3%
Работал ли с Debounce
3%
Работал ли с DevOps-инструментами
3%
Работал ли с Docker Swarm
3%
Работал ли с Event Loop Lag
3%
Работал ли с Event Loop Latency
3%
Работал ли с EventEmitter
3%
Работал ли с Excel
3%
Работал ли с Express в production
3%
Работал ли с Express только в Node.js
3%
Работал ли с Express.js
3%
Работал ли с Git
3%
Работал ли с GraphQL
3%
Работал ли с JOIN
3%
Работал ли с JSON Web Token
3%
Работал ли с Migrations
3%
Работал ли с Molekuler.js
3%
Работал ли с MongoDB
3%
Работал ли с MySQL
3%
Работал ли с Passport.js
3%
Работал ли с Patroni в PostgreSQL
3%
Работал ли с REST API
3%
Работал ли с Redis
3%
Работал ли с Redux


Работал ли с Seeds
3%
Работал ли с Throttle
3%
Работал ли с Trunk-Based Git
3%
Работал ли с WebSocket
3%
Работал ли с WebSockets
3%
Работал ли с tsconfig.json
3%
Работал ли с worker threads
3%
Работал ли с БД
3%
Работал ли с БД напрямую
3%
Работал ли с архитектурой
3%
Работал ли с библиотеками управления состояниями
3%
Работал ли с какими-либо ORM помимо TypeORM
3%
Работал ли с кешем в Node.js
3%
Работал ли с многопоточностью на Node.js
3%
Работал ли с мобильными приложениями
3%
Работал ли с нереляционными БД
3%
Работал ли с оптимизацией больших изображений
3%
Работал ли с отдельными микросервисами в NestJS
3%
Работал ли с разделяемой памятью
3%
Работал ли с разными командами
3%
Работал ли с системами сообщений
3%
Работал ли с транзакцией в БД
3%
Работал ли с транзакциями в SQL
3%
Работал ли с управлением памятью
3%
Работал ли со Stream API
3%
Работал с БД в контейнерах по типу Docker
3%
Работал с монолитным или микросервисным приложением
3%
Работала с Generics
3%
Развертывал ли контейнер на Docker
3%
Развертывал ли самостоятельно Docker контейнер
3%
Разрешено ли множественное наследование в TypeScript
3%
Разрешит ли PostgreSQL сделать неуникальное поле индексом
3%
Расскажи о неудачном проекте
3%
Расскажи о проектах на Node.js
3%
Расскажи про SDLC на текущем проекте
3%
Расскажи про опыт Node.JS разработки
3%
Расскажи про опыт как Node.js разработчика
3%
Расскажи про опыт работы с ORM
3%
Расскажи про опыт работы с микросервисами
3%
Расскажи про проекты на Express
3%
Расскажи про проекты на Node.js
3%
Расскажи про самое сложное решение в твоей жизни
3%
Расскажи про свои проекты
3%
Расскажи про свой опыт node.js
3%
Расскажи про свой опыт интеграции на прошлом проекте
3%
Расскажи про свой опыт работы с брокерами
3%
Расскажи про свой последний проект
3%
Расскажи про технологии с которыми работал
3%
Рассматриваешь ли удаленную работу
3%
Расшифруй аббревиатуру SOLID


Реактивен ли React
3%
Реализовывал ли Decorator на TypeScript
3%
Реализовывал ли авторизацию на Node.js
3%
Реализовывал ли проект с нуля
3%
Решает ли экранирование проблему SQL Injection
3%
Решаешь ли LeetCode
3%
Решал ли задачи на Codewars
3%
Решал ли задачи на LeetCode
3%
Решал ли задачи производительности БД
3%
С каким стеком работал больше всего
3%
С каким стеком технологий работал
3%
С каким стеком технологий хочешь работать
3%
С какими Message Broker работал
3%
С какими SQL базами работал
3%
С какими БД работает SQL
3%
С какими операционными системами работал
3%
С какими паттернами работал
3%
С какими платежными системами работал
3%
С какими проблемами сталкивался при работе с TypeORM
3%
С какими сложностями столкнулся при переходе с монолита на микросервисы
3%
С какими фреймворками в Node.js работал
3%
С какой версией TypeScript работал
3%
С какой фазы начинается цикл Event Loop в Node.js
3%
С чем работал в Git
3%
Сколько backend-разработчиков было в команде
3%
Сколько было всего проектов
3%
Сколько было крупномасштабных проектов на Node.js
3%
Сколько было пользователей отслеживающих приложение в проекте
3%
Сколько было потребителей сообщений в RabbitMQ в одну очередь
3%
Сколько было проектов за все время работы
3%
Сколько было проектов на NestJS
3%
Сколько времени нужно для того чтобы выйти на новое место работы
3%
Сколько времени понадобилось, чтобы влиться в последний проект
3%
Сколько времени понадобится для адаптации в проекте
3%
Сколько времени работал с NestJS
3%
Сколько делал проектов на Node.js
3%
Сколько коммерческого опыта в PostgreSQL
3%
Сколько лет в разработке
3%
Сколько лет коммерческого опыта
3%
Сколько лет опыта работы
3%
Сколько лет опыта работы на Node.js
3%
Сколько проектов было на Node.js
3%
Сколько проектов было с Node.js
3%
Сколько проектов было с PostgreSQL
3%
Сколько проектов в практике были с Node.js
3%
Сколько проектов писал с Express
3%
Следил ли за изменениями Linux
3%
Сложно ли будет перейти работать на RabbitMQ
3%
Слышал ли про ООП
3%
Сможешь ли написать запрос JOIN в SQL


Сможешь ли написать сложный SQL запрос
3%
Со скольки проектами работал
3%
Соблюдаешь ли work-life balance
3%
Создавал ли роутер
3%
Сталкивался ли c PostgreSQL
3%
Сталкивался ли с JOIN
3%
Сталкивался ли с Middleware
3%
Сталкивался ли с ООП
3%
Сталкивался ли с дженериками
3%
Сталкивался ли с нативным SQL
3%
Сталкивался ли с тестами
3%
Сталкивался ли с транзакциями в ORM
3%
Сталкивался ли с транзакциями в SQL запросах
3%
Сталкивался ли с циклической зависимостью
3%
Твои действия, если во время рабочего звонка выключился Интернет
3%
Твои действия, если во время рабочего звонка выключился свет
3%
Твои действия, если тебе поступит амбициозная задача, которая будет выбиваться из твоей стандартной нагрузки
3%
Твои действия, если тебе приходит задача, которая сверх твоей рабочей нормы
3%
Тренируешься ли CodeWars
3%
У каких методов HTTP-запроса нет Body
3%
Умеет ли NestJS работать с TCP
3%
Умеет ли NestJS работать с UDP
3%
Умеет ли NestJS работать с чем-либо кроме HTTP
Участвовал ли в дискуссиях
Ушел ли с последнего места работы
Хорошо ли умеешь объяснять сложные вещи простым языком
Хочешь работать в web или в mobile
Хочешь развиваться в сторону архитектуры ПО
Хочешь развиваться как DevOps
Хочешь развиваться как Fullstack или как Backend-разработчик
Хочешь развиваться как TeamLead
Хочешь управлять командой
Часто ли использовал PostgreSQL без ORM
3%
Часто ли предлагаешь идеи в работе
3%
Часто ли реализуешь идеи в работе
3%
Чего не хватает в знаниях NestJS
3%
Чего не хватает в знаниях Node.js
3%
Чего хочешь достичь в работе
3%
Чем будешь руководствоваться при выборе сложной задачи
3%
Чем должна обладать идеальная компания, чтобы тебе в ней было комфортно
3%
Чем должна обладать хорошая компания
3%
Чем занимаешься в свободное время кроме работы
3%
Чем занимаешься на основной работе
3%
Чем занимаешься на текущем проекте
3%
Чем занимался на проектах на которых работал
3%
Чем занимался на прошлых проектах
3%
Через сколько сможешь уйти с нынешнего места работы
3%
Что больше всего не нравится в текущей компании
3%
Что будет если поменять значение в проиндексированном поле
3%
Что будешь делать если поймешь что устал от работы


Что будешь делать если посчитаешь идею коллеги плохой
3%
Что будешь делать если при передаче данных в NoSQL произошла ошибка
3%
Что будешь делать если придешь на проект где нет предыдущего Backend-разработчика
3%
Что будешь делать при ощущении выгорания
3%
Что было до Promise
3%
Что было на Frontend на последнем месте работы
3%
Что входит в модуль в NestJS
3%
Что выполняет npm audit
3%
Что делаешь чтобы не допускать ошибок
3%
Что заинтересовало в GO
3%
Что заинтересовало в вакансии
3%
Что изучаешь нового
3%
Что использовал помимо JavaScript
3%
Что использовал помимо Node.js
3%
Что используешь для валидации данных в Express.js
3%
Что используешь для хранения коллекции в JavaScript
3%
Что может заблокировать parsing HTML-страницы
3%
Что может заблокировать rendering HTML-страницы
3%
Что можешь сказать про компании, в которых работал
3%
Что нравится больше: Backend или Frontend
3%
Что нужно для постоянного развития на работе
3%
Что ожидаешь от вакансии
3%
Что означает буква A в ACID
3%
Что означает однопоточность Node.js
3%
Что отвечает за оптимизацию кода в Node.js
3%
Что отвечает за последовательность вызовов в Node.js
3%
Что позволяет пользоваться полиморфизмом в NestJS
3%
Что позволяет пользоваться полиморфизмом в Node.js
3%
Что привлекает в Backend
3%
Что происходит при передаче JavaScript кода в Node.js
3%
Что реализовывал в типизации
3%
Что такое ACID
3%
Что такое ACID в БД
3%
Что такое Async/Await
3%
Что такое BASE в БД
3%
Что такое Big O Notation
3%
Что такое Blockchain простыми словами
3%
Что такое Blue-Green Deployment
3%
Что такое CORS
3%
Что такое Circular Dependencies в NestJS
3%
Что такое CommonJS-модуль
3%
Что такое DDD
3%
Что такое DOM в JavaScript
3%
Что такое Decorator
3%
Что такое Event Emitter в Node.JS
3%
Что такое Event Loop
3%
Что такое Falsy значения
3%
Что такое Foreign Key в БД
3%
Что такое GRASP
3%
Что такое Generics


Что такое Generics в TypeScript
3%
Что такое Guards в NestJS
3%
Что такое Hard Real-Time
3%
Что такое High Cohesion, применимо к микросервисной архитектуре
3%
Что такое ISR
3%
Что такое Interceptor в NestJS
3%
Что такое JOIN в БД
3%
Что такое JSON Web Tolen
3%
Что такое Jenkins
3%
Что такое Kafka
3%
Что такое Layered Architecture
3%
Что такое Low coupling
3%
Что такое Map
3%
Что такое Map в JavaScript
3%
Что такое Middleware в Node.js
3%
Что такое NATS
3%
Что такое NestJS
3%
Что такое Node.js
3%
Что такое OCP
3%
Что такое PEP8
3%
Что такое PGBalancer в PostgreSQL
3%
Что такое Package.json
3%
Что такое Pipe в NestJS
3%
Что такое PostgreSQL
3%
Что такое PreparedStatement
3%
Что такое Promise
3%
Что такое Promise в JavaScript
3%
Что такое Promise.all
3%
Что такое Queue
3%
Что такое REST - архитектура
3%
Что такое SELF JOIN в SQL
3%
Что такое SQL Injection
3%
Что такое Seeds в БД
3%
Что такое Set
3%
Что такое Set в JavaScript
3%
Что такое Single Responsibility Principle
3%
Что такое Singletone
3%
Что такое Stack
3%
Что такое Stream в Node.JS
3%
Что такое TDZ
3%
Что такое ThreadPool
3%
Что такое Truthy значения
3%
Что такое Type Guard
3%
Что такое TypeORM
3%
Что такое UDP
3%
Что такое Unit-тестирование
3%
Что такое VDOM в React
3%
Что такое VIEW в БД
3%
Что такое Weak Reference в JavaScript
3%
Что такое Worker Threads в Node.js


Что такое any в TypeScript
3%
Что такое cluster
3%
Что такое decorator в NestJS
3%
Что такое dependency inversion principle
3%
Что такое deploy
3%
Что такое durability в ACID
3%
Что такое getter
3%
Что такое hosting
3%
Что такое infer в TypeScript
3%
Что такое init в ОС
3%
Что такое interceptor
3%
Что такое linked list в Node.js
3%
Что такое redirecting в HTTP
3%
Что такое repository в ORM
3%
Что такое stack в Node.js
3%
Что такое uTP
3%
Что такое unknown в TypeScript
3%
Что такое virtual host
3%
Что такое архитектура приложения
3%
Что такое аутсорсинг
3%
Что такое библиотека
3%
Что такое бинарное дерево поиска
3%
Что такое вертикальное масштабирование
3%
Что такое внедрение зависимостей
3%
Что такое внешний ключ
3%
Что такое внешний ключ в БД
3%
Что такое горизонтальное масштабирование
3%
Что такое декларативное программирование
3%
Что такое деоптимизация
3%
Что такое изменение состояния системы
3%
Что такое императивное программирование
3%
Что такое индекс в БД
3%
Что такое индексирование
3%
Что такое инкапсуляция в ООП
3%
Что такое интерфейсы в TypeScript
3%
Что такое каррирование в JS
3%
Что такое контекст в JavaScript
3%
Что такое массив
3%
Что такое масштабирование в Node.js
3%
Что такое метод Apply
3%
Что такое метод Bind
3%
Что такое метод Promise.allSettled
3%
Что такое механизм COW
3%
Что такое миграция в ORM
3%
Что такое миграция в БД
3%
Что такое модель OSI
3%
Что такое модуль в NestJS
3%
Что такое наследование
3%
Что такое наследование в ООП
3%
Что такое нормализация


Что такое нормализация базы данных
3%
Что такое оператор Infer в TypeScript
3%
Что такое оптимизация
3%
Что такое оптимистичная блокировка
3%
Что такое паттерн Singleton
3%
Что такое первичный внешний ключ
3%
Что такое первичный ключ в БД
3%
Что такое первичный ключ в базе данных
3%
Что такое перегрузка метода
3%
Что такое перегрузка функции
3%
Что такое переопределение метода
3%
Что такое переопределение функции
3%
Что такое перечисления enum в TypeScript
3%
Что такое полиморфизм в ООП
3%
Что такое порядок middleware
3%
Что такое принцип ACID
3%
Что такое принцип DRY
3%
Что такое принцип KISS
3%
Что такое принцип чистой архитектуры
3%
Что такое простой тип данных
3%
Что такое рекурсия
3%
Что такое сonsistency в ACID
3%
Что такое связанный список
3%
Что такое сложный тип данных
3%
Что такое слой в Docker
3%
Что такое транзакции в БД
3%
Что такое третья форма нормализации
3%
Что такое уровень изоляции
3%
Что такое уровни изоляции в БД
3%
Что такое утилита Parameters
Что такое файл с расширением .d.ts
Что такое фреймворк Express
Что такое фреймворк js-core
Что такое функция-конструктор
Что такое хорошая атмосфера
Что такое циклическая зависимость
Что такое чистая архитектура
Что такое шина данных
Что тебе удалось привнести в проекты
Что тебя интересует
Что чувствовал при принятии запущенного проекта
Что эффективнее использовать: ORM или прямой доступ к БД
Является ли DELETE-запрос идемпотентным
Является ли GET идемпотентным методом
Является ли GET-запрос идемпотентным
Является ли POST-запрос идемпотентным
Является ли PUT идемпотентным методом
Является ли PUT-запрос идемпотентным
используется ли на проекте in-memory state
Что делаешь для достижения поставленных перед собой целей
Как распределить монолит на микросервисы
В каких случаях применяются интерфейсы в TypeScript
Есть опыт работы с Docker
Приходилось ли писать SQL запросы
Расскажи про свой опыт работы с нереляционными базами данных
Расскажи как обычно проходит твой рабочий день
Сколько нужно времени, чтобы включиться в проект
Какие цели ставишь перед собой