Опишите, как браузер отрисовывает страницу React, включая детали, глубже чем Critical Render Path (архитектура Chromium).
Как браузер парсит HTML-страницу и какие этапы обработки документа происходят в процессе рендеринга?
Этапы построения отрисовки страницы в браузере
Из-за чего может тормозить страница
Приведи пример сущности, которая есть в DOM, но не попадает в render tree.
DigitalSail
Назначение и особенности работы Service Worker
F6 Кибербезопасность
📁 Web Workers и Service Workers
Почему браузер кеширует одни ресурсы, а другие нет?
Fatzoom
📁 Браузерные хранилища
Объясните, как работает отладка кода в браузере, где найти консоль и как её использовать?
Frontend
Как работает браузер после получения первого килобайта HTML? Что происходит дальше?
Garage
Какие есть способы общения между вкладками браузера?
HolyWeb
Что такое блокирующий CSS и как его оптимизировать?
Huntit
📁 Специфичность CSS селекторов
Что такое Intersection Observer API и как его использовать?
Polydev
📁 Нет темы
Как браузер работает с html, css, js? Что такое рендер, layout, repaint?
Rutube
Что происходит после получения HTML браузером? Опишите этапы рендеринга.
Rutube
Что такое DOM и как он используется в веб-разработке?
Sl Soft
📁 DOM и его особенности
В чем заключаются основные отличия между BOM и DOM в JavaScript и как они взаимодействуют с веб-страницей?
Smena
📁 DOM и его особенности
Что такое Intersection Observer и Mutation Observer и как они работают?
Start X
📁 Нет темы
Какие проблемы могут возникнуть при попытке интегрировать 3D графику с вебсокетами, учитывая производительность
Tecius
📁 Веб-технологии и доступность
Если у нас SPA, где лучше подключать скрипт?
Tilda Тильда
📁 Нет темы
Как реализовать оффлайн режим с последними сообщениями и сколько сообщений кешировать?
Unknown
Как организовать работу Service Worker в веб-приложении?
Unknown
Опиши механизм работы requestAnimationFrame и как он связан с отрисовкой браузера
Unknown
Что лучше использовать для кеширования сообщений: IndexedDB или localStorage?
Unknown
Как приложение в браузере получает домен сервера из переменной base.url?
Unknown
📁 Асинхронные API и Кэширование
Расскажите про critical render path.
Альфа-Банк
📁 Нет темы
Где можно подключить скрипт в HTML?
Альфа-Банк
📁 Нет темы
Что нельзя делать в WebWorkers?
БФТ
Как отловить момент прогрузки HTML? В чем отличие событий DOMContentLoaded и load?
Домклие
📁 DOM и его особенности
Опиши процесс рендера веб-страницы в браузере
Иннотех
📁 Нет темы
Какие этапы включает критический путь рендеринга?
Иннотех
📁 Рендеринг и рекурсия
В чем разница между reflow и repaint?
Лига Цифровой Экономики
📁 Рендеринг и рекурсия
Как на странице вызвать reflow?
Лига Цифровой Экономики
📁 Отрисовка страниц в браузере
Кратко опишите процесс построения страницы в браузере и основные его фазы.
Лига Цифровой Экономики
📁 Отрисовка страниц в браузере
Работает ли media-запрос prefers-reduced-motion как отключатель всех анимаций и как правильно его использовать?
Маквес
📁 Анимации в браузере
Как хранится информация в браузере? Опишите основные механизмы хранения данных
Промсвязьбанк
📁 Браузерные хранилища
Что такое web component, из чего он состоит и какие технологии используются?
Рв-Системс
📁 Веб-технологии и доступность
В чем разница между localStorage и Cookies?
Ртлабс
📁 Хранилища данных в браузере
Почему нативные события (native events) работают по-разному в разных браузерах?
Сбер
Опишите порядок срабатывания событий при клике на вложенные элементы div и p с обработчиками onclick, выводящими сообщения в консоль.
Сбер
📁 Нет темы
Вопросы по протоколам, CSS-селекторам, различия между display: none и visibility: hidden в DOM.
Сбер
📁 Нет темы
Какие свойства доступны у объекта Window в браузере?
Сбер
📁 Хуки и замыкания
Какие виды бом (scroll, resize, websockets, setTimeout, setInterval) нужно очищать и почему?
Северсталь
📁 Нет темы
Как можно подвесить событийный цикл в браузере?
Северсталь
📁 Нет темы
Что такое вспышка не стилизованного контента (FOUC)?
Совкомбанк
📁 Нет темы
Как отписаться от событий, добавленных через addEventListener и onClick
Совкомбанк
📁 Нет темы
Как можно кешировать изображения? Расскажите про механизм кеширования и как заставить браузер использовать кеш конкретного ресурса.
Согаз
📁 Браузерные хранилища
Перечисли все способы общения между тремя открытыми вкладками одного домена.
Спортс
📁 Веб-технологии и доступность
Опиши механизм, происходящий до рендера страницы, его название и способы оптимизации
Теле2
📁 Отрисовка страниц в браузере
Как сделать так, чтобы при перезагрузке страницы пользователь остался на том же месте скролла?
Тензор
📁 Отрисовка страниц в браузере
Как оптимизировать сложные задачи, которые блокируют рендеринг, используя вебворкеры?
ФАККТ
📁 Нет темы
Как можно начать прогружать другое веб-приложение заранее без оболочки, например, отслеживая событие наведения мышки, чтобы при клике ресурсы уже были в кеше?
ФГАОУ ВО МИИТ
📁 Нет темы
Какие основные этапы происходят после ввода адреса в браузере?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Что делал, если страница тормозила из-за скролла? Как искал узкие места (Chrome DevTools, Lighthouse)?
Яндекс
📁 Отрисовка страниц в браузере
Почему нельзя использовать HTML вместо DOM, если JavaScript работает только через DOM?
10 Бсс
📁 DOM и его особенности
Расскажите, как работает браузер, включая этапы обработки HTML, CSS, JavaScript и рендеринга страницы.
Action Tech
📁 Нет темы
Почему страница может прыгать при отрисовке и как этого избежать?
Alfabit
📁 Отрисовка страниц в браузере
Как бы ты решал ошибку на странице UI, например, если ошибка возникла во внешней библиотеке?
Angie
📁 Отрисовка страниц в браузере
Что такое Browser Object Model и какие объекты в него входят?
Angie
📁 Браузерные хранилища
Что произойдет, если у картинки установить кешируемость на 1 день?
Belitsoft
📁 Браузерные хранилища
В чем отличия атрибутов async и defer при подключении скриптов в HTML?
Bell Integrator
📁 Загрузка скриптов в JS
Что происходит после получения HTML страницы в браузере?
Bell Integrator
📁 Семантика HTML и HTML5
Что произойдет, если кликнуть на потомка через родителя? Опишите поведение событий.
BetBoom
📁 Нет темы
Как сервер может запретить чтение куки из браузера?
Click2Money
📁 Нет темы
Чем отличается поведение браузера при открытии? Что нужно сделать, чтобы PWA появилась?
Clipchamp
Опишите процесс от получения HTTP-ответа до отрисовки страницы в браузере
Data World
📁 Отрисовка страниц в браузере
Чем отличается render tree от DOM?
DigitalSail
Что происходит в браузере после получения HTML-документа и перед его парсингом?
DigitalSail
Что такое IntersectionObserver и как его использовать?
Digital Sector
📁 Нет темы
В чем разница между событиями Load и DOMContentLoaded?
Digital Sector
📁 DOM и его особенности
Как оптимизировать работу браузера, включая минимизацию reflow и repaint?
EnjoyPro
📁 Отрисовка страниц в браузере
Какие сложности в работе с Safari и MacOS были?
ESoft
Какие существуют способы хранения данных в браузере: sessionStorage, localStorage, cookie?
F6 Кибербезопасность
📁 Хранилища данных в браузере
Особенности работы с IndexedDB в браузере
F6 Кибербезопасность
📁 Хранилища данных в браузере
Как происходит отправка и получение данных в Web Worker?
F6 Кибербезопасность
📁 Web Workers и Service Workers
Способы обмена данными между микрофронтендами: custom events, window.postMessage, shared state, localStorage, BroadcastChannel, EventBus
F6 Кибербезопасность
📁 Нет темы
Как подписаться на изменения DOM с помощью MutationObserver?
F6 Кибербезопасность
📁 DOM и его особенности
Расскажите про все способы хранения данных в браузере.
F6 - Команда Кибербезопасности
📁 Браузерные хранилища
Особенности работы с IndexedDB.
F6 - Команда Кибербезопасности
📁 Хранилища данных в браузере
Какие виды веб-воркеров существуют, их отличия, ограничения и недостатки?
Facct
📁 Веб-технологии и доступность
Как веб-воркеры общаются с основным приложением? Какие ограничения существуют на передачу данных?
Facct
📁 Веб-технологии и доступность
Как отслеживать изменения в динамически обновляющемся списке DOM?
Facct
📁 DOM и его особенности
Как браузер определяет, какие запросы нужно кешировать?
Farzoom
📁 Нет темы
Какие существуют стратегии кеширования и какие HTTP-заголовки используются для кеширования?
Fatzoom
📁 Браузерные хранилища
Как сделать так, чтобы запросы выполнялись только с активной вкладки браузера?
Fatzoom
📁 Нет темы
Как делать запросы к серверу, когда вкладка браузера неактивна?
Fatzoom
📁 Нет темы
Если в HTML есть inline-скрипт (код JS в теге script), как он будет работать? Продолжится ли парсинг HTML?
Garage
Чем отличаются атрибуты async и defer у тега <script>?
HolyWeb
Можешь рассказать, какие процессы происходят от нажатия Enter в адресной строке браузера до отображения страницы?
HolyWeb
Какие проблемы могут возникнуть при встрече скрипта в HTML и как их решать?
HolyWeb
Как отменить стандартное поведение формы, чтобы при отправке страница не перезагружалась?
HolyWeb
📁 Отрисовка страниц в браузере
Что такое критический путь рендера?
Huntit
📁 Нет темы
Какие бывают блокирующие и неблокирующие скрипты?
Huntit
📁 Нет темы
Как загружаются шрифты и иконки в браузере?
Huntit
📁 Стилизация компонентов
Как внутри обработчика события onClick получить доступ к элементу, по которому кликнул пользователь?
iFellow
📁 Нет темы
Объясните, что такое DOM в контексте JavaScript
iFellow
📁 DOM и его особенности
Как в JavaScript получить доступ к определённому узлу (ноде) в DOM?
iFellow
📁 Асинхронный JavaScript
Как использовать брейкпойнты в DOM-дереве для отладки?
Jsa-Group
📁 DOM и его особенности
Как определить, что можно использовать новую функцию JavaScript с учётом поддержки браузерами?
Kedoo
📁 Чистые функции и перегрузка
Что делать, если нужно использовать новый синтаксис JavaScript, но обеспечить поддержку в старых браузерах? (полифилы)
Kedoo
📁 Асинхронный JavaScript
Как работает debugger в JavaScript
Lada Цифра
📁 Дебаунс и лимит вызовов
Что такое критический путь рендеринга веб-страницы?
Lofty
📁 Отрисовка страниц в браузере
Что происходит на уровне браузера, когда вводишь в адресную строку URL, до загрузки контента?
Loyalty
Какие есть фазы у событий в DOM?
mos.ru
📁 DOM и его особенности
Что такое полифиллы в JavaScript и как они помогают обеспечивать совместимость с разными браузерами?
Mozen
📁 Функциональный JS & Web API
Что такое канвас и пиксель в контексте веб-графики
Nedra Digital
📁 Веб-технологии и доступность
Как происходит кэширование? Какие виды кэширования существуют (в браузере, на сервере)?
Nexign
📁 Браузерные хранилища
Как управлять кэшем с помощью заголовков Cache-Control?
Nexign
📁 Браузерные хранилища
Опишите стадии рендера веб-страницы в браузере
Noname
📁 Отрисовка страниц в браузере
Что такое BroadcastChannel и как его использовать?
Polydev
📁 Нет темы
Чем события в React отличаются от событий в чистом JavaScript?
Premium IT Solution
📁 Next.js и Three.js интервью
Как заблокировать страницу в браузере?
pro-test.Studio
📁 Отрисовка страниц в браузере
Что делать, если браузер не поддерживает используемые методы?
Pyrus
📁 Нет темы
Используете ли вы сервер-сайд рендеринг (SSR)?
Redux-Saga
📁 Асинхронные API и Кэширование
Как браузер обрабатывает веб-страницу и что такое критический путь рендеринга (CRP)?
Right Line
📁 Отрисовка страниц в браузере
Что происходит при парсинге HTML, когда встречаются теги стилей и скриптов?
Rutube
Почему css и js считаются блокирующими ресурсами при загрузке страницы?
Rutube
Какими способами можно заблокировать страницу (например, с помощью while(true) и других методов)?
R-Vision
📁 Отрисовка страниц в браузере
Что такое Critical Rendering Path и как он влияет на производительность страницы?
Sky Capital
📁 Нет темы
События жизненного цикла HTML-документа в контексте JavaScript (не React), например DOMContentLoaded.
Smena
📁 DOM и его особенности
По какой метрике Web Vitals можно отследить дергание страницы (мерцание) во время загрузки?
Smena
📁 Отрисовка страниц в браузере
Знакомы ли вы с технологией WebView? Опишите её применение.
SoftJet
📁 Веб-технологии и доступность
Как подключается скрипт к странице? Где лучше его подгружать? Какие существуют атрибуты у тега script и в чем их различия?
Tilda Тильда
📁 Нет темы
Что такое async и defer у тега script?
Tildi
Где лучше подключать скрипт входной точки single-page приложения — в head или в конце body, и с какими атрибутами?
Tildi
Как происходит рендеринг страницы в браузере?
Tybbo System
📁 Отрисовка страниц в браузере
За счёт чего при копировании ссылки в мессенджер появляется дополнительная информация в виде превью и описания?
Unirest
📁 Копирование объектов
Есть ли опыт работы с браузерным API? Приходилось ли использовать Web Workers или Bluetooth?
Unirest
📁 Технологии передачи данных
Какие существуют способы хранения данных на стороне браузера?
Unknown
Что происходит на клиенте после получения HTML-страницы? Как браузер её отрисовывает?
Unknown
Что происходит в браузере, когда вы открываете сайт, например, Сбербанк.ру?
Unknown
Что произойдет с sessionStorage при закрытии вкладки, если в другой вкладке изменили данные?
Unknown
Чем отличается async, defer и просто без async-defer у тега script?
Unknown
Почему в Safari на мобильных устройствах значение 100vh не всегда соответствует реальной высоте экрана?
Unknown
Что такое теневой DOM (shadow DOM) и для чего он нужен?
Unknown
📁 Асинхронные API и Кэширование
Что происходит после ввода адреса в строку браузера? Опишите процесс загрузки страницы.
Unybrands
📁 Процесс ввода URL
Что происходит со страницей при изменении opacity у элемента?
Vk Workspace
📁 Отрисовка страниц в браузере
Как определить, что проект запущен в iframe, и как запретить запуск в iframe или выйти из него?
Vk Workspace
📁 Анимации в браузере
Если у пользователя проблемы с отображением страницы (например, долго грузится), как бы вы диагностировали и решали проблему?
X-Keeper
📁 Отрисовка страниц в браузере
Как синхронизировать смену темной и светлой темы при нескольких открытых вкладках сайта в браузере?
Zero Agency
📁 Отрисовка страниц в браузере
Является ли работа со storage синхронной или асинхронной операцией?
Zero Agency
📁 Нет темы
Что значит, что ресурсы критичные для отрисовки страницы?
Авито
Что происходит в браузере с момента получения документа до начала сетевых запросов?
Авито
Как реализовать обработку запроса на бэкэнд, если ответ будет готов через несколько часов, а пользователь может закрыть браузер?
Азиатско-Тихоокеанский Банк
📁 Нет темы
Что такое атрибуты async и defer в HTML и как они влияют на загрузку скриптов
Актион
📁 Загрузка скриптов в JS
Что такое DOM (Document Object Model)?
Алабуга
📁 DOM и его особенности
Что происходит с таймером setTimeout, когда пользователь сворачивает браузер? Как можно исправить это с помощью Web Worker?
Алабуга
📁 Нет темы
Если скрипт внутри себя подключает другие скрипты, куда и как его лучше подключать?
Альфа-Банк
📁 Нет темы
Какие уязвимости существуют в браузерах?
Альфа-Банк
📁 Нет темы
Как происходит отрисовка HTML после его получения?
Антара
📁 Семантика HTML и HTML5
Для чего использовали WebSocket на проекте?
Афлт-Системс
📁 Веб-технологии и доступность
Какие стадии рендеринга страницы в браузере?
Блюр
Расскажи про DOM, для чего он нужен?
Блюр
Какой браузерный API дает возможность асинхронного взаимодействия?
БФТ
Что в браузере обеспечивает работу асинхронности?
БФТ
Что такое Intersection Observer и как он используется?
Главгоэкспертиза
📁 Нет темы
Как определить, что страница все еще загружается, используя document.readyState?
Домклие
📁 Отрисовка страниц в браузере
Поддерживается ли vite в старых браузерах?
Домклик
📁 Нет темы
Что такое атрибуты preload и для чего они нужны?
Домклик
📁 Нет темы
Как работает всплытие событий в браузере?
Домклик
📁 Нет темы
Как определить, что пользователь доскроллил до определённого элемента, находящегося в центре страницы, которая занимает 5 вьюпортов?
Домклик
📁 Отрисовка страниц в браузере
Что такое Intersection Observer и как он работает?
Домклик
📁 Нет темы
Расскажи, что ты знаешь о сервис-воркерах.
Домклик
📁 Хуки и замыкания
Какие приёмы оптимизации SEO ты знаешь?
Домклик
📁 Способы оптимизации
Какими способами можно отслеживать обновление значения внутри объекта и выводить его в консоль (например, через геттеры, сеттеры, Proxy)?
Дом.Рф
📁 Нет темы
Что такое инспектор в контексте веб-разработки?
Евротехкилмат
📁 Web Workers и Service Workers
Что такое critical rendering path
Иннотех
📁 Нет темы
Страница открывается с паддингами и непонятным отображением блоков, хотя стили еще не применены. У страницы и блоков есть паддинги или марджины. Как избежать таких моментов? Вопрос про сброс браузерных стилей.
Иннотех
📁 Отрисовка страниц в браузере
Что такое MutationObserver в браузерах и как он используется для отслеживания изменений в DOM?
Иннотех
📁 Нет темы
К чему относится загрузка изображений и клики — к каким таскам?
Иннотех
📁 Свойства отображения элементов
Какие проблемы могут возникнуть на странице при частом reflow?
Лига Цифровой Экономики
📁 Отрисовка страниц в браузере
В каких случаях вызывается перерисовка родительского элемента?
Лига Цифровой Экономики
📁 Нет темы
Работа с DOM: основные методы и принципы
Ниу Вшэ
📁 DOM и его особенности
Что происходит после парсинга HTML и подгрузки CSS?
Новый
Будут ли скрипты с атрибутом async выполняться в порядке их подключения?
Новый
Чем отличается загрузка и выполнение скриптов с атрибутами async, defer и без них?
Новый
Что происходит, когда браузер встречает скрипт в HTML?
Новый
Что происходит после этапа layout в процессе рендеринга веб-страницы?
Новый
Какие проблемы могут возникать при поддержке разных браузеров
Ооо Мобайлдевелопмент
📁 Нет темы
Почему на странице с модалкой отсутствует адаптивность и для её обновления нужно перезагружать сайт?
Ооо Ртк
📁 Отрисовка страниц в браузере
Что блокирует выполнение скрипта в браузере?
Поле.рф
📁 Нет темы
Для чего используются атрибуты async и defer при подключении скриптов?
Поле.рф
📁 Загрузка скриптов в JS
Какая память используется в браузере, чем она отличается и как происходит взаимодействие между вкладками через память?
Поле.рф
📁 Браузерные хранилища
Что такое iframe и как он используется в веб-разработке?
Продамус
📁 Анимации в браузере
Как браузер определяет, что пришла HTML-страница, и как он её обрабатывает?
Промсвязьбанк
📁 Семантика HTML и HTML5
Как будет себя вести браузер и как отобразит страницу, если в head есть link на стили размером 5 Мб, а в body один тег H1?
Промсвязьбанк
📁 Нет темы
Как браузер обрабатывает HTML, CSS и JavaScript для построения и отображения веб-страницы на экране пользователя?
Райффайзен
📁 Отрисовка страниц в браузере
Подробно объясните, как работают вкладки Performance и Profiler в браузере.
Ростелеком Ит
📁 Нет темы
Что такое IndexedDB и как она используется для хранения данных в браузере?
Ртлабс
📁 Хранилища данных в браузере
Для чего нужны атрибуты async и defer у скриптов?
Рунити
📁 Загрузка скриптов в JS
Расскажите про событийную модель в браузере. Как остановить всплытие событий?
Сбер
📁 Нет темы
Расскажите, как браузер отрисовывает страницу.
Сбер
📁 Отрисовка страниц в браузере
Расскажи подробно про опыт реализации задачи с drag and drop: где вешались обработчики, как обрабатывались события, где сохранялись данные.
Сбер
📁 Нет темы
Объясните процесс рендеринга веб-страницы в браузере
Сбер
📁 Отрисовка страниц в браузере
Объясните процесс отрисовки страницы, включая роли IP, DNS, repaint и reflow
Сбер
📁 Отрисовка страниц в браузере
Объясните работу window.location и history в браузере.
Сбер
📁 Браузерные хранилища
Опиши, как браузер обрабатывает HTML
Сбер
📁 Семантика HTML и HTML5
Опишите алгоритм сравнения DOM и его временную сложность.
Северсталь
📁 DOM и его особенности
В чем разница между методами prepend, append и insertBefore в DOM?
Совкомбанк
📁 Нет темы
Почему скрипты обычно вставляют внизу страницы, а стили — вверху?
Совкомбанк
📁 Стилизация компонентов
Как работают слушатели событий
Совкомбанк
📁 Нет темы
Что такое делегирование событий и как оно работает?
Совкомбанк
📁 Нет темы
Как установить время хранения ресурса в кеше браузера?
Согаз
📁 Браузерные хранилища
Расскажите про Critical Render Path и отличия атрибутов async и defer в загрузке скриптов
Стилсофт
📁 Загрузка скриптов в JS
Тонкости в системе координат в браузере
Топ Системы
📁 Нет темы
Какие виды вебворкеров существуют?
ФАККТ
📁 Веб-технологии и доступность
Как организовать общение между вебворкером и основным потоком?
ФАККТ
📁 Хуки и замыкания
Почему вебворкеры не имеют доступа к DOM?
ФАККТ
📁 DOM и его особенности
Как общаться между двумя приложениями на одной странице без использования сети (через window.dispatchEvent, localStorage, BroadcastChannel)?
ФАККТ
📁 Нет темы
Какие минусы и риски безопасности связаны с использованием window.sharedData?
ФАККТ
📁 Безопасность веб-приложений
Как отслеживать изменения в обновляющемся списке с помощью MutationObserver и setInterval?
ФАККТ
📁 Нет темы
Как сделать бесшовный redirect между двумя разными веб-приложениями (карты и дашборд), чтобы не было перезагрузки страницы и белого или чёрного экрана загрузки?
ФГАОУ ВО МИИТ
📁 Отрисовка страниц в браузере
Какие типы HTML-документов существуют и как они классифицируются?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Объясните модель CSSOM и её роль в рендеринге страницы
Юспи Групп
📁 Специфичность CSS селекторов
