В чем разница между HTTP и HTTPS?
10 Бсс
📁 Протоколы HTTP и HTTPS
Что такое заголовки в HTTP-запросе, каковы их правила, зачем они нужны и почему их нельзя передавать в теле запроса?
Angie
📁 HTTP запросы и заголовки
Какие виды уязвимостей XSS, CORS, CSRF вы знаете и как их можно исправить?
ATI.su
📁 Безопасность веб-приложений
Какие HTTP методы вы знаете и для чего они используются?
Belitsoft
📁 HTTP запросы и заголовки
Что такое TCP и IP, как они работают и чем отличаются?
Bell Integrator
📁 Сетевые протоколы и безопасность
Знакомы ли вы с WebRTC? Опишите его основные возможности.
Bell Integrator
📁 Технологии передачи данных
Использовали ли WebSocket, где и какие нюансы при работе с ним?
Brainshell
📁 Технологии передачи данных
Какие есть методы в HTTP и как они работают?
Brainshell
📁 HTTP запросы и заголовки
Как осуществляется шифрование в протоколе TLS?
Brainshell
📁 Сетевые протоколы и безопасность
Какие основные заголовки CORS существуют?
Brainshell
📁 CORS и preflight запросы
Как была устроена авторизация в вашем проекте?
Caltat
📁 Авторизация и токены
Что такое CORS и для чего он используется?
Centicore Solutions На Проект Go Invest
📁 CORS и preflight запросы
Как работает TCP-соединение, включая этапы установления, передачи данных и завершения соединения?
Compressed
📁 HTTP Протокол
При oAuth авторизации: где хранить токены и как их передавать?
CSSSR
📁 Авторизация и токены
У всех ли HTTP-методов есть тело (body)? Объясните
Data World
📁 HTTP запросы и заголовки
Знаешь ли ты как работает TCP/IP?
EdgeЦентр
📁 HTTP Протокол
Какие меры безопасности необходимо учитывать при разработке социальной сети с пользовательским контентом?
ESoft
Где лучше хранить токен для аутентификации в веб-приложении?
Farzoom
📁 Авторизация и токены
Как реализовать запросы к серверу раз в 10 секунд и почему вместо ожидаемых 100 запросов может прийти 700?
Fatzoom
📁 Взаимодействие клиент-сервер
Что такое DNS, как он работает, какие типы записей бывают?
Goroutine

Какая часть HTTP-запроса шифруется при HTTPS?
Goroutine
📁 HTTP Протокол
Что такое инициализация в контексте сетевых протоколов
Lada Цифра
📁 Дизайн и разработка API
Что такое cookies в контексте веб-технологий и как они используются для хранения информации о сессиях и предпочтениях пользователей?
Loyalty
Чем характеризуется протокол HTTP?
Loyalty
В чем недостатки использования WebSocket?
Match
📁 Технологии передачи данных
Как называются приложения, построенные на WebSocket?
Nexign
📁 Технологии передачи данных
Что такое cookie и зачем он нужен?
Ozon
📁 Конкурентный доступ
Объясните, как работает браузер после ввода адреса в адресную строку
Petrastudio
📁 Процесс ввода URL
Что происходит после того, как в адресной строке браузера введён URL?
Prooftech IT
📁 Процесс ввода URL
В чем основные различия между HTTP методами POST и GET, и в каких случаях предпочтительно использовать каждый из них?
Proton
📁 HTTP Протокол
Что такое JWT токен и из каких частей он состоит?
Pyrus
📁 JWT и авторизация
Где хранится подпись JWT токена?
Pyrus
📁 JWT и авторизация
С сервера приходит 1000 объектов. Как эффективно получить нужные данные? Рассмотрите фильтрацию, пагинацию, виртуализацию и взаимодействие с сервером.
ROGII
📁 Взаимодействие клиент-сервер
Что происходит на сервере при получении запроса и какие дополнительные функции могут выполняться помимо отдачи HTML?
Rutube
Что происходит, когда в адресную строку браузера вводим URL и нажимаем Enter?
R-Vision
📁 Процесс ввода URL
Что такое SSE и WebSocket, и как эти технологии используются для организации двунаправленной связи между клиентом и сервером в веб-приложениях?
R-Vision
📁 Технологии передачи данных
В чем заключается безопасность HTTPS?
Selecty
📁 Сетевые протоколы и безопасность
Какие части сетевого запроса обычно не шифруются при передаче данных по протоколам HTTP или HTTPS?
Set
📁 HTTP Протокол
Какие преимущества HTTP/2 над HTTP/3 знаешь?
Slice
📁 HTTP Протокол
Как реализована авторизация на проекте? Опишите основные подходы и технологии.
Какие существуют заголовки HTTP в запросах и ответах?
Smena
📁 Нет темы
Чем отличается HTTP метод PATCH от PUT?
Sminex
Как устроена политика CORS? Кто является инициатором CORS-ошибки?
Sminex
Как организуется сетевое взаимодействие между фронтендом и бэкендом?
SoftJet
📁 Нет темы
Какие существуют методы HTTP-запросов и для чего они используются?
Solar
📁 HTTP запросы и заголовки
Где и как вы применяли WebSocket?
Syntellect
📁 Технологии передачи данных
Какие уязвимости бывают в веб-приложениях?
Tecius
📁 Безопасность веб-приложений
Куда можно сохранить информацию на клиенте, чтобы popup не показывался после перезагрузки страницы?
Tildi
В чем отличие между куки и localStorage?
Tildi
Знаете ли вы способ отправить несколько запросов одновременно, при этом избежать дублирования заказов?
TP
Как на уровне веб-сокетов построить авторизацию, чтобы получать только те сообщения, которые назначены мне?
Unknown
Как привязать конкретного клиента (браузер) к конкретному серверу, если скоринг хранится в состоянии сервера и не сохраняется в базе данных?
Unknown
Что делает свойство HttpOnly у cookie?
Unknown
Чем отличаются Local Storage и Session Storage?
Unknown
Как реализовать отправку сообщений: через WebSocket или REST?
Unknown
Какой принцип безопасности по умолчанию используется в браузерах?
Unknown
Как обеспечить безопасность при отправке сообщений (санитайзинг, модерация)?
Unknown
Нужно ли кеширование в оффлайн-режиме? Какие данные (например, картинки, видео) стоит кешировать?
Unknown
Можно ли оптимизировать проверку токенов? Как?
Unknown
📁 Аутентификация и авторизация
Что такое HTTP протокол и какие основные методы запросов он поддерживает для взаимодействия в вебе?
Что означает HTTP код ответа 200 и как он сигнализирует об успешном выполнении запроса?
Unknown
📁 HTTP Протокол
Почему HTTP/2 быстрее HTTP/1.1?
Unknown
📁 HTTP Протокол
Почему плохо писать пароль в базу в виде строки?
Unknown
📁 Аутентификация и авторизация
Что лучше использовать для получения информации в реальном времени: LongPolling, MiddlePolling или ShortPolling? Объясните различия.
Vk Workspace
📁 Нет темы
Как безопасно вставить произвольную строку в HTML, чтобы избежать XSS-уязвимостей?
Vk Workspace
📁 Безопасность веб-приложений
Что делать при обнаружении XSS-уязвимости в своем проекте?
Vk Workspace
📁 Безопасность веб-приложений
Что означает код 429 и как его обрабатывать?
Wildberries
📁 Code Quality
Какие HTTP методы знаете? Можно ли использовать свои?
Wildberries
📁 HTTP Протокол
Как работает механизм long polling в веб-разработке и чем он отличается от обычного HTTP-запроса?
Zero Agency
📁 Нет темы
Какие способы авторизации ты реализовывал в приложениях? Через логин и пароль, телефон, аккаунты Apple или Android?
Zoftify
📁 Авторизация и токены
Приведите примеры использования HTTP-заголовков.
Авито
Зачем нужны таймауты в HTTP запросах?
Авито
📁 HTTP Протокол
Перечисли и опиши HTTP методы.
Аг-Логистика
📁 HTTP запросы и заголовки
Перечислите и опишите основные HTTP-ответы.
Аг-Логистика
📁 HTTP запросы и заголовки
Объясните особенности HTTP 1.0 и расскажите про неочевидные коды ошибок, такие как 409 и 425.
Азиатско-Тихоокеанский Банк
📁 HTTP запросы и заголовки
Как работали с SSE и WebSocket?
Альфа-Банк
📁 Технологии передачи данных
Что такое HTTP и HTTPS? В чем их отличия?
Альфа-Банк
📁 Протоколы HTTP и HTTPS
Какие существуют флаги у cookie, для чего они нужны и в чем их отличия?
Антара
📁 Нет темы
Какие существуют флаги в cookie и для чего они используются?
Антара
📁 Нет темы
Бывали ли ситуации, когда на сервере что-то обновляется и нужно это постоянно отображать на фронте? Как вы решали такие

Какие протоколы взаимодействия клиент-сервер вы знаете?
Аэроклуб
📁 Взаимодействие клиент-сервер
В чем отличие методов GET и POST? Можно ли передать тело запроса в GET и получить данные через POST?
Аэроклуб
📁 Запросы GET и POST
Можно ли передать тело запроса через GET-запрос?
БФТ
Что такое WebSocket и чем он отличается от HTTP?
Главгоэкспертиза
📁 Нет темы
Перечислите HTTP коды и объясните их значения по группам.
Домклик
📁 HTTP запросы и заголовки
Какие методы и протоколы использовались для взаимодействия фронтенда с бэкендом?
Иннополис
📁 Нет темы
Как вы предпочитаете реализовывать запросы к бекенду: использовать axios или создавать собственный метод?
КвинсДевелопмент
Что такое Content Security Policy (CSP) и как он помогает в безопасности веб-приложений?
Купибилет
📁 Безопасность веб-приложений
Расскажите, как была устроена авторизация в ваших проектах
Лаборатория Безопасных Систем
📁 Авторизация и токены
Что такое CORS? Расскажи про OPTIONS запросы и что такое CSP
Лига Цифровой Экономики
📁 CORS и preflight запросы
Что такое и для чего нужны WebRTC и WebSocket?
Лига Цифровой Экономики
📁 Технологии передачи данных
Что такое CORS и preflight запросы? Как можно обойти ограничения CORS?
Моеvideo
📁 CORS и preflight запросы
Что такое протокол HTTP/2 и какие преимущества он предоставляет по сравнению с HTTP/1.1?
МоторикаАудио
📁 HTTP Протокол
Пользователь вводит адрес сайта и нажимает Enter, опишите последовательность действий и процесс загрузки страницы
Нефтетранссервис
📁 Процесс ввода URL
Опишите работу серверной части: Action server и серверные компоненты.
Платежное Решение
📁 Взаимодействие клиент-сервер
Что такое CORS, зачем он нужен и как он работает на фронте и бэке?
Росбанк
📁 CORS и preflight запросы
Что происходит в браузере при вводе URL в адресную строку?
РСХБ-Интех
📁 Процесс ввода URL
Что такое CSRF и какие существуют способы защиты от него?
РСХБ-Интех
📁 Технологии веб-разработки
В чем разница между версиями протокола HTTP и что такое мультиплексирование?
РСХБ-Интех
📁 Протоколы HTTP и HTTPS
Можно ли передавать body в GET-запросе и почему?
РСХБ-Интех
Что такое Cambula и для чего она используется?
РСХБ-Интех
📁 CORS и preflight запросы
Что такое протокол HTTP и в чем разница между его версиями?
РСХБ-Интех
📁 Протоколы HTTP и HTTPS
Что происходит после ввода адреса в поисковик?
Рунити
📁 Процесс ввода URL
В чем основные технические отличия между протоколами SSH и Telnet, и почему SSH считается более безопасным для удаленного доступа?
Сбер
📁 HTTP Протокол
Что такое CORS и как он обеспечивает безопасность при обмене ресурсами между разными доменами в веб-браузерах?
Сбер
📁 CORS и preflight запросы
Какие способы существуют для выполнения запросов к серверу?
Сбер
📁 Взаимодействие клиент-сервер
Опишите путь от запроса URL в адресной строке до отображения страницы в браузере
Сбер
📁 Процесс ввода URL
Объясните разницу между webSocket, longPolling и Polling
Сбер
📁 Технологии передачи данных
Объясните разницу и применение WebSocket, SSE, SSR и лонг-пулинга
Сбер
📁 Технологии передачи данных
Опиши процесс, что происходит при вводе адреса в поисковую строку: URL, DNS, IP и т.д.
Сбер
📁 Процесс ввода URL
Какая особенность протокола WebSockets?
Северсталь
📁 Технологии передачи данных
Какие существуют аналоги WebSockets?
Северсталь
📁 Технологии передачи данных
Как работает механизм CORS в браузерах для обеспечения безопасности при кросс-доменных HTTP-запросах?
Согаз
📁 Функциональный JS & Web API
Что такое CORS и как с ним работать?
Спросиврача
📁 CORS и preflight запросы
Какие ограничения существуют у HTTP GET-запросов?
Сравни
📁 Запросы GET и POST
Опишите меры безопасности для веб-мессенджера, включая защиту от XSS-атак, использование JWT, а также httpOnly и secure флаги.
Т-Банк
📁 Безопасность веб-приложений
Как работает браузер: какой механизм срабатывает до DNS при вводе адреса, что подключается первым до DNS, роль файла hosts
Теле2
📁 Процесс ввода URL
Опиши механизм соединения клиент-сервер
Теле2
📁 Взаимодействие клиент-сервер
Что такое TLS и TCP, и как они работают
Теле2
📁 Сетевые протоколы и безопасность
Вы знакомы с HTTP? Как устроен протокол HTTP v1.x?

Какие существуют порты в сети (например, 80 для HTTP, 443 для HTTPS)?
Финам
📁 Протоколы HTTP и HTTPS
Раскройте разницу между cookies, sessionStorage и localStorage.
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Могут ли сервера устанавливать cookies?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Как реализовать авторизацию для одного устройства?
Центр Авиа
📁 Авторизация и токены
В чем основные различия между протоколами HTTP и TCP, и в каких случаях предпочтительнее использовать каждый из них?
Энфорс
📁 HTTP Протокол
Расскажите про менеджеры WebSocket, например socketIO.
Яндекс
📁 Технологии передачи данных
Назовите HTTP методы, опишите их назначение и отличия.
Яндекс
📁 HTTP запросы и заголовки
Что обычно хранится на сервере для реализации авторизации?
65Apps
📁 Авторизация и токены
Что лучше использовать сейчас для HTTP-запросов: Axios или Fetch?
AEX Soft
📁 Нет темы
Что такое AbortController и как отменять запросы с помощью axios
Alderasoft
📁 Нет темы
Какие методы защиты ты используешь для обеспечения безопасности своего фронтенд-приложения?
Alfabit
📁 Безопасность веб-приложений
Есть ли у вас реализованные дизайны с использованием WebSocket для реального взаимодействия?
Altenar
Что такое HTTP-запросы и как они работают?
Avs Consulting
📁 HTTP запросы и заголовки
Что такое preflight-запрос (OPTIONS) в CORS и зачем он нужен?
Avs Consulting
📁 CORS и preflight запросы
Что такое CORS и как работают заголовки CORS и куки?
Avs Consulting
📁 CORS и preflight запросы
Как кешируется GET-запрос, как его инвалидировать и какие заголовки для этого используются?
Belitsoft
📁 Нет темы
Расскажите про DNS и процесс DNS-резолвинга.
Bell Integrator
📁 Процесс ввода URL
Что такое HTTP keep-alive и как этот механизм влияет на производительность и управление соединениями в протоколе HTTP?
Bell Integrator
📁 HTTP запросы и заголовки
Что такое Content Security Policy (CSP) и как он помогает защитить веб-страницы от XSS-атак?
Bell Integrator
📁 Технологии веб-разработки
Что такое CORS и для чего он нужен?
BetBoom
📁 CORS и preflight запросы
Что такое Security Policy в контексте веб-безопасности и как она помогает предотвращать атаки, такие как XSS и CSRF?
BetBoom
📁 Нет темы
В чем разница между аутентификацией и авторизацией?
Bitronics Lab
📁 Авторизация и токены
Что такое OAuth и как он работает?
Bitronics Lab
📁 Нет темы
В чем отличие HTTP/1.1 от HTTP/2?
BI.Zone
📁 Протоколы HTTP и HTTPS
Как бы ты реализовал аутентификацию для нового продукта?
BI.Zone
📁 Авторизация и токены
Куда лучше помещать токены — в заголовки (headers) или в куки?
BI.Zone
📁 Нет темы
Будет ли XSS-атака, если ввести скрипт в input?
BI.Zone
📁 Безопасность веб-приложений
Объясните, что такое протокол HTTP и как он работает.
Brainshell
📁 HTTP запросы и заголовки
Опишите структуру HTTP-запроса
Brainshell
📁 HTTP запросы и заголовки
Что такое CORS, как он работает и как ведет себя браузер?
Brainshell
📁 CORS и preflight запросы
Что такое Preflight Requests в контексте CORS и как они обеспечивают безопасность при кросс-доменных HTTP-запросах?
Brainshell
📁 CORS и preflight запросы
Как реализую авторизацию и аутентификацию в веб-приложениях?
Broniboy Тех Скриннинг
📁 Авторизация и токены
Как передаются куки с клиента на сервер?
Centicore Solutions На Проект Go Invest
📁 Взаимодействие клиент-сервер
Можно ли получить данные с помощью запроса DELETE?
Clipchamp
Что влияет на разрыв TCP-соединения?
Compressed
📁 HTTP Протокол
Как устроены куки? Как они устанавливаются и удаляются?
Compressed
📁 PostgreSQL Internals
Что делает флаг HttpOnly в HTTP cookie и как он помогает защитить веб-приложения от атак типа XSS?
Compressed
📁 HTTP Протокол
Что такое SameSite флаг в куках и когда он срабатывает?
Compressed
📁 HTTP Протокол
В чем основные технические отличия между протоколами HTTP и HTTPS, и как HTTPS обеспечивает безопасность передачи данных?
Datagile
📁 Нет темы
Что происходит в браузере, когда пользователь вводит URL в адресную строку и нажимает Enter?
Data World
📁 Процесс ввода URL
Какой протокол используется при выполнении HTTP-запроса, из каких частей он состоит и как они взаимодействуют?
Data World
📁 Нет темы
Какие группы кодов ответа от сервера ты знаешь?
DigitalSail
Что такое HTTP метод OPTIONS и как он используется для определения поддерживаемых сервером методов и настройки CORS?
DigitalSail
Можно ли считать все HTTP методы просто синтаксическим соглашением?
DigitalSail
Запросы GET передаются query параметрами, а можем ли мы сделать то же самое методом POST?
Dodo Brands
📁 Запросы GET и POST
Где лучше хранить авторизационные токены и почему предпочтительнее использовать куки?
Egar Technology
📁 Авторизация и токены
Какие существуют виды атак, такие как XSS, CSRF и другие?
Egar Technology
📁 Безопасность веб-приложений
Какие подходы к безопасности вы используете в инфраструктуре?
ESoft
Какие могут быть проблемы с WebSocket? Когда WebSocket необходим, а когда его использование нецелесообразно?
Evercode Lab
📁 Веб-технологии и доступность
Как отправляются куки в HTTP-запросах?
Farzoom
📁 Хуки и замыкания
Как устанавливаются куки со стороны сервера?
Farzoom
📁 Взаимодействие клиент-сервер
Отрефакторить конфиг ESBuild с использованием промисов и корректным выводом порта сервера
Fractall Design
📁 Взаимодействие клиент-сервер
Какие сложности возникают при запросах с фронтенда SPA на URL a.com к бэкенду на URL b.com без доступа к CORS и как помогает прокси-сервер
Funbox
📁 Нет темы
Какие флаги можно устанавливать в куках и для чего они нужны?
Glowbyte
📁 Нет темы
Что такое CORS, как его настраивать и кто контролирует ограничения?
Glowbyte
📁 CORS и preflight запросы
Какой HTTP код будет при редиректе по короткой ссылке?
Golang.Middle.amoCRM
📁 HTTP Протокол
Где указывается ссылка для редиректа в HTTP?
Golang.Middle.amoCRM
📁 HTTP Протокол
Что такое протоколы HTTP и HTTPS в URL и в чем их основные отличия с точки зрения безопасности и передачи данных?
Goroutine
📁 HTTP Протокол
Расскажи про SSL/TLS, как происходит обмен сертификатами?
Goroutine
📁 HTTP Протокол
Как устроена авторизация в проекте с использованием JWT? Расскажите про принципы работы JWT.
Hitch By Red_Mad_Robot
📁 JWT и авторизация

Какие бывают типы атак на фронтенде?
HolyWeb
Как работает CORS и как сервер управляет доступом по Origin?
HolyWeb
Можно ли обойти ошибку CORS? Как?
HolyWeb
Что такое shared worker, service worker и web worker? Чем shared worker отличается от остальных?
HolyWeb
От каких типов атак защищает HTTPS (TLS)?
HolyWeb
Когда WebSocket теряет соединение, восстанавливает ли он его автоматически?
HolyWeb
📁 Технологии передачи данных
В чем разница между polling и long polling?
HolyWeb
📁 Технологии передачи данных
Какие сетевые протоколы вы знаете и в каких случаях их используете?
Infinet Wireless
📁 Нет темы
Какие существуют коды ошибок HTTP?
Intelsy
📁 HTTP запросы и заголовки
Расскажите подробнее про сокеты: как вы их обрабатывали, как работали с ними и какие библиотеки использовали.
Ittrain
📁 Библиотеки и графики
Расскажите про сокеты и их использование
Kaspersky
📁 Нет темы
Что происходит в браузере, когда пользователь вводит URL?
Kedoo
📁 Процесс ввода URL
Перечислите виды HTTP ответов (100, 200, 300, 400, 500) и их назначение
Kvando
📁 HTTP запросы и заголовки
Как организовать авторизацию с использованием access и refresh токенов?
Loyalty
Какие существуют политики безопасности на фронтенде и сервере для обеспечения защиты?
Loyalty
В чем основные отличия между протоколами HTTP и HTTPS, и как HTTPS обеспечивает безопасность передачи данных?
Loyalty
В какой момент понимаешь, что access токен истёк и нужно запросить новый?
Loyalty
Что происходит, когда пользователь вводит адрес в адресную строку браузера?
Match
📁 Процесс ввода URL
Расскажи, что происходит после того, как мы ввели ссылку на страницу и нажали Enter (начиная с парсинга DOM)
mos.ru
📁 Процесс ввода URL
Что такое CORS и что означает эта аббревиатура?
Nedra Digital
📁 CORS и preflight запросы
Что такое GET и POST запросы? В чем их отличия?
Nexign
📁 Запросы GET и POST
Какие данные и в каком объеме можно передавать через GET и POST запросы?
Nexign
📁 Запросы GET и POST
Что такое WebSocket и для чего он нужен?
Nexign
📁 Технологии передачи данных
Что такое протокол HTTP, из каких частей состоит запрос?
Ozon
📁 HTTP Протокол
Расскажи основные группы HTTP-статусов и их назначение?
Ozon
📁 HTTP Протокол
Что означает HTTP статус 304 Not Modified и как он используется для оптимизации кеширования в веб-приложениях?
Ozon
📁 HTTP Протокол
С какими протоколами ты работал?
Ozon
📁 HTTP Протокол
Чем отличаются протоколы TCP и UDP?
Ozon
📁 HTTP Протокол
В каких HTTP-методах может быть тело запроса?
Ozon
📁 HTTP Протокол
Какие группы HTTP-кодов ответа ты знаешь?
Ozon
📁 HTTP Протокол
Как получать информацию между вкладками браузера с учетом политики безопасности
Perfect Panel
📁 Безопасность веб-приложений
Почему JWT считается безопасным? Объясните роль цифровой подписи.
Pyrus
📁 JWT и авторизация
Где хранится refresh токен и почему именно там?
Pyrus
📁 Авторизация и токены
Какие методы защиты от кражи JWT существуют (httpOnly, sameSite и другие)?
Pyrus
📁 Нет темы
Где обычно хранится JWT на клиенте?
Pyrus
📁 JWT и авторизация
Зачем в системе аутентификации нужны два токена и почему нельзя обойтись одним?
Pyrus
📁 Авторизация и токены
Почему access токен не рекомендуется хранить в cookie?
Pyrus
📁 Нет темы
Зачем нужны два токена (access и refresh), и почему нельзя использовать только один?
Pyrus
📁 Авторизация и токены
Какие существуют способы защиты от XSS? Расскажите про санитайзеры, например DOMPurify.
Pyrus
📁 Безопасность веб-приложений
Как выкинуть пользователя со всех остальных устройств, если он вошёл с другого устройства?
Pyrus
📁 Авторизация и токены
Какие существуют виды авторизации? Расскажите про JWT.
Pyrus
📁 JWT и авторизация
Как работает авторизация через внешние сервисы?
Pyrus
📁 Авторизация и токены
Опишите, что происходит от момента, когда пользователь вводит URL в браузере, до момента, когда он видит загруженную страницу.
Rutube
Что происходит на уровне сети и браузера, когда в адресную строку вводишь URL и нажимаешь Enter?
Rutube
Что вы знаете о методе OPTIONS в HTTP?
Rutube
В чём разница между HTTP и HTTPS и почему Google сейчас предупреждает об использовании HTTP?
Rutube
Какие функции выполняет Nginx помимо роутинга?
Rutube
Куда обычно браузер отправляет запросы на сервер?
Rutube
Как происходит шифрование при передаче данных в POST-запросе?
Rutube
Какие методы HTTP часто используются для реализации REST?
Rutube
Перечислите и объясните HTTP статус-коды от 100 до 500
Selecty
📁 HTTP запросы и заголовки
Расскажите подробно про JWT, из каких частей состоит JSON Web Token
Selecty
📁 JWT и авторизация
Где можно передавать данные в HTTP запросах кроме заголовков?
Selecty
📁 Нет темы
Что такое вебсокеты и как они работают?
Selecty
📁 Веб-технологии и доступность
Объясните защищенность HTTPS и незащищенность HTTP
Selecty
📁 Сетевые протоколы и безопасность
Чем отличается TLS от сертификата?
Set
📁 HTTP Протокол
Опишите процесс авторизации и аутентификации в личном кабинете: использование access и refresh токенов, какие коды ответа и статусы (200, 201, 401) применяются.
Smartvisor
📁 Авторизация и токены
Расскажите всё, что знаете про HTTP.
Smena
📁 Нет темы
Можно ли использовать тело запроса (body) в GET запросе?
Smena
📁 Запросы GET и POST
Какой HTTP статус-код ожидается при успешном выполнении POST-запроса создания ресурса?
Sminex
Какой статус вернёт успешный POST-запрос?
Sminex
📁 Запросы GET и POST
Что такое CORS? Кто является инициатором блокировки: браузер или сервер?
Sminex
📁 CORS и preflight запросы
Расскажи мне как работают WebSocket?
TechCore
📁 Software Design Principles
С какими видами авторизации вы работали?
Tecius
📁 Авторизация и токены
Что именно шифруется в рамках HTTPS протокола?
Tecius
📁 Сетевые протоколы и безопасность
Как понять, что заказ принят, если запрос ушел, а ответ не вернулся?
TP
Можно ли уникально идентифицировать HTTP-запросы?
TP
Можно ли блокировать кнопку заказа до получения ответа с сервера?
TP
Опишите процесс, который происходит после ввода адреса и нажатия Enter в браузере.
Tybbo System
📁 Процесс ввода URL
Что означают HTTP коды ошибок 401 и 403 и чем они отличаются?
Unirest
📁 HTTP запросы и заголовки
Какие виды HTTP-редиректов вы знаете и чем они отличаются?
Unirest
📁 Нет темы
Для чего нужны OPTIONS запросы? Расскажи про CORS
Unirest
📁 Нет темы
Что такое PostMessage и как его использовать?
Unitarius
📁 Запросы GET и POST
Как обрабатывать и возвращать ошибку, если все попытки повторного запроса исчерпаны?
Unknown
Можно ли со стороны клиента отключить кеширование, чтобы каждый раз получать свежие данные?
Unknown
Какие основные свойства у HTTP cookie и как они влияют на безопасность и управление сессиями в веб-приложениях?
Unknown
Чем принципиально отличаются HTTP/1, HTTP/2 и HTTP/3?
Unknown
Как решить проблему тайм-аута при подключении SPA приложения к серверу?
Unknown
Что такое HTTP кеширование и как оно работает?
Unknown
Есть ли различия в обработке CORS-запросов в браузерах?
Unknown
Какие меры безопасности следует применять для защиты от XSS, CSRF и подобных атак?
Unknown
Что происходит, когда ты открываешь браузер, вводишь url и нажимаешь enter?
Unknown
Что происходит на сервере после получения HTTP GET-запроса с указанием IP и порта?
Unknown
Что такое HTTP cookie, как они используются для хранения данных на стороне клиента и какие основные параметры у них есть?
Unknown
Какие потенциальные проблемы с авторизацией при получении токена из localStorage?
Unknown
Какие вопросы можно задать по коду компонента, который реализует запрос к API с поиском по тексту?
Unknown
Почему приложение слушает определённый порт? Что происходит после получения HTTP-запроса сервером?
Unknown
Какие практики можно использовать для ограничения источников скриптов на сайте?
Unknown
Расскажите о свойствах cookie, которые вы знаете.
Unknown
Какие аспекты фронтенд-безопасности вы знаете? Как защититься от клиентских атак?
Unknown
Нужно ли запрашивать результат проверки для каждого URL отдельно или можно сделать это вместе?
Unknown
Как обработать ошибку, если API возвращает поле error? Как отображать ошибку и состояние загрузки?
Unknown
Как обработать ошибку, если токен отсутствует или запрос с ним не удался?
Unknown
Использовать ли WebSocket для мгновенных сообщений или существуют альтернативы?
Unknown
Как обрабатывать кейс, когда API возвращает ошибку или ничего не найдено?
Unknown
Почему нужно блокировать доступ через HttpOnly?
Unknown
Можно ли выполнить модифицирующий запрос (например, POST, PUT, DELETE) на другой домен?
Unknown
Какие бывают "простые" и "сложные" запросы в CORS?
Unknown
Как реализовать связь оффлайн-режима с отправкой сообщений и их синхронизацией?
Unknown
Какие исходы могут быть после обработки запроса сервером? Какие типы ошибок бывают?
Знаешь разницу между HTTP/1.1 и HTTP/2?
Unknown
📁 HTTP Протокол
Что означает HTTP код ответа 300 и как он используется для управления перенаправлениями в веб-приложениях?
Unknown
📁 REST API Best Practices
Назови разницу между TCP и UDP?
Unknown
📁 HTTP Протокол
Чем HTTP/2 отличается от HTTP/1.1?
Unknown
📁 HTTP Протокол
Можно ли использовать gRPC напрямую из браузера?
Unknown
📁 Design Patterns
Какие есть основные способы аутентификации пользователей?
Unknown
📁 Аутентификация и авторизация
Какие категории статусов в ответах (HTTP) предусмотрены?
Unknown
📁 HTTP Протокол
Что такое HTTP ошибки 4xx и как они используются для обозначения проблем с клиентским запросом?
Unknown
📁 Exception Handling
Расскажи про принципиальные особенности TCP?
Unknown
📁 HTTP Протокол
Расскажи про принципиальные особенности UDP?
Unknown
📁 HTTP Протокол
Опиши максимально подробно, что происходит под капотом, когда вводишь URL в браузер и нажимаешь Enter
Unknown
📁 Асинхронные API и Кэширование
Что такое HTTP и HTTPS? Объясните основные отличия.
VegaSoft
📁 Протоколы HTTP и HTTPS
Чем отличаются HTTP методы GET, POST, PUT, PATCH и DELETE?
VegaSoft
📁 Запросы GET и POST
Что такое preflight-запросы и HTTP метод OPTIONS? Объясните их роль.
VegaSoft
📁 CORS и preflight запросы
Какие HTTP-коды ошибок имеет смысл ретраить, а какие — нет?
Wildberries
📁 HTTP Протокол
Почему имеет смысл ретраить ошибки 5xx, но не все 4xx?
Wildberries
📁 Exception Handling
Как устроен заголовок HTTP/1.1 в текстовом формате?
Wildberries
📁 HTTP Протокол
Можно ли в HTTP запросе отправить два одинаковых заголовка?
Wildberries
📁 HTTP Протокол
С какими протоколами работает gRPC?
Wildberries
📁 HTTP Протокол
Использует ли HTTP/2 шифрование? Как устроен TLS handshake?
Wildberries
📁 HTTP Протокол
Чем отличается симметричное и асимметричное шифрование?
Wildberries
📁 Хэширование и индексы
Что происходит с момента ввода URL в браузере до получения первого пакета данных?
Zero Agency
📁 Процесс ввода URL
Для чего одному сайту может понадобиться несколько IP-адресов?
Zero Agency
📁 Процесс ввода URL
Сталкивались ли вы с вебсокетами? Какие у них плюсы и минусы?
Zero Agency
📁 Веб-технологии и доступность
Какие существуют аналоги вебсокетов?
Zero Agency
📁 Веб-технологии и доступность
Что произойдет, если на сервере таймаут опроса 5 минут, а на клиенте 2 секунды?
Zero Agency
📁 Взаимодействие клиент-сервер
Что ты используешь для выполнения API запросов?
Zoftify
📁 API и мессенджеры
Расскажите про SSE (Server-Sent Events)
Авиационные Интерьеры
📁 Технологии веб-разработки
Какие HTTP методы существуют и для чего они используются?
Авито
Как определить, что пользователь не авторизован (401) или не имеет прав доступа (403)?
Авито
Для чего используются HTTP-заголовки?
Авито
Можешь назвать принципиальные отличия между TCP и UDP?
Авито
📁 HTTP Протокол
Подробно расскажи про авторизацию, access token, refresh token и где их хранить.
Автомакон
📁 Авторизация и токены
Что происходит после ввода URL в браузере?
Аг-Логистика
📁 Процесс ввода URL
Объясните различия между WebSocket и Server-Sent Events (SSE)
Азиатско-Тихоокеанский Банк
📁 Технологии передачи данных
При отправке запроса на создание ресурса сервер не может создать его сразу и возвращает ссылку, по которой ресурс будет создан позже. Какой HTTP статус код будет у такого ответа?
Азиатско-Тихоокеанский Банк
📁 Взаимодействие клиент-сервер
Расскажите про пропускную способность WebSocket.
Азиатско-Тихоокеанский Банк
📁 Технологии передачи данных
В чем отличия HTTP и WebSocket протоколов?
Азот-Взрыв
📁 Нет темы
Какие особенности HTTPS протокола по сравнению с HTTP?
Азот-Взрыв
📁 Протоколы HTTP и HTTPS
Объясните разницу между самоподписными сертификатами и сертификатами, выданными удостоверяющим центром.
Как закрыть WebSocket-соединение и какие аргументы принимает метод закрытия?
Алабуга
📁 Взаимодействие клиент-сервер
Какие события можно отследить у WebSocket соединения?
Алабуга
📁 Веб-технологии и доступность
Работали ли вы с WebSockets? Опишите опыт и основные принципы работы.
Алабуга
📁 Технологии передачи данных
Объясните механизм работы CORS и как его настроить.
Альфа-Банк
📁 CORS и preflight запросы
Объясните, что такое куки, как они работают и как используются во фронтенде.
Альфа-Банк
📁 Хуки и замыкания
В чем отличия между SSE и WebSocket?
Альфа-Банк
📁 Технологии передачи данных
В чем разница между хэшированием и шифрованием?
Альфа-Банк
📁 Сетевые протоколы и безопасность
Что происходит, когда пользователь вводит название сайта в адресную строку браузера?
Альфа Лизинг
📁 Процесс ввода URL
Расскажите про WebSocket, Polling и Long Polling.
Антара
📁 Технологии передачи данных
Расскажите подробно про куки: что это, как работают и где используются.
Антара
📁 Хуки и замыкания
Какие способы отправки множества запросов одновременно через axios вы знаете?
АО ГНИВЦ
📁 Нет темы
Разница между short-polling и long-polling?
АФЛТ
Можешь ли поправить ошибки в коде с fetch?
АФЛТ
Что происходит, когда в браузере вводится URL?
АФЛТ Систем
📁 Процесс ввода URL
Чем отличаются сокеты от HTTP/HTTPS?
Аэроклуб
📁 Протоколы HTTP и HTTPS
Вопросы про REST, HTTP, HTTPS, авторизацию, процесс ввода URL в адресную строку
Билайн
📁 HTTP запросы и заголовки
Что такое идемпотентность? Какие HTTP-методы являются идемпотентными?
Блюр
Что такое HTTP-запрос и как он используется для передачи данных между клиентом и сервером в веб-приложениях?
БФТ
Был ли у вас опыт подключения к удалённому серверу? Как вы это делали?
БФТ
Опишите, что происходит в интернете с момента ввода URL в адресную строку браузера.
Восточная Горнорудная

Объясните, что такое CORS и зачем он нужен.
Восточная Горнорудная
📁 CORS и preflight запросы
Для чего нужны access и refresh токены, где их лучше хранить и почему?
Восточная Горнорудная
📁 Авторизация и токены
Объясните основные принципы Domain-Driven Design (DDD)
Восточная Горнорудная
📁 Процесс ввода URL
Объясните, что такое лонг полинг и шорт полинг, и в каких случаях они применяются
Газпром Нефть
📁 Хуки и замыкания
В чем разница между fetch и pull?
Главгоэкспертиза
📁 Обработка запросов fetch
Что такое куки, как их можно использовать? Приведите примеры и опишите опции куков, кроме httpOnly.
Домклик
📁 Веб-технологии и доступность
В чем основные отличия между протоколами HTTP/1.1 и HTTP/2 и как они влияют на производительность веб-приложений?
Домклик
📁 Протоколы HTTP и HTTPS
Что такое CORS? Приведи пример. Что можно запрещать с помощью CORS?
Домклик
📁 CORS и preflight запросы
В чем разница между выполнением кода на сервере и на клиенте?
Домклик
📁 Взаимодействие клиент-сервер
Что такое XSS и как защититься от этой уязвимости?
Домклик
📁 Безопасность веб-приложений
Расскажите про авторизацию на фронтенде: как она была реализована, использовали ли библиотеку для работы с JWT токенами?
Иннополис
📁 Авторизация и токены
При авторизации внедряли ли вы функционал ролей и как это реализовывали?
Иннополис
📁 Авторизация и токены
Если в проекте access токен передаётся в query параметрах, какие ваши действия для повышения безопасности?
Иннополис
📁 Запросы GET и POST
Что такое CORS и как работает механизм кросс-доменных запросов в браузере?
Иннотех
📁 CORS и preflight запросы
Какие проблемы решают вебсокеты?
Кокос.Group
📁 Веб-технологии и доступность
Какие альтернативные методы коммуникации, кроме вебсокетов, вы знаете?
Кокос.Group
📁 Веб-технологии и доступность
Что означает HTTP статус 302 при ответе сервера?
Легкорем
📁 HTTP запросы и заголовки
Для чего на последнем месте применялся Websocket?
Лига
📁 Опыт работы
Как React помогает предотвратить XSS атаки?
Лига Цифровой Экономики
📁 Безопасность веб-приложений
Знаешь ли ты такую модель как OSI?
Магнит

Какие способы взаимодействия клиента и сервера ты знаешь?
Мегафон
📁 Взаимодействие клиент-сервер
Что такое WebSocket и как этот протокол обеспечивает двунаправленную связь между клиентом и сервером в реальном времени?
Мегафон
📁 Технологии передачи данных
В чем разница между протоколами TCP и UDP?
Мегафон
📁 Сетевые протоколы и безопасность
Что происходит после отправки HTTP-запроса?
Мегафон
📁 Запросы GET и POST
Какие существуют методы HTTP, в чем разница между GET и POST, и какой из них безопаснее?
Мегафон
📁 Запросы GET и POST
Какие существуют коды ответов HTTP, что означает ошибка 403 и чем её можно заменить?
Моеvideo
📁 HTTP запросы и заголовки
Что такое cookie и как они используются в веб-приложениях?
Мосгосэкспертиза
📁 Нет темы
Объясните принципы авторизации с использованием JWT и как это реализуется в веб-приложениях
Мосгосэкспертиза
📁 JWT и авторизация
Опишите, что происходит после того, как пользователь вводит адрес сайта в адресную строку браузера
Мостранспорт
📁 Процесс ввода URL
Какие там еще есть коды ответов?
МоторикаАудио
📁 Логирование и Мониторинг
Какие есть способы общения между iframe без использования shared Web Workers?
Название Компании Appmaster
📁 Нет темы
как влияет http1 http2 http3 на загрузку чанков
Название Компании Appmaster
📁 HTTP запросы и заголовки
Что происходит при вводе адреса сайта в браузер?
Название Компании Beget
📁 Процесс ввода URL
Как происходит поиск IP-адреса через DNS-сервер?
Название Компании Beget
📁 Процесс ввода URL
Как проверить, что картинка загрузилась или произошла ошибка при загрузке?
Новый
Опишите логику взаимодействия пользователь - сервер, что происходит после отправки запроса.
Омнитек
📁 Взаимодействие клиент-сервер
Расскажите о работе с сервером через HTTP и WebSocket
Онлайн Решения
📁 Взаимодействие клиент-сервер
Объясните устройство тела HTTP-запроса
Онлайн Решения
📁 HTTP запросы и заголовки
Почему не использовать VPS вместо VDS для сервера?
Ооо Ртк
📁 Взаимодействие клиент-сервер
Как устроен процесс отправки формы: каким образом проходит запрос при submit?
Как построена система POST-запросов вокруг формы? Опишите структуру запроса, заголовки, тело и способ подписания изображений.
Ооо Ртк
📁 Запросы GET и POST
Расскажите о протоколах TCP и WebSocket.
Ооо Ртк
📁 Нет темы
В чем разница между HTTP, HTTPS и WebSocket?
Орнитех
📁 Нет темы
Что обеспечивает сертификат в контексте HTTPS?
Орнитех
📁 Сетевые протоколы и безопасность
Как происходит обновление access token?
Петрович-Тех
📁 Авторизация и токены
Что такое Token revocation в контексте сетевой безопасности и как этот процесс помогает управлять доступом пользователей?
Петрович-Тех
📁 Авторизация и токены
Что произойдет, если отправить 6 запросов одновременно, и в 5 из них устареет access token? (Вопрос про interceptor)
Петрович-Тех
📁 Нет темы
Как установить подключение к WebSocket по протоколу ws (без secure) с помощью new WebSocket?
Петрович-Тех
📁 Технологии передачи данных
Что происходит при нажатии кнопки Enter в адресной строке браузера?
Поле.рф
📁 Процесс ввода URL
Где лучше хранить JWT токен и почему?
Поле.рф
📁 JWT и авторизация
После установления соединения с сервером какой HTTP метод запроса отправляется на сервер?
Промсвязьбанк
📁 Взаимодействие клиент-сервер
Что такое cookie? Какие особенности и настройки cookie?
Промсвязьбанк
📁 Нет темы
Какие существуют способы интеграции фронтенда с бекэндом?
Промсвязьбанк
📁 Нет темы
Cookies, как работают, как получить и установить, httpOnly, secure
Райффайзен
📁 Нет темы
Опишите структуру HTTP, подробно про шифрование данных, методы GET и POST, и как кэшируется GET
Райффайзен
📁 Сетевые протоколы и безопасность
Как получать данные в реальном времени с помощью WebSocket и SSE
Райффайзен
📁 Технологии передачи данных
Какие HTTP методы используются в REST (GET, POST и другие)?
Рамблер
📁 REST и GraphQL API
Что такое SSE, Polling и Long Polling? Объясните их отличия.
Рамблер
📁 Технологии веб-разработки
Можно ли в GET-запросе указать тело (body) и что произойдет в этом случае?
Рамблер
📁 Запросы GET и POST
Можно ли в query-параметрах указать массив и как это сделать?
Рамблер
📁 Параллельные асинхронные запросы
Расскажите про HTTP протокол своими словами, опишите практический опыт взаимодействия и написания запросов
Рвд Инфосистемы
📁 HTTP запросы и заголовки
Из каких компонентов состоит URL запроса и какую роль каждый из них играет в процессе передачи данных по сети?
Рвд Инфосистемы
📁 Процесс ввода URL
Какие HTTP-методы ты знаешь и с какими работал? Расскажи про метод OPTIONS.
Рвд Инфосистемы
📁 HTTP запросы и заголовки
Как работает CORS и для чего он нужен?
Рвд Инфосистемы
📁 CORS и preflight запросы
Что такое сессии и заголовок авторизации? Что означает префикс Bearer?
Рвд Инфосистемы
📁 Авторизация и токены
Что такое HTTP, из чего он состоит, какие существуют заголовки и методы?
Рв-Системс
📁 HTTP запросы и заголовки
Какие методы защиты от XSS вы знаете?
Рокет-Тех
📁 Безопасность веб-приложений
Какие существуют варианты авторизации в веб-приложениях? Опишите основные методы и их особенности.
Росгосстрах
📁 Авторизация и токены
Какие существуют способы взаимодействия с сервером помимо WebSocket? Какие у них преимущества и недостатки? В каких ситуациях лучше применять каждый из них?
Ростелеком Ит
📁 Взаимодействие клиент-сервер
Что происходит при вводе адреса сайта в браузере и нажатии Enter?
Ростелеком Ит
📁 Процесс ввода URL
Какие есть способы взаимодействия с сервером кроме WebSocket?
Ростелком Ит
📁 Взаимодействие клиент-сервер
Как можно отлавливать ошибки при работе с WebSocket?
Ростелком Ит
📁 Технологии передачи данных
Из чего состоит HTTP-запрос (заголовки, тело, методы, домен и т.д.)
РСХБ-Интех
📁 HTTP запросы и заголовки
Что такое CORS, для чего он нужен и где он настраивается
РСХБ-Интех
📁 CORS и preflight запросы
Из чего состоит HTTP/HTTPS запрос, чем отличается запрос от ответа, как запрос понимает, куда он отправляется, и как отправить картинку размером 1 Гб?
РСХБ-Интех
📁 HTTP запросы и заголовки
Когда следует использовать localStorage, а когда Cookies для хранения данных?
Ртлабс
📁 Хранилища данных в браузере
Какие существуют способы взаимодействия между клиентом и сервером?
Ртлабс
📁 Взаимодействие клиент-сервер
Какие существуют способы общения бэка с фронтом, включая HTTP, WebSocket и Polling?
Сател
📁 Технологии передачи данных
Что такое защищённые cookies в веб-разработке и как они помогают повысить безопасность пользовательских данных?
Сбер
Почему сессии не ломаются при обновлении страницы (refresh)?
Почему вы выбрали определённый storage: localStorage, sessionStorage или IndexedDB?
Сбер
Как сделать так, чтобы cookies нельзя было прочитать?
Сбер
Как кэшируются POST-запросы, если обновление происходит через POST?
Сбер
Для чего используется параметр keep-alive в HTTP?
Сбер
📁 HTTP Протокол
Какие web-серверы вы знаете и как они используются для обработки HTTP-запросов в веб-приложениях?
Сбер
📁 HTTP Протокол
Какие прикладные протоколы знаете и используете на проекте?
Сбер
📁 HTTP Протокол
Что такое handshake в сетевом взаимодействии?
Сбер
📁 HTTP Протокол
Если сайт находится на территории другой страны, помешает ли нам открыть страницу и как можно использовать DNS дружеских стран для доступа к сайту?
Сбер
📁 Нет темы
Расскажите подробно про cookie и его атрибуты (теги).
Сбер
📁 Нет темы
Как создать cookie в браузере?
Сбер
📁 Нет темы
Как удалить cookie в браузере?
Сбер
📁 Хуки и замыкания
Объясните принцип работы CORS.
Сбер
📁 CORS и preflight запросы
Что такое вебсокеты, для чего они нужны?
Сбер
📁 Транзакции и уровни изоляции
Зачем нужны data атрибуты и можно ли в них хранить пароли?
Сбер
📁 Авторизация и токены
Каковы преимущества использования axios?
Сбер
📁 Нет темы
Какие существуют коды ответа сервера и что они означают?
Сбер
📁 Взаимодействие клиент-сервер
Что такое JWT и как реализовать авторизацию с использованием JWT?
Сбер
📁 JWT и авторизация
Как вы подключали WebSocket в проект?
Сбер
📁 Веб-технологии и доступность
В чем различие между HTTP методами GET и POST
Сбер
📁 Запросы GET и POST
Объясните разницу между протоколами HTTP и HTTPS
Сбер

Какие прикладные протоколы используете на проекте?
Сбер
📁 Сетевые протоколы и блокировки
Что такое handshake в сетевых взаимодействиях?
Сбер
📁 Сетевые протоколы и блокировки
Что означают HTTP коды 400 и 500, в чем их различия
Северсталь
📁 HTTP запросы и заголовки
Получить список предметов из сервера с помощью getServerItemsApi()
Северсталь
📁 Нет темы
Добавить новые предметы на сервер с помощью saveItemToServerApi(url)
Северсталь
📁 Нет темы
Расскажите про WebSockets: что это и как используется
Северсталь
📁 Технологии передачи данных
Как проверяется, что соединение WebSockets не прервано (ping pong, heartbeat)?
Северсталь
📁 Технологии передачи данных
Объясните основы протокола HTTP.
Синхро
📁 HTTP запросы и заголовки
Объясните разницу между preload, prefetch и preconnect.
Совкомбанк
📁 Нет темы
Из чего состоят HTTP и HTTPS, в чем их отличия, какие существуют версии HTTP
Согаз
📁 Протоколы HTTP и HTTPS
Что такое CORS, что такое preflight запрос, какие заголовки используются в CORS
Согаз
📁 CORS и preflight запросы
Объясните разницу между авторизацией и аутентификацией, как работают интерцепторы, в каких случаях возникают ошибки 401 и 403
Согаз
📁 Авторизация и токены
Откуда приходят cookies, кто их устанавливает, что они хранят (особенно про refresh token), что такое заголовки secure, httpOnly и sameSite
Согаз
📁 Нет темы
Из каких частей состоит HTTP-запрос?
Согаз
📁 HTTP запросы и заголовки
Можно ли получить ошибку CORS при использовании Postman?
Согаз
📁 CORS и preflight запросы
Как проверить, авторизован ли пользователь?
Согаз
📁 Авторизация и токены
Как бы вы реализовали логику авторизации?
Согаз
📁 Авторизация и токены
Представьте, что есть три открытые вкладки (потом вкладка на ПК и телефоне). Перечислите способы общения между ними.
Спортс
📁 API и мессенджеры
Как было организована работа с сокетами?
Спринтерра
📁 Нет темы
Приходилось ли сталкиваться с поддержкой продакшена? Приходили запросы от клиентов и приходилось с этими запросами работать?
Спринтерра
📁 Нет темы


1
...
21
22
23
24
25
26



📁
Категории и Кластеры


JavaScript Core
1610


Soft Skills
1520


Практические вопросы
1407


React
1372


SQL/Databases
1252


Python
1176


Другое
1115


Java
1111


System Design
1033


Архитектура
856


DevOps
657


Сеть
510


C#/.NET
503


Верстка
435


TypeScript
370


Go
344


Message Queues
288


Тестирование
232


Алгоритмы
217


Браузеры
213


Производительность
175


Инструменты
92


Python DS
56


Node.js
53


Computer Vision
32


SQL & Analytics
27


Vue.js
18

🏢
Компании
Поиск компаний...


Не указано
3359

Сбер
1243

Яндекс
596

Ozon
256

Иннотех
233

Альфа-Банк
188

Т-Банк
186

Wildberries
177

iFellow
106

IT-One
93

Avito
92

ПочтаТех
89

Bell Integrator
85

Домклик
83

РСХБ-Интех
77

Банк
72

Sber
69

EdgeЦентр
67

Норд
60

Лига Цифровой Экономики
59

Северсталь
57

Антара
57

Новый
56

Rutube
56

Тетра
55

Prooftech IT
55

Alberis
55

Evapps
54

Элисофт
54

EPUB
54

Промсвязьбанк
53

AGIMA
52

Стилсофт
52

Точка Банк
52

Как правильно обрабатывать ошибки в WebSocket?
Спросиврача
📁 Технологии передачи данных
Занимался ли ты аутентификацией? Какие способы использовал?
Стилсофт
📁 Аутентификация и авторизация
Как работает Access и Refresh токен?
Стилсофт
📁 Аутентификация и авторизация
Как обеспечить безопасность и защиту данных в распределенной архитектуре
Т-Банк
📁 Безопасность веб-приложений
Как отменить запрос с помощью AbortController
Т-Банк
📁 Нет темы
В чем основные технические отличия между протоколами HTTP и HTTPS и как HTTPS обеспечивает безопасность передачи данных?
Теле2
📁 Протоколы HTTP и HTTPS
Как происходит установка TLS-соединения при использовании HTTPS
Теле2
📁 HTTP запросы и заголовки
Как реализовать обновление списка данных в реальном времени для всех пользователей при изменении одним из них?
Тензор
📁 Нет темы
Как сделать так, чтобы дополнительные данные для статистики подгружались только один раз при условии, что у пользователя открыто несколько вкладок, а список данных обновляется через websocket?
Тензор
📁 Нет темы
Объясните, как работают вебсокеты и библиотека socket.io
Технологии Доверия
📁 Технологии передачи данных
Какими HTTP методами ты пользовался и в чем их различия?
Тех Тпп Лаб
📁 HTTP запросы и заголовки
Можно ли обновить объект с помощью HTTP метода GET?
Тех Тпп Лаб
📁 Пути и объекты
Можно ли создать сущность с помощью HTTP метода GET?
Тех Тпп Лаб
📁 Пути и объекты
Какие параметры, кроме срока жизни, можно передать в полезной нагрузке (payload) JWT токена?
Тех Тпп Лаб
📁 JWT и авторизация
Для чего нужен последний блок JWT токена — подпись (signature)?
Тех Тпп Лаб
📁 JWT и авторизация
Если изменить payload в подписи JWT токена (например, заменить роль менеджера на администратора), будет ли такой токен работать?
Тех Тпп Лаб
📁 JWT и авторизация
Объясните работу HTTP-протокола.
Умный Сервис
📁 Протоколы HTTP и HTTPS
Расскажите про аутентификацию и авторизацию в проекте?
Уральская Сталь
📁 Аутентификация и авторизация
Что происходит после ввода адреса в браузере до момента отрисовки страницы? Опишите максимально подробно.
Учи.ру
📁 Процесс ввода URL
что произойдет при вводе в строку браузера адреса и нажатия Enter?
Учи.ру
📁 Процесс ввода URL
Что такое CORS и для чего нужен, как работает?
Фабрика
📁 Data Handling & Concurrency
Что происходит в браузере и сети при вводе URL?
Фалт Системс
📁 Процесс ввода URL
Что такое SSL и какие существуют типы шифрования (симметричные и асимметричные)?
Финам
📁 Сетевые протоколы и безопасность
Какие существуют способы получения данных с бекенда?
Финам
📁 Типы данных и селекторы
Как управлять очередностью загрузки скриптов и их выполнением?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Как происходит отправка cookies на сервер?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Какие cookies отправляются на сервер — все или только некоторые?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Что такое CORS и как работают HTTP-заголовки?
Цб Рф
📁 CORS и preflight запросы
Объясните разницу между авторизацией и аутентификацией.
Центр Авиа
📁 Авторизация и токены
Что такое JWT и как его использовать для авторизации?
Центр Авиа
📁 JWT и авторизация
Объясните методы HTTP-запросов GET и POST, разницу в формате данных и как формируется строка запроса в GET.
Центральный Банк Рф
📁 Запросы GET и POST
Где лучше хранить refresh token в веб-приложении и почему?
Цифровые Привычки
📁 Авторизация и токены
Что такое HTTP 403, 404, 500, 302, 204, 201, 200?
Чём
📁 HTTP Протокол
Что такое CORS (Cross-Origin Resource Sharing) и как этот механизм обеспечивает безопасность веб-приложений при запросах между разными доменами?
Чём
📁 Data Handling & Concurrency
Если при запросе на сервер возникает ошибка, какие шаги вы предпримете для её обработки и устранения?
Эремейч Рус
📁 Взаимодействие клиент-сервер
Объясните работу WebSocket и его применение
Юспи Групп
📁 Технологии передачи данных
Расскажи модель OSI, какие уровни знаешь?
Ядро Телеком
📁 Transaction Isolation
На транспортном уровне в OSI какие протоколы есть?
Ядро Телеком
📁 HTTP Протокол
Расскажи про протокол ARP и его назначение?
Ядро Телеком
📁 HTTP Протокол
Расскажи, как работает NAT (Network Address Translation)?
Как реализовать скрытие прочитанных новостей с использованием WebSocket?
Яндекс
📁 Технологии передачи данных
Как уведомлять пользователя о новой новости с помощью WebSocket и отображать уведомление через тост?
Яндекс
📁 Технологии передачи данных
Что делать с промежуточными данными, которые могут потеряться при переподключении к WebSocket?
Яндекс
📁 Технологии передачи данных
Для чего использовали WebSocket и почему выбрали именно его?
Яндекс
📁 Технологии передачи данных
Как распределяли нагрузку по WebSocket?
Яндекс
📁 Технологии передачи данных
Что бы вы сделали, если WebSocket не держит соединение? Расскажите про балансировщики и сессии.
Яндекс
📁 Технологии передачи данных
Какие методы HTTP-запросов существуют?
Яндекс
📁 HTTP запросы и заголовки
По каким параметрам ограничивает CORS?
Яндекс
📁 CORS и preflight запросы
Что такое идемпотентные методы и зачем они нужны?
Яндекс
📁 Нет темы
Какие методы взаимодействия сервисов для постоянного соединения вы знаете (SSE, WebSocket, Polling) и какие проблемы с
