Расскажите подробно, как редактировали npm-пакеты, где их хранили и т.д.
Argo Studio
📁 npm и Nginx в CI
Какими пакетными менеджерами вы пользовались?
Nexign
📁 Нет темы
Что ты делаешь перед установкой npm пакета?
R-Vision
📁 npm и Nginx в CI
Что такое process.nextTick в Node.js и как он работает?
Tybbo System
📁 Next.js и Three.js интервью
Почему вы использовали socket.io в проекте?
Альфа-Банк
📁 Технологии передачи данных
Расскажите о ключевых отличиях между Node.js, Deno и Bun, включая их архитектуру, безопасность и поддержку модулей.
БКХ Еком
📁 Дескрипторы и элементы HTML
Расскажи о процессе разработки и публикации внутренних npm пакетов.
КвинсДевелопмент
Какие инструменты использовали для управления пакетами в монорепозитории (workspaces), в том числе про lerna?
Медиалогия
📁 Нет темы
Зачем нужен файл .lock в проекте и какую роль он выполняет?
Сбер
📁 Файлы package.json и package-lock.json
В чем разница между dev-зависимостями и обычными зависимостями в package.json?
Согаз
📁 Программирование и зависимости
Как прогреть кэш в Node.js и какие техники используются для оптимизации производительности приложений на этом языке?
Центр Авиа
📁 Next.js и Three.js интервью
Для чего используется Node.js?
Центр Авиа
📁 Next.js и Three.js интервью
npm, что это, какие у него проблемы
Центральный Банк Рф
📁 npm и Nginx в CI
Был ли у вас опыт создания собственных npm-пакетов? Опишите процесс.
Argo Studio
📁 Нет темы
Как TypeScript работает на бэкенде с Node.js?
Clipchamp
Расскажите принцип работы кластеров в Node.js.
ESoft
Есть ли в Node.js event loop и как он работает?
F6 - Команда Кибербезопасности
📁 Обработка событий в JavaScript
Расскажите о вашем опыте работы с Telegram API в Node.js и как вы реализовывали взаимодействие с ботами или клиентами.
GET
📁 Database Experience
Что такое package-lock.json и что хранится в package.json?
Lanit Bpm
📁 Файлы package.json и package-lock.json
Какие основные недостатки и проблемы существуют у npm как менеджера пакетов для JavaScript и Node.js проектов?
Для чего нужны файлы package.json и package-lock.json
Nexign
📁 Файлы package.json и package-lock.json
В чем разница между package.json и package-lock.json
Nexign
📁 Файлы package.json и package-lock.json
Что такое декораторы в NestJS?
Queen Games
📁 Нет темы
Каков порядок выполнения задач (tasks) в Node.js?
Tybbo System
📁 Next.js и Three.js интервью
Вы знакомы с feature flags и написанием Babel плагинов для удаления deprecated компонентов?
Unknown
Как в Node.js можно программно скачать и сохранить изображения из интернета с помощью асинхронных запросов?
Unknown
📁 File Handling
Что такое module auditor в npm и для чего он используется?
Айкон Про
📁 npm и Nginx в CI
Что такое npm link и как он используется?
Вирту Системс
📁 npm и Nginx в CI
Какую версию Node.js вы использовали на проекте?
Домклик
📁 Next.js и Three.js интервью
В чем отличие команд npm install и npm ci?
Домклик
📁 npm и Nginx в CI
Как находить уязвимости и устаревшие пакеты с помощью npm audit и npm outdated?
Домклик
📁 Нет темы
Для чего нужна дедупликация зависимостей в проектах?
Домклик
📁 Нет темы
В чем разница между командами npm i и npm ci?
Домклик
📁 npm и Nginx в CI
Для чего используется команда npm i в Node.js и как она управляет установкой зависимостей в проекте?
Домклик
📁 npm и Nginx в CI
Для чего нужно поле main в package.json?
Домклик
📁 Файлы package.json и package-lock.json
Для чего нужно поле sideEffects в package.json?
Домклик
📁 Файлы package.json и package-lock.json
Расскажите о вашем опыте работы с Node.js и как вы использовали его для создания серверных приложений на JavaScript?
Корпорация Элар
📁 Next.js и Three.js интервью
Что такое npm и какие аналоги вы знаете?
Лемма
📁 npm и Nginx в CI
Покажите файл package.json и расскажите, какие библиотеки используются в проекте.
Ооо Ртк
📁 Файлы package.json и package-lock.json
Что такое Babel и как этот инструмент помогает преобразовывать современный JavaScript код для поддержки старых браузеров?
Для чего нужен package-lock.json и нужно ли его отправлять в Git?
Сбер
📁 Файлы package.json и package-lock.json
Чем отличается npm install от npm ci?
Сбер
📁 npm и Nginx в CI
Как в package.json указать версию Node.js и пакетного менеджера?
Согаз
📁 Файлы package.json и package-lock.json
Что означает поле type в package.json?
Согаз
📁 Файлы package.json и package-lock.json
Зачем нужен файл package-lock.json в проекте на JavaScript?
Согаз
📁 Файлы package.json и package-lock.json
Как определить наступление события в Node.js?
Центр Авиа
📁 Next.js и Three.js интервью
Объясните разницу между холодным и горячим кэшем в Node.js.
Центр Авиа
📁 Next.js и Three.js интервью
Работали ли вы с Electron? Если да, то в каком контексте?
Яндекс
Что такое npm-пакет и как он используется для управления зависимостями в JavaScript проектах?
Яндекс
📁 npm и Nginx в CI
Как вы публиковали компоненты в npm? Расскажите про процесс: версионирование, приватный реестр, монорепозиторий.
Яндекс
📁 npm и Nginx в CI
Почему вы выбрали Lerna + npm, а не другие инструменты?
Яндекс
📁 Нет темы
С какими проблемами вы столкнулись при настройке монорепозитория? Были ли баги с зависимостями?
Яндекс
📁 Нет темы
Как настроен ваш приватный npm-реестр? Это облачное решение (GitHub Packages) или самописное?
Яндекс
