Что такое CDN и как он работает?
Bell Integrator
📁 CI/CD и CDN
Что такое preload и prefetch, и для чего они нужны?
Bell Integrator
📁 Нет темы
Что такое tree shaking и как он влияет на производительность?
Bell Integrator
📁 Нет темы
Оптимизация фронтенд-приложений: методы и подходы
Broad Apps
📁 Оптимизация приложений
Что такое критический путь рендеринга и как его оптимизировать?
Cosysoft
📁 Рендеринг и рекурсия
Какие существуют способы оптимизации производительности фронтенд-приложений?
Crtex
📁 Способы оптимизации
Расскажите об оптимизациях, которые вы делали, и какие способы оптимизации знаете
Diasoft
📁 Способы оптимизации
Какие подходы к оптимизации фронтенда и бэкенда вы использовали?
ESoft
Как диагностировать проблемы с производительностью веб-приложения?
Fatzoom
📁 Оптимизация скорости загрузки
Как решать проблемы с записью аудио при плохой скорости интернета, в частности, когда в Firefox запись отказывается работать?
GhostBusters
📁 Оптимизация скорости загрузки
Были ли в твоей практике случаи оптимизации приложения, которые повлияли на UX?
iFellow
📁 Оптимизация приложений
Приведи пример способа оптимизации дорогой (объемной) операции, чтобы она не влияла на остальной компонент.
iFellow
📁 Способы оптимизации
Какие метрики производительности вы используете для оценки фронтенд-приложений?
Umbrella It
📁 Нет темы
Какие ограничения по нагрузке и производительности следует учитывать при разработке?
Unknown
Как оптимизировать фронтенд по производительности (разделение кода, сжатие, lazy loading)?
Unknown
Какие есть способы оптимизации загрузки и рендеринга большого количества карточек и элементов на странице?
Unknown
Как оптимизировать отображение списка из тысячи элементов, чтобы не использовать слишком много трафика и ресурсов?
Unknown
Можете ли структурировать советы Lighthouse по основным категориям?
Unknown
Как можно улучшить Time to Interactive, если некоторые кнопки на карточках не работают, пока видео полностью не загрузилось?
Unknown
Для чего используется CDN (Content Delivery Network)?
Объясни понятия Reflow, Repaint и Composite в браузере.
Аг-Логистика
📁 Рендеринг и рекурсия
Какие существуют уровни оптимизации производительности помимо трешейкинга?
Ай-Теко
📁 Способы оптимизации
Расскажи подробно про web vitals
Ай-Теко
📁 Веб-технологии и доступность
Как оптимизировали приложения с помощью gzip, React.lazy, code chunks, кэширования, useMemo и useCallback?
Ай-Теко
📁 Оптимизация приложений
Какие средства для оптимизации использовали и где смотрели метрики производительности?
Альфа-Банк
📁 Способы оптимизации
Рассказать про оптимизацию приложения, какие реакт предоставляет инструменты для оптимизации
Аэроклуб
📁 Оптимизация приложений
Объясните понятия lazy loading, bundle analyzer, svg, woff2 и методы оптимизации.
Домклик
📁 Способы оптимизации
Какие методы оптимизации проекта вы знаете и как их применяете?
Евротехкилмат
📁 Способы оптимизации
Как диагностировать и решать проблемы с производительностью в React-приложении, если есть задержка ввода в input?
Исходный
Как работает next/dynamic под капотом и почему это ускоряет загрузку страницы?
Кокос.Group
📁 Оптимизация скорости загрузки
Какие инструменты вы планируете использовать для мониторинга нагрузки?
Ооо Ртк
📁 Нет темы
Опишите методы оптимизации производительности: gzip сжатие, минификация и углификация, оптимизация SVG.
Платежное Решение
📁 Способы оптимизации
Как не блокировать рендеринг стилями при очень большом бандле CSS?
Росбанк
📁 Редукция и рендеринг компонентов
К вам пришел менеджер и говорит: 'Страница на сайте лагает!'. Какие шаги вы предпримете для решения проблемы?
Ростелеком Ит
📁 Нет темы
Как вы определяете, что бандл оптимален с точки зрения производительности?
Сбер
Какие стадии рендера влияют на производительность виртуализации больших таблиц и как на это влияют критический путь рендера, async/defer и CSS-свойство transform?
Сбер
📁 Виртуализация в React
Расскажите про оптимизацию: деление на чанки, виртуализация и другие методы.
Сбер
📁 Нет темы
Что такое Critical CSS и как его использование влияет на производительность загрузки веб-страниц?
Совкомбанк
📁 Специфичность CSS селекторов
Какие метрики Lighthouse вы знаете и как можно оптимизировать их показатели?
Финуслуги
📁 Нет темы
Какие системные решения ты знаешь для оптимизации приложения?
Яндекс
📁 Оптимизация приложений
Расскажите про метрики отрисовок, например, Lighthouse
Яндекс
📁 Нет темы
Есть жалобы от клиентов, сайт долго грузится, рассказать что можно замедлить соединение в network
Яндекс
📁 Оптимизация скорости загрузки
Приходилось ли вам оптимизировать производительность приложения?
Яндекс
📁 Оптимизация приложений
Какие способы оптимизации производительности ты использовал в своих приложениях?
Alfabit
📁 Оптимизация приложений
Как выполнить объёмную операцию в браузере, чтобы он не тормозил и не зависал?
Alfabit
📁 Оптимизация скорости загрузки
У тебя есть бандл, твоя задача его оптимизировать (только js). Сборка приложения происходит на webpack
AmoCRM
📁 Оптимизация приложений
По вашему опыту, с какими ограничениями React вы сталкивались? Какие факторы влияют на производительность React-приложений?
Argo Studio
📁 Нет темы
Что самое дешёвое для анимации в браузере (transform) и как часто будет запускаться RequestAnimationFrame?
ATI.su
📁 Анимации в браузере
Если у вас есть идея по оптимизации процессов, что вы с ней сделаете?
ATI.su
📁 Способы оптимизации
Какой процесс анимации более ресурсоемкий: transform или изменение position:absolute?
Bell Integrator
📁 Анимации в браузере
Как следить за производительностью приложений
BetBoom
📁 Оптимизация приложений
Какие способы оптимизации производительности приложения вы знаете?
Clevertec
📁 Оптимизация приложений
Какие способы оптимизации скорости загрузки страницы вы знаете?
Data World
📁 Оптимизация скорости загрузки
Какие существуют способы оптимизации производительности фронтенда?
Datsteam
📁 Способы оптимизации
Как применить ленивую загрузку к изображениям на странице?
Digital Sector
📁 Свойства отображения элементов
Что знаете про Web Vitals и как следите за метриками производительности?
EnjoyPro
📁 Веб-технологии и доступность
Опиши подходы к оптимизации производительности сайта и сервера.
ESoft
Как работает кэширование на бекенде и фронтенде?
ESoft
Клиент зарегистрировался, попал на главную страницу, затем перешёл в личный кабинет, который загружается 30 секунд. Какие действия вы предпримете для решения этой проблемы?
Evercode Lab
📁 Взаимодействие клиент-сервер
Как оптимизировать компонент с большим списком элементов (виртуализация)?
Frontend
Почему страница зависает при обработке массива из миллиарда элементов? Какие подходы можно использовать для оптимизации?
Garage
Влияет ли семантическая верстка на скорость загрузки страницы?
Garage
Каким образом ты бы диагностировал и улучшил производительность медленно загружающейся страницы?
Garage
Как оптимизировать запросы на сервер при поиске (например, при каждом вводе символа в инпут)?
Garage
Представь, что main.js весит 5 мегабайт и долго загружается — что будешь делать?
Garage
Как решить проблему отправки видео и аудио при нестабильном интернете, используя кеширование на стороне клиента в indexedDB с учётом лимитов хранения и динамической смены битрейта/разрешения в зависимости от доступного места?
GhostBusters
📁 Оптимизация скорости загрузки
Как организовать отправку аудио при нестабильном интернете, чтобы не забивать канал и не зависать в бесконечном цикле попыток отправки?
GhostBusters
📁 Оптимизация скорости загрузки
Какие API и стратегии вы бы использовали для адаптации медиапотока к изменяющимся условиям сети, например, для уменьшения задержек или улучшения качества при низкой пропускной способности?
GhostBusters
📁 Оптимизация скорости загрузки
Как оптимизировать фронтенд при загрузке сайта, чтобы избежать белого экрана?
Huntit
📁 Нет темы
Есть проблема с производительностью: приходит 20 тыс объектов, их нельзя разбить на части, объекты взаимосвязаны, загрузка долгая. Какие подходы можно применить для оптимизации?
iFellow
📁 Нет темы
В чем разница между рендерингом и отрисовкой?
IT-One
📁 Рендеринг и рекурсия
Замеряли ли вы метрики производительности на фронтенде?
IT-One
📁 Нет темы
Какие хуки React вы знаете для оптимизации производительности?
IT-One
📁 Способы оптимизации
Как имитировать медленное интернет-соединение с помощью инструментов разработчика?
Jsa-Group
📁 Оптимизация скорости загрузки
Расскажите про работу с девтулз, включая Lighthouse и анализ производительности
Kaspersky
📁 Нет темы
Какие существуют способы оптимизации веб-страницы
Lada Цифра
📁 Отрисовка страниц в браузере
Как бы вы оптимизировали производительность приложения при отсутствии пагинации?
LegalTech
📁 Оптимизация приложений
Как оптимизировать производительность приложения?
Match
📁 Оптимизация приложений
Были ли у вас задачи по оптимизации производительности? Расскажите о них
Merlion Tech
📁 Способы оптимизации
Что такое Tree Shaking в контексте оптимизации производительности JavaScript приложений и как он работает?
Mozen
📁 Нет темы
Как ускорить загрузку и работу большого React-приложения, которое долго грузится и тормозит в браузере?
Nedra Digital
📁 Оптимизация скорости загрузки
Какие проблемы и методы их решения существуют при лагах на странице?
Nedra Digital
📁 Нет темы
Какие методы оптимизации знаешь? Приведи примеры применения практик оптимизации, например использование useCallback.
Right Line
📁 Способы оптимизации
Как отследить до билда оптимизацию удаления лишнего кода?
Right Line
📁 Нет темы
Перечислите все способы оптимизации производительности веб-приложения
RTSoft
📁 Нет темы
Если бекенд выдает 10 тысяч элементов, а мы должны их все отобразить, как оптимизировать рендеринг?
Rutube
Какие методы оптимизации рендеринга React-компонентов знаешь и применял?
Rutube
Способы оптимизации приложения
R-Vision
📁 Оптимизация приложений
Расскажи про метрики LCP, FID и CLS
R-Vision
📁 Нет темы
В чем отличия кеширования на клиенте и на сервере?
Smena
📁 Взаимодействие клиент-сервер
Что такое reflow и repaint в браузере и как они влияют на производительность?
Smena
📁 Рендеринг и рекурсия
Какими CSS-свойствами лучше создавать анимацию и почему?
Soft Media Group
📁 Анимации в браузере
Что такое Web Worker и как он помогает улучшить производительность приложений?
Start X
📁 Web Workers и Service Workers
Какие методы и подходы можно использовать для улучшения производительности сайта на основе аудита Lighthouse?
Start X
📁 Нет темы
Что такое хвостовая рекурсия и как она влияет на производительность?
Tybbo System
📁 Рендеринг и рекурсия
Какие способы анимации в CSS существуют? Какие из них более производительны и в каких случаях лучше использовать каждый из них?
Unirest
📁 Анимации в браузере
Как организовать работу с картинками (CDN, загрузка, ссылки)?
Unknown
Как можно оптимизировать загрузку трафика и производительность при использовании promoted video?
Unknown
Как оптимизировать запросы на сервер при пустом поисковом запросе и очищать список результатов?
Unknown
Какие компоненты переписывали на асинхронную загрузку, код-сплитинг?

Как вы подходили к реализации lazy loading и code splitting?
Unknown
Виртуализация сообщений — какой подход использовать?
Unknown
Какие есть подходы для улучшения перформанса приложения в целом?
Unknown
Какие улучшения с точки зрения UX, UI, производительности и девелоперского опыта ты бы предложил для этого кода?
Unknown
Зачем нужны Lighthouse отчеты? Какие категории они проверяют?
Unknown
Как организовать очистку памяти при удалении DOM-объекта, если он хранится в Map?
Unknown
Какие наиболее частые причины плохой производительности веб-страницы с большим количеством карточек фильмов?
Unknown
Какие основные подкатегории раздела Performance в Lighthouse?
Unknown
Как проверить безопасность и совместимость с разными устройствами с помощью Lighthouse?
Unknown
В чем могут быть слабые места, сильно ухудшающие рейтинг Performance?
Unknown
Как вы определяли причины тормозов приложения и какие инструменты для этого использовали?
Westlink
📁 Нет темы
Если контекст пагубно влияет на приложение, вызывая лишние рендеры и лаги, что бы ты сделал для оптимизации?
Wildberries
📁 Нет темы
Приведите примеры неблокирующих ресурсов в веб-разработке.
Авито
Как грузятся критичные ресурсы на странице?
Авито
Какие есть подходы к оптимизации загрузки JavaScript и CSS?
Айкон Про
📁 Специфичность CSS селекторов
Какие способы оптимизации производительности ты используешь в своих проектах?
Ай-Теко
📁 Способы оптимизации
Как оптимизировать Critical Rendering Path (CRP) для улучшения производительности загрузки страницы?
Альфа-Банк
📁 Нет темы
Как оптимизировать CSS для повышения производительности и уменьшения времени загрузки?
Альфа-Банк
📁 Специфичность CSS селекторов
Как оптимизировать загрузку и построение DOM-дерева для улучшения производительности?
Альфа-Банк
📁 DOM и его особенности
Какой этап отрисовки тяжелее: Reflow или Repaint?
Аэроклуб
📁 Рендеринг и рекурсия
Какие инструменты и CSS-свойства (transform, opacity, will-change) помогают избежать Reflow?
Аэроклуб
📁 Нет темы
Инструменты для оптимизации сборки
Аэроклуб
📁 Способы оптимизации
Как оптимизировать кеширование в ISR, если на одном сервере запущено много инстансов одного приложения?
БКХ Еком
📁 Взаимодействие клиент-сервер
Что такое repaint и reflow? Какие рекомендации по написанию производительного кода можно дать, исходя из этих понятий?
Газпромбанк
📁 Рендеринг и рекурсия
Как оптимизировал работу с большими списками и таблицами и за какими метриками следил
Главгоэкспертиза
📁 Способы оптимизации
Что такое атрибут preload и как он используется?
Домклие
📁 Нет темы
Что такое prefetch и preconnect и как они влияют на загрузку ресурсов?
Домклие
📁 Нет темы
Как выглядит утечка памяти на графиках и как её обнаружить?
Домклик
📁 Нет темы
Какие методы и техники можно использовать для оптимизации фронтенда?
Интерфакс
📁 Способы оптимизации
Какие проблемы с производительностью возникали при использовании SSR и как решали проблему с уникальными идентификаторами?
Исходный
Какие инструменты вы бы использовали для поиска причины медленной работы компонента?
Исходный
Приходилось ли вам работать с оптимизацией? Какие инструменты для этого использовали? (React Profiler, API React Profiler)
Компэл
📁 Способы оптимизации
Как оптимизировать приложение с учетом метрик FCP, LCP, CLS и других?
Лига Цифровой Экономики
📁 Оптимизация приложений
Какие инструменты для анализа производительности используешь (Lighthouse, Performance, Network и т.д.)?
Лига Цифровой Экономики
📁 Нет темы
Как бы ты оптимизировал проект? Какие средства в React существуют для оптимизации?
Мегафон
📁 Способы оптимизации
Как оптимизировать приложение при работе с большими объёмами данных?
Ниу Вшэ
📁 Нет темы
Какие этапы включают в себя repaint, repainting и compositing в процессе рендеринга?
Новый
Какие особенности анимаций влияют на производительность?
Новый
Как вы оптимизировали проект? Использовали ли инструменты мониторинга и анализа производительности, такие как Sentry, LightHouse, WebPageTest и другие?
Ооо Ртк
📁 Способы оптимизации
Что такое реконсиляция в React и как она влияет на производительность?
Поле.рф
📁 Рендеринг и рекурсия
Как можно оптимизировать вывод тысячи элементов на страницу? Работали ли вы с виртуализацией?
Поле.рф
📁 Отрисовка страниц в браузере
Как собрать и оптимизировать множество запросов списков с бэкенда?
Рвд Инфосистемы
📁 Нет темы
Как оптимизировать приложения, как понять, что оптимизация прошла успешно, и какие метрики использовать?
Рокет-Тех
📁 Нет темы
Доводилось ли оптимизировать приложение? Расскажите, как именно вы это делали.
Ростелеком Ит
📁 Оптимизация приложений
Как оптимизировать работу с загрузкой больших объемов данных по API (например, в таблице)?
Р-Софт
📁 Оптимизация скорости загрузки
Что такое FCP (First Contentful Paint) и какие существуют правила оптимизации?
РСХБ-Интех
📁 Архитектура FSD
Какие существуют способы оптимизировать загрузку страницы, если она долго загружается?
Сател
📁 Оптимизация скорости загрузки
Можешь рассказать о способах оптимизации веб-приложений?
Сбер
Приходилось ли вам оптимизировать бандлы и избавляться от тяжеловесных пакетов? Расскажите о вашем опыте.
Сбер
Насколько приходится задумываться об оптимизации фронтенда в SSR (Server Side Rendering)?
Сбер
Кто быстрее отрендерит кнопку: React или ванильный JS?
Сбер
📁 Next.js и Three.js интервью
Как оптимизировать производительность любого веб-приложения, не только React?
Сбер
📁 Оптимизация приложений
Расскажите о грубых ошибках с точки зрения оптимизации, которые вы допускали в проектах
Сбер
📁 Способы оптимизации
Как предотвратить ошибку в одном виджете, чтобы она не влияла на работу всего приложения
Северсталь
📁 Оптимизация приложений
Как браузер определяет, что нужно обращаться к ближайшему серверу CDN?
Согаз
📁 Процесс ввода URL
Какие методы оптимизации скорости загрузки фронтенда вы знаете?
Согаз
📁 Нет темы
Как работает инструмент Lighthouse для анализа производительности веб-страниц?
Согаз
📁 Нет темы
Представь, что страница долго грузится или лагает. Как бы ты оптимизировал её и с чего бы начал?
Спортс
📁 Отрисовка страниц в браузере
Что такое библиотека Reselect в контексте оптимизации производительности Redux-приложений и как она помогает создавать мемоизированные селекторы?
Стилсофт
📁 Рендеринг и рекурсия
Рассмотрите вопросы производительности веб-мессенджера с использованием Web Vitals и Lighthouse.
Т-Банк
📁 Нет темы
Что такое реконсиляция?
Точка Банк
📁 Рендеринг и рекурсия
Для чего использовали reselect?
Транснефть
📁 Рендеринг и рекурсия
Оптимизировали ли вы изображения для ретины и каким образом?
Финуслуги
📁 Нет темы
Как оптимизировать изображения для дисплеев с высокой плотностью пикселей (ретина)?
Финуслуги
📁 Нет темы
Приходилось ли решать проблемы с оптимизацией? Какие методы использовал?
Яндекс
📁 Способы оптимизации
Какие действия ты предпримешь, если тебе скажут, что сайт тормозит?
Яндекс
📁 Нет темы
Пробовал ли ты самостоятельно разбираться с инструментом Lighthouse?
Яндекс
📁 Опыт и практики разработки
Был ли у тебя опыт работы с метриками интерактивности?
Яндекс
📁 Библиотеки и графики
Пользователи жалуются, что при открытии приложения появляется белый экран. Что вы будете делать?
Яндекс
📁 Нет темы
Объясните концепции оптимизации загрузки: lazyload и preloader.
Яндекс
📁 Способы оптимизации
Типичная задачка: у клиента сайт медленно грузится, рассказать про вкладку network, memory, react-profiler, виртуализацию, webpack, мемоизацию
Яндекс
📁 Оптимизация скорости загрузки
Привести пример, когда что-то привносил в проект, оптимизировал что-то
Яндекс
📁 Способы оптимизации
Как снижали TTFB (Time to First Byte) для страниц? Использовали CDN, кэширование, пререндер?
Яндекс
📁 Оптимизация скорости загрузки
Приложение долго загружается, как бы вы решали эту проблему?
Яндекс
📁 Оптимизация скорости загрузки
Что делать, если сайт медленно прогружается?
Яндекс
📁 Оптимизация скорости загрузки
