Почему тесты могут не проходить на сервере, хотя процессор и окружение похожи?
Arenadata
📁 Системная интеграция
Насколько полезна процентная метрика покрытия unit тестами проекта?
Argo Studio
📁 Unit-тестирование и его аспекты
Как считаешь, что тесты без моков — это юнит-тесты или интеграционные?
Bibinet — агрегатор пресс-листов магазинов автозапчастей
📁 Тестирование
Как устроена система тестирования, пишутся ли юнит-тесты?
Bip.ru
📁 Тестирование
Какие виды тестов писал, что использовал?
DCloud
📁 Testing Types
Как вы писали тесты на проекте и как мокали данные для тестов?
HolyWeb
📁 Unit-тестирование и его аспекты
Какие тесты вы пишете и почему?
Infinet Wireless
📁 Unit-тестирование и его аспекты
Как заинжектировать мок в тестах с использованием Mockito?
Java Collections Framework
📁 Тестирование
У вас покрывали кода до тестами? Какие типы тестов писали?
Jetland
📁 Code Quality
Какие параметры бывают у TestInstance?
Meeting
📁 URL Shortener
Какие есть аннотации для выполнения тестов?
Meeting
📁 Testing Types
Что ты делаешь, когда отправил задачу на тестирование: берешь сразу новую или ждешь тестирования старой?
MinervaSOFT
📁 Unit-тестирование и его аспекты
Как refactor-ить код и как покрыть его автотестами?
Ozon
📁 Code Quality
Как замокать HTTP вызов для юнит-тестирования?
Ozon
📁 HTTP Протокол
Работаете ли вы с юнитами и интеграционными тестами?
Postgres
📁 Тестирование ПО
Как было реализовано тестирование компонентов в вашем проекте?
Unirest
📁 Unit-тестирование и его аспекты
Приходилось ли вам вносить изменения в исходный код, чтобы автотесты не падали?
Unknown
Есть ли особенности написания приложения, чтобы его можно было автоматически тестировать?
Unknown
Какие баги и несоответствия вы видите в текущей реализации поиска, например, одновременное отображение ошибки и списка?
Unknown
Есть ли у вас опыт написания unit тестов? Как используете mock?
Unknown
📁 Тестирование
Пишете ли вы тесты? Какие? Юнит-тесты? Интеграционные?
Unknown
📁 Тестирование
Можно ли сделать параметризованный тест, чтобы заменить несколько тестов одним?
Unknown
📁 Testing Types
Писал ли ты тесты? Какие? Оптимизировал ли нагрузочные тесты?
Unknown
📁 Тестирование
Кто пишет тесты: разработчики сами пишут автотесты или это делают тестировщики, как организовано тестирование?
Unknown
📁 Тестирование
Писал ли ты тесты? Какие именно и что использовала для тестирования?
Unknown
📁 Testing Types
Как происходит тестирование?
Unknown
📁 Тестирование ПО
Какие виды тестов в рамках своих сервисов вы поддерживаете, разрабатываете и проводите? Какие не используете?
Unknown
📁 Тестирование
Если мы будем говорить более про общие черты идеального юнит теста, какой он должен быть?
Unknown
📁 Тестирование
Какие подходы к тестированию вы используете? Как вы относитесь к юнит-тестам?
Unknown
📁 Тестирование
Что такое mock объекты в тестировании и зачем они используются для имитации поведения зависимостей в модульных тестах?
Unknown
📁 Garbage Collection
Что знаешь про линтеры и тесты?
WebFocus
📁 Testing Types
Что такое тестирование программного обеспечения и какие основные виды тестов применяются для обеспечения качества кода?
Авиационные Интерьеры
📁 Unit-тестирование и его аспекты
Чем отличаются snapshot тесты от screenshot тестов
Айкон Про
📁 Unit-тестирование и его аспекты
С тестами как было на проекте? Использовали Jest и React Testing?
АФЛТ
Если одна ручка дергает четыре метода, как писать юнит-тесты?
БД | | 13
📁 Тестирование
Приходилось ли писать тесты? Какие?
ВТБ
📁 Testing Types
Насколько в проекте важно покрытие тестами?
ВТБ
📁 Тестирование ПО
Расскажи про тесты, которые писал. Как относишься к тестированию?
Газпромбанк.
📁 Testing Types
Писал ли ты E2E-тесты? Если да, то с какими инструментами?
Группа Астра
📁 Unit-тестирование и его аспекты
Используете ли unit of work, паттерны для упрощения смены базы данных?
Приложение «пятерочка», Раздел Доставки

Использовал ли ты тесты и какие именно?
Ренессанс Страхование
📁 Unit-тестирование и его аспекты
Какие инструменты (selenium, playwright) используются для автоматизации тестирования?
Российская, лидер на рынке кибербезопасности в России.
📁 Тестирование
Как ты работаешь с аутентифицированными запросами в тестах?
Российская, лидер на рынке кибербезопасности в России.
📁 Authorization Services
Насколько важно покрывать тестами? Есть ли покрытие ради покрытия?
Сбер
Если нужно протестировать синтаксис конкретных SQL-запросов в юнит-тестах, как это делать?
Сбер
📁 SQL Запросы
Были ли сложности при написании тестов?
Сбер
📁 Unit-тестирование и его аспекты
А с точки зрения тестов? Кто у вас писал тесты?
Собес2
📁 Testing Types
Какой у тебя опыт с End-to-End тестами (Cypress, Playwright, Selenium) и функциональным тестированием?
Спринтерра
📁 Unit-тестирование и его аспекты
Расскажи про опыт написания тестов: юнит, интеграционные, функциональные
Точка
📁 Тестирование ПО
Расскажи про юнит тестирование, что тебе в нем понравилось?
Упомянута «бренд Контор»
📁 Тестирование
какие критерии оценки когда мы будем использовать при ревью?
Учи.ру
📁 Unit-тестирование и его аспекты
Какие основные правила написания тестов вы знаете?
Элисофт
📁 Testing Practices
Как устроен цикл написания теста (Arrange, Act, Assert)?
Элисофт
📁 Тестирование
Какие есть атрибуты для тестов и зачем они нужны?
Элисофт
📁 Тестирование
Какие виды тестов следует использовать для сервиса?
Яндекс
📁 Unit-тестирование и его аспекты
Как бы вы внедряли тесты в процесс разработки?
Яндекс
📁 Unit-тестирование и его аспекты
Как тестировали приложение? (Unit тестирование, покрытие, e2e)
Яндекс
📁 Unit-тестирование и его аспекты
Какие виды тестирования вы используете в проекте?
Яндекс
📁 Unit-тестирование и его аспекты
Какие тесты тебе доводилось писать или под твоим руководством писали?
AGIMA
📁 Testing Practices
Кратко объясните разницу между юнит-тестированием и интеграционным тестированием.
Arenadata
📁 Тестирование
Как решать проблему интеграционного тестирования коннекторов, если внешние системы недоступны физически?
Arenadata
📁 Системная интеграция
Что делать, если тесты, которые проходят локально, не проходят на сервере?
Arenadata
📁 Тестирование
Какими свойствами должен обладать хороший unit-тест?
Argo Studio
📁 Unit-тестирование и его аспекты
В каких случаях покрытие тестами может замедлить разработку вместо ускорения?
Argo Studio
📁 Unit-тестирование и его аспекты
Расскажи про unit тесты и React Testing Library.
Belitsoft
📁 Unit-тестирование и его аспекты
Команда была кросс-функциональная? Были ли тестировщики?
Bibinet — агрегатор пресс-листов магазинов автозапчастей
📁 Тестирование
Писали ли юнит-тесты?
Bibinet — агрегатор пресс-листов магазинов автозапчастей
📁 Тестирование
Какие тесты пишешь? Что понимаешь под юнит-тестами?
Bibinet — агрегатор пресс-листов магазинов автозапчастей
📁 Тестирование
Почему не 6 тест кейсов?
Bibinet — агрегатор пресс-листов магазинов автозапчастей
📁 Тестирование
Пробовал ли писать тесты по TDD? Что думаешь об этом?
Bibinet — агрегатор пресс-листов магазинов автозапчастей
📁 Testing Practices
Можешь рассказать про тесты, какие-то есть, описывал, проводил?
Blackfall Group
📁 Testing Types
Писал ли ты тесты на проектах?
BlackWallGroup
📁 Тестирование
Что использовал для тестирования?
BlackWallGroup
📁 Тестирование
Почему в проекте отсутствуют тесты?
Caridigital
Ты сказала про практики построения автотестов. Ты бейс-плейдж, бейс-плейдж. А какие-нибудь еще паттерны на проектирование вы используете?
CI/CD |
📁 Тестирование
Если у вас параллельный запуск, у вас используется какой-то один юзер на все, именно вот уже в автотестах не локально, а где они там прогоняются? Или какой-то или есть какой-то...
CI/CD |
📁 Тестирование
А где тесты прогоняются вообще? На каких-то раннерах или это докеры?
CI/CD |
📁 Тестирование
Какие на твой взгляд лучшие практики автотестов? Как выстраивается архитектура, на что нужно обращать внимание?
CI/CD |
📁 Тестирование
Что такое Selenium и для чего он используется?
Clipchamp
Какие библиотеки для юнит-тестирования вы используете?

типы тестирования, инструменты
Cosysoft
📁 Unit-тестирование и его аспекты
Есть ли у вас тестировщики? Как они работают?
Datagile
📁 Unit-тестирование и его аспекты
Как вы писали тесты, какие подходы использовали
Datanomica
📁 Unit-тестирование и его аспекты
Что такое jest.fn() и как его использовать
Datanomica
📁 Нет темы
Для чего нужны beforeEach() и afterEach() в тестах
Datanomica
📁 Unit-тестирование и его аспекты
Писал ли интеграционные тесты?
DCloud
📁 Testing Types
Есть ли опыт использования Testcontainers?
DCloud
📁 Тестирование ПО
Зачем нужны юнит-тесты?
Delivery
📁 Тестирование
Какие бывают виды тестов: unit, интеграционные и e2e?
Egar Technology
📁 Unit-тестирование и его аспекты
Что такое Cypress и Playwright и для чего они используются?
Egar Technology
📁 Unit-тестирование и его аспекты
Опишите, как вы писали тесты для хуков и логики с использованием Jest и React Testing Library
EnjoyPro
📁 Unit-тестирование и его аспекты
Как вы тестируете frontend компоненты?
ESoft
Что такое WireMock, для чего используется?
Eureka
📁 Redis Cache
Какие фреймворки для тестирования ты использовал?
Eureka
📁 Тестирование
Почему удобнее тестировать компонент, когда логика отделена от UI?
Facct
📁 Интерфейсы и типы в TS
Использовал ли Makita и можешь рассказать разницу между созданием mock и spy?
Firecode
📁 Код и исполнение
Какие виды тестирования знаешь?
Goroutine
📁 Testing Types
Какие тестирования используются?
Gorutin
📁 Тестирование ПО
Какие типы тестирования вы знаете и для чего используется каждый из них?
Hitch By Red_Mad_Robot
📁 Unit-тестирование и его аспекты
Какие тесты вы писали и какие виды тестирования знаете?
Huntit
📁 Unit-тестирование и его аспекты
Можешь чуть подробнее рассказать про тестирование? Приходится ли писать юнит и интеграционные тесты? Как происходит взаимодействие с тестировщиками?
IECD
📁 Тестирование
Расскажите о вашем опыте написания unit-тестов и других видов тестирования.
iFellow
📁 Unit-тестирование и его аспекты
Писали ли вы unit-тесты? Есть ли смысл тратить на это время?
iFellow
📁 Unit-тестирование и его аспекты
Писали ли вы тесты? Какой процесс использовали? (например, TDD)
Ittrain
📁 Unit-тестирование и его аспекты
Как заинжектировать Mock-объект с помощью Mockito?
Java | | 2 | Можно
📁 Объектно-ориентированное проектирование
Как ускорить долгое время тестирования в проекте?
Java Collections Framework
📁 Тестирование
Писал, не писал там юнит-тесты?
JOIN | | 7
📁 Тестирование
А с интеграционными тестами работал? Писал их?
JOIN | | 7
📁 Тестирование
В каких компонентах вы писали тесты и какие типы тестов использовали
Lada Цифра
📁 Unit-тестирование и его аспекты
Каков процент покрытия юнит-тестами, на каком этапе разработки?
Lendevo
📁 Тестирование
Кто пишет интеграционные тесты — разработчики или тестировщики?
Lendevo
📁 Тестирование
Какие типы тестов знаешь? Какие написал?
Lesta
📁 Testing Practices
Если тесты распределены по направлениям и хотим допустить только одно направление или группу, как реализовать?
Lesta
📁 Тестирование
Приходилось ли писать юнит-тесты?
Meeting
📁 Тестирование
Как проверить успешность работы кода (проверка вывода)?
Ozon
📁 Code Quality
Как обычно предполагаешь мокрить для тестов?
Ozon
📁 Testing Types
Что скажешь про тестовое покрытие метода CheckCoordinates?
Ozon
📁 Асинхронность и управление потоками
Что такое Metaspace, как определить, что он выставлен некорректно?
REST Client
📁 Тестирование
Как у вас устроено автоматизированное интеграционное тестирование?
RoboFinance
📁 Тестирование ПО
Писали ли вы тесты? Какие инструменты использовали, например Selenium?
SoftJet
📁 Unit-тестирование и его аспекты
На каком языке обычно пишут тесты?
SoftJet
📁 Unit-тестирование и его аспекты
Писали ли вы тесты? Кто их писал и какие библиотеки использовали?
Staff-IT
📁 Unit-тестирование и его аспекты
Какие виды тестирования вы знаете? Расскажите подробнее про unit и e2e тестирование
Unirest
📁 Unit-тестирование и его аспекты
Расскажи про тестирование: пирамиду тестирования, юнит, интеграционные, end-to-end тесты.
Unknown
📁 Тестирование
А есть ли у тебя какой-то опыт автоматизации тестирования?
Unknown
📁 Тестирование
Какие виды тестов существуют? Юнит и интеграционные?
Unknown
📁 Тестирование
Какие плюсы и минусы у юнит и интеграционных тестов?
Unknown
📁 Тестирование
Какие моменты необходимо описать в баге, чтобы сразу понять, где и куда зайти для его исправления?
Unknown
Приходилось ли работать с тестами?
Unknown
Расскажите, с чем на практике работали при написании unit-тестов? Используете ли вспомогательные инструменты? Какие есть библиотеки/фреймворки для тестирования?
Unknown
📁 Тестирование
Что вы знаете про unit тесты? Какие есть виды результатов тестирования?
Unknown
📁 Тестирование ПО
Что вы посоветуете начинающему разработчику по тестированию?
Unknown
📁 Тестирование
Использовали ли testcontainers и как накатывали данные перед тестами?
Unknown
📁 Тестирование ПО
Работал с тестированием? Писал юнит-тесты?
Unknown
📁 Тестирование
Как написать юнит-тест на функцию, которая читает из базы и считает среднее?
Unknown
📁 Методология проектирования
Чем отличаются модульное и интеграционное тестирование?
Unknown
📁 Тестирование ПО
Что такое endpoint-тестирование?
Unknown
📁 Тестирование ПО
Как с тестами? Какие фреймворки использовались, были ли unit-тесты?
Unknown
📁 Тестирование
Сколько контекстов загрузится при двух тестах с @SpringBootTest?
Unknown
📁 Программа вывод
Какие виды тестовых объектов бывают в JUnit? Чем они тестируются?
Unknown
📁 Testing Types
Ты писала юнит-тесты, end-to-end или интеграционные тесты?
Unknown
📁 Тестирование
Какой у вас гид флоу был? Сколько там контроллов было тогда? Тесты, а выконтры там?
Unknown
📁 Тестирование
Как ты видишь идеальный юнит-тест? Что будет покрывать всевозможную логику, выполнять этот метод?
Unknown
📁 Тестирование
Знаете ли вы концепции Blackbox и Whitebox тестирования?
Unknown
📁 Тестирование ПО
Если в тесте нужно заходить во внешний ресурс, который иногда недоступен или отвечает некорректно, что делать?
Unknown
📁 Тестирование
Писал ли тесты (юнит-тесты, интеграционные тесты)? Как у вас обычно происходило тестирование?
Unknown
📁 Тестирование
Что такое unit тестирование и unittest?
Unknown
📁 Тестирование
Какие тесты вы бы добавили в библиотеку компонентов?
Vk Workspace
📁 Unit-тестирование и его аспекты
Что такое unit тесты и зачем они нужны
Айкон Про
📁 Unit-тестирование и его аспекты
Писали ли вы тесты и в каких ситуациях это было необходимо?
Альфа-Банк
📁 Unit-тестирование и его аспекты
Использовали ли вы тестирование на проектах и какие инструменты применяли?
Ао Ниимэ
📁 Unit-тестирование и его аспекты
В чем отличие тестирования с помощью Cypress и Jest?
Афлт-Системс
📁 Unit-тестирование и его аспекты
Если после теста в проде что-то развалилось, как вы будете искать проблему?
Баланс
📁 Тестирование
Как тестируешь свой код?
БД | | 13
📁 Code Quality
Какие инструменты вы используете для тестирования?
Вендорteamf
📁 Unit-тестирование и его аспекты
Какие виды тестирования знаешь? Чем отличаются?
ВТБ
📁 Testing Types
Какие виды тестов реализовывал?
ВТБ
📁 Тестирование ПО
Как проводишь интеграционные тесты?
ВТБ
📁 Тестирование ПО
Если писал тесты, то на каких инструментах или фреймворках?
Группа Астра
📁 Unit-тестирование и его аспекты
Какие инструменты ты использовал для написания тестов?
Демиус
📁 Тестирование
Писали ли юнит и интеграционные тесты?
Джава
📁 Тестирование
Как у вас реализованы интеграционные тесты? Запускаются ли они с использованием in-memory БД?
Джава
📁 Тестирование
Как у вас построена разработка: пишете тесты, как происходит проверка?
Джава
📁 Тестирование
В чем отличие методов test и match в работе с регулярными выражениями?
Домклие
📁 Unit-тестирование и его аспекты
Какие типы тестов вы писали на предыдущих проектах?
Домклик
📁 Unit-тестирование и его аспекты
Как вы поступите, если нужно быстро написать большой тест за полчаса?
Домклик
📁 Unit-тестирование и его аспекты
Что такое E2E тесты и как их применять?
Домклик
📁 Unit-тестирование и его аспекты
Какой стек тестирования использовал? (Jest, React Testing Library)
КвинсДевелопмент
Писали ли вы тесты? Какие именно: юнит-тесты, функциональные тесты? Покрывали ли вы функции тестами?
КвинсДевелопмент
Как вы тестировали компоненты в UIkit?
Компэл
📁 Unit-тестирование и его аспекты
Делали ли вы интернационализацию на проекте? Если да, то как? Пользовались ли ICU форматом?
Компэл
📁 Unit-тестирование и его аспекты
Зачем нужны юнит и интеграционные тесты?
Магнит
📁 Тестирование ПО
Как у вас организован контроль качества — ревью, тестирование?
Название Конкретно Не Указано, Но Упомянут "сетевой Компании" И "novosoft" В Контексте Проектов.
📁 Тестирование
Какие виды тестирования используете? Юнит, функциональное? Есть ли интеграционные тесты?
Приложение «пятерочка», Раздел Доставки
📁 Тестирование ПО
Как отлавливать ошибки в приложении?
Ренессанс Страхование
📁 Нет темы
Как реализуются тесты в проекте? (юнит-тесты, end-to-end, мокинг)
Российская, лидер на рынке кибербезопасности в России.
📁 Тестирование
Какие требования к покрытию тестами функциональности у вас?
Российская, лидер на рынке кибербезопасности в России.
📁 Тестирование
Как у вас устроено тестирование? Какие виды тестов писали?
Самокат и группа компаний
📁 Testing Types
Есть ли в вашей компании отдельная команда, которая занимается написанием автотестов?
Сбер
Есть ли у вас требования к покрытию тестами? Какой минимум покрытия вы считаете приемлемым?

Какие объекты рекомендуется заменять моками в тестах?
Сбер
📁 Объектно-ориентированное проектирование
В приложении много тестов, как разделить их по классам, чтобы контекст поднимался один раз?
Сбер
📁 Программа вывод
Чем отличается функциональный тест от интеграционного?
Сбер
📁 Тестирование ПО
Подключали ли базы данных в юнит-тестах? Как это организовано?
Сбер
📁 Тестирование
Какие виды тестов пишете? Обязательное ли покрытие?
Сбер
📁 Testing Types
Какие тесты вы писали и какие инструменты для тестирования использовали?
Сбер
📁 Unit-тестирование и его аспекты
Что такое snapshot тесты в React с использованием Jest и react-testing-library?
Сбер
📁 Unit-тестирование и его аспекты
Что у класса можно протестировать?
Сбер
📁 Unit-тестирование и его аспекты
Можно ли тестировать геттеры и сеттеры?
Сбер
📁 Unit-тестирование и его аспекты
Какие тесты вы писали на проекте и какое было покрытие?
Сбер
📁 Unit-тестирование и его аспекты
Опишите процесс тестирования на проекте: как тесты создавались и передавались тестировщику
Сбер
📁 Unit-тестирование и его аспекты
Как вы относитесь к написанию тестов и их роли в разработке?
Сбер
📁 Unit-тестирование и его аспекты
Какие объекты рекомендуется заменять моками?
Сбер
📁 Управление памятью
Использовали ли вы stab-файлы (заглушки)?
Сбер
📁 File Upload Strategies
Писали ли вы unit-тесты? Какой объем покрытия? Какой тип тестирования использовали?
Сбер
📁 Тестирование
Использовали ли браузерное тестирование фронтенда?
Сбер
📁 Тестирование
Чем именно занимаетесь в сфере автоматического тестирования?
Сима
📁 Тестирование ПО
А ты делал нагрузочные тестирования?
Собес2
📁 Тестирование ПО
Какие интересные тестовые кейсы можно составить для задачи выбора четырёх элементов массива с равными суммами?
Т-Банк
📁 Числовые задачи массива
Ты писал юнит, интеграционные и e2e тесты? Расскажи про них.
Тинькофф
📁 Тестирование
Если бы у тебя на работе надо было написать такую функцию, какими бы тестами ты ее покрыл, чтобы был уверен, что код можно...
Тинькофф
📁 Код и исполнение
Использовали ли автофикстуры в тестах?
Точка
📁 Work Tools
В чем заключались технические улучшения при добавлении Jest и React Testing Library в проект?
Транснефть
📁 Unit-тестирование и его аспекты
Какой способ оптимизации тестового задания (по памяти и времени) вы применяли?
Уральская Сталь
📁 Тестирование ПО
Какие преимущества дает использование стейтменеджеров при тестировании?
ФАККТ
📁 Unit-тестирование и его аспекты
Покрываешь ли код тестами?
Федеральная, Ранее Государственная, Перешла В Коммерческую Собственность 4 Года Назад.
📁 Code Quality
Приходилось ли писать свои валидаторы?
Чём
📁 Тестирование
Как устроен проект с тестами? Как организовать файлы тестов?
Элисофт
📁 Тестирование
Какие есть рекомендации для написания кода, чтобы он хорошо тестировался?
Элисофт
📁 Code Quality
Как запускаются тесты — параллельно или последовательно?
Элисофт
📁 Тестирование
Какой конвеншн по неймингу тестов вы знаете?
Элисофт
📁 Тестирование
Какие методы используются в Selenium для открытия браузера и перехода на страницу?
Яблоко»
📁 Асинхронные API и Кэширование
Где начинаются проверки: на машине или в контейнере?
Яндекс
📁 Unit-тестирование и его аспекты
Когда происходит сборка PROD, DEV и TEST стендов?
Яндекс
📁 Unit-тестирование и его аспекты
Какие виды тестов вы знаете? Какие тесты вы бы внедрили в этот проект?
Яндекс
📁 Unit-тестирование и его аспекты
Пишете ли вы юнит-тесты в своем проекте?
Яндекс
📁 Unit-тестирование и его аспекты
Когда вы бы хотели, чтобы тесты запускались в процессе CI/CD?
Яндекс
📁 Unit-тестирование и его аспекты
Почему тесты могут быть нестабильными? Какие тесты чаще всего нестабильны?
Яндекс
📁 Unit-тестирование и его аспекты
Приходилось ли тебе дорабатывать тесты на проекте? Если да, то какие именно?
Яндекс
📁 Unit-тестирование и его аспекты
Какие проверки запускаются при релизе?
Яндекс
📁 Unit-тестирование и его аспекты
Какие виды тестирования вы выполняли в проекте и какие инструменты для этого использовали?
Яндекс
📁 Unit-тестирование и его аспекты
Как бы вы организовали тестирование данного сервиса?
Яндекс
📁 Unit-тестирование и его аспекты
Какие тесты вы бы предложили для интерфейса Яндекс.Путешествия? Расскажите про пирамиду тестирования (Unit тесты, интеграционные тесты, e2e) и приведите по 2-3 примера на каждый вид.
Яндекс
📁 Unit-тестирование и его аспекты
Как принималось решение о покрытии тестами в ваших проектах?
Яндекс
📁 Unit-тестирование и его аспекты
Как вы проводите тестирование в проектах?
Яндекс
📁 Unit-тестирование и его аспекты
Говорили про e2e тесты. Какие бы вы добавили и почему?
Яндекс
📁 Unit-тестирование и его аспекты
Задача на тестирование: объяснить какие тесты внедрил бы и какие виды тестов сделал
Яндекс
📁 Unit-тестирование и его аспекты
Были ли тесты на проекте, если да, то какие?
Яндекс
📁 Unit-тестирование и его аспекты
Какие тесты писали для компонентов? Юнит-тесты, скриншотные тесты?
Яндекс
📁 Unit-тестирование и его аспекты
Как тестировали пакеты перед публикацией? Запускали линтеры и юнит-тесты в CI?
Яндекс
📁 Unit-тестирование и его аспекты
Почему выбрали Cypress для тестирования, а не Playwright? Что понравилось и не понравилось?
Яндекс
📁 Unit-тестирование и его аспекты
Как настраивали моки для API в тестах? Дописывали ли кастомные команды?
Яндекс
📁 Unit-тестирование и его аспекты
