Какие существуют бандлеры и их особенности?
65Apps
📁 Функциональный JS & Web API
Какие методы и инструменты можно использовать для оптимизации размера и производительности JavaScript-бандла в веб-приложениях?
65Apps
📁 Способы оптимизации
Какие линтеры и форматировщики вы использовали?
AmoCRM
📁 Нет темы
С какими проблемами сталкивались при билде на Turbopack, например с next/image?
Igaming
📁 Webpack и его компоненты
Какие функции выполняет Babel?
Kedoo
📁 Нет темы
Какие проблемы возникают при передаче env-переменных в Next.js, из-за которых не генерится SSG?
Sky Capital
📁 Next.js и Three.js интервью
Как webpack определяет, какую часть кода нужно вынести в отдельный чанк?
Softnetix
📁 Webpack и его компоненты
Какие линтеры вы знаете и используете?
Unirest
📁 Хуки и замыкания
Расскажи про процесс сборки бандла в фронтенд-проектах
Ай-Теко
📁 Хуки и замыкания
Какие инструменты для проверки кода используются (flake8, mypy и т.д.)?
Актив Газпром Медиахолдинг
📁 Code Quality
Используете ли автоформатирование кода?
Актив Газпром Медиахолдинг
📁 Code Quality
Настраивали ли вы сборку проекта с помощью Webpack?
АФЛТ
Что такое Tree Shaking в контексте современных JavaScript сборщиков и как он помогает уменьшить размер итогового бандла?
Аэроклуб
📁 Нет темы
Каковы различия между ESLint и Prettier, и как эти инструменты дополняют друг друга в процессе обеспечения качества кода?
Домклик
📁 Нет темы
Является ли Module Federation встроенным функционалом Webpack?
Иннотех
📁 Нет темы
В какие форматы файлов преобразует Webpack?
Иннотех
📁 Webpack и его компоненты
Расскажите подробнее про commit conventions?
Название Конкретно Не Указано, Но Упомянут "сетевой Компании" И "novosoft" В Контексте Проектов.
📁 Транзакции
Плюсы и минусы Webpack и Vite, в чем особенности Vite
Омнитек
📁 Сравнение сборщиков Vite и Webpack
Объясните, как работает React.lazy и как это влияет на бандлы в webpack.
Ооо Айти Фаундейшн
📁 Нет темы
Какие средства контроля кода, статического анализа использовали?
Как работают лоадеры в webpack и можно ли написать свой собственный лоадер?
Согаз
📁 Webpack и его компоненты
Как настроить webpack для нескольких точек входа?
Согаз
📁 Webpack и его компоненты
Ты говорил, что правили конфиг webpack для Cypress. Зачем? Какой баг фиксили?
Яндекс
📁 Нет темы
Был ли у вас опыт настройки линтеров и конфигурационных файлов? Опишите его.
Argo Studio
📁 Библиотеки и графики
Расскажите о том, как работает webpack и какие основные возможности он предоставляет для сборки и оптимизации фронтенд-приложений.
ATI.su
📁 Webpack и его компоненты
Что такое webpack и как он используется для сборки проектов?
BI.Zone
📁 Webpack и его компоненты
Что такое плагины в контексте webpack и как их использовать?
BI.Zone
📁 Webpack и его компоненты
Объясните назначение и работу ESLint.
BI.Zone
📁 Опыт работы во фронтенде
Что такое Vite и в чем его преимущества по сравнению с другими сборщиками?
BI.Zone
📁 Функциональный JS & Web API
Что такое Webpack и как вы его используете?
Broniboy Тех Скриннинг
📁 Webpack и его компоненты
Как JSX влияет на процесс промо-сборки?
Clipchamp
Что такое tree shaking в webpack и как он работает?
Evapps
Зачем нужен Babel и какую роль он выполняет в процессе разработки?
F6 Кибербезопасность
📁 Функциональный JS & Web API
Для чего нужен webpack и как он работает?
F6 - Команда Кибербезопасности
📁 Webpack и его компоненты
Как настроить webpack для повышения скорости сборки, приближая её к Vite?
F6 - Команда Кибербезопасности
📁 Сравнение сборщиков Vite и Webpack
Является ли формат .webm оптимальным для сборки видео на бэкенде?
GhostBusters
📁 Сравнение сборщиков Vite и Webpack
Сравните Vite и Webpack. Какой у вас опыт работы с Webpack?
Glowbyte
📁 Сравнение сборщиков Vite и Webpack
Какие сборщики вы знаете, что они делают и зачем нужны?
Glowbyte
📁 Хуки и замыкания
Почему vite работает быстрее, чем webpack?
Glowbyte
📁 Сравнение сборщиков Vite и Webpack
Что такое линтеры? Настраивал ли ты линтеры?
Какие методы для поиска проблем в коде ты знаешь?
Goroutine
📁 Code Quality
Работал с поисковыми индексерами типа Elasticsearch?
Hub
📁 Поиск и структуры данных
Можно ли в Vite сделать тонкую настройку, аналогичную настройкам в Webpack?
iFellow
📁 Webpack и его компоненты
Настраивали webpack, разбираетесь в его конфигурации?
Kedoo
📁 Веб-технологии и доступность
Как оптимизировать загрузку большого JavaScript файла?
Kedoo
📁 Оптимизация скорости загрузки
Для чего нужны Loaders в Webpack?
Mozen
📁 Webpack и его компоненты
В чем разница между Webpack и Vite?
Mozen
📁 Сравнение сборщиков Vite и Webpack
Как объединить несколько коммитов в один (squash) в git?
Prooftech IT
📁 Командная работа и взаимодействие
Как пробрасывать переменные из env в Vite?
Queen Games
📁 Типы и перечисления
Расскажите о вашем опыте работы с Webpack: как вы настраивали конфигурацию и оптимизировали сборку фронтенд-приложений?
Trendtech
📁 Веб-технологии и доступность
Какие плагины для eslint и babel вам приходилось писать?
Unirest
📁 Нет темы
Назови плагины Webpack для работы со стилями.
Unisender
📁 Webpack и его компоненты
Скажи, пожалуйста, есть ли у тебя какой-то опыт работы с curl?
Unknown
📁 Коммуникация
А скажи, пожалуйста, с коллекциями в Postman не приходилось работать?
Unknown
📁 Коммуникация
А что такое Collection Runner?
Unknown
📁 Garbage Collection
Есть ли у вас опыт работы с инструментами сборки проектов, такими как Webpack?
Unknown
Как происходит у вас процесс отладки? Какими механизмами и подходами пользуетесь?
Unknown
📁 Software Development Process
Какими тулзами пользуетесь для проверки кодстайла, линтинга, типизации, безопасности написанного кода?
Unknown
📁 Code Quality
Наш сборщик подставляет данные из переменных куда? В билд?
Unknown
📁 Garbage Collection
Какой сборщик выбрать — webpack или vite и почему?
Объясните основные сущности в webpack.
Wildberries
📁 Webpack и его компоненты
Зачем нужны сборщики модулей, такие как webpack?
Yadro Тераплан
📁 Webpack и его компоненты
Расскажите о вашем опыте настройки линтеров в JavaScript проектах и как они помогают поддерживать качество кода?
Ай-Теко
📁 Дейли взаимодействия и релизы
Сравните Vite, Webpack и Turbopack.
БКХ Еком
📁 Сравнение сборщиков Vite и Webpack
Сравните eslint/prettier и biome.
БКХ Еком
📁 Нет темы
В чём основные отличия между сборщиками Vite и Webpack, и какие преимущества каждый из них предлагает для разработки фронтенда?
Объясни процесс сборки бандла в современных фронтенд-проектах
Что вы предпочитаете для сборки фронтенда: Vite или Webpack? Почему?
Какую ключевую роль выполняет Webpack?
Если сделаете из Postman запрос, что будет?
Используете ли на проекте линтеры? Делали ли сами конфиги или использовали базовую настройку? Писали ли свои правила?
Для чего нужен Webpack и какие аналоги вы знаете?
Какие варианты улучшения кода с boolean-возвратом и линтерами вы знаете?
Что такое бандл и чем он отличается от чанков в сборке проектов
Какие типы хэшей используются в Webpack?
Объясните основные концепции Webpack
Какие существуют бандлеры и зачем они нужны в процессе разработки?
Что такое DevServer и для чего он используется?
Что такое source map в JavaScript и как он помогает при отладке скомпилированного или минифицированного кода?
Какие инструменты для анализа бандлов вы используете?
Что такое Babel в экосистеме JavaScript и как он помогает преобразовывать современный код в совместимый с разными браузерами?
Расскажите про webpack и module federation.
Работали ли вы с webpack? Опишите ваш опыт и задачи, которые решали с его помощью
В чём отличие webpack и vite, с чем вы работали?
Что такое секция external в конфигурации webpack?
Как сборка бандла влияет на скорость работы приложения?
Какие методы оптимизации сборки вы знаете?
Как устроен процесс билда в JavaScript проектах и какие инструменты обычно используются для сборки и оптимизации кода?
Какие стадии включает билд фронтенда?
Настраивали ли вы сборщики, такие как Webpack или Vite? Опишите ваш опыт.
Как делили общие конфиги между проектами? Например, Babel или ESLint-настройки.
