В чем отличие между visibility: hidden и display: none? Какие стадии отрисовки страницы они затрагивают?
Argo Studio
📁 Нет темы
В чем отличия viewport-единиц от процентов в CSS?
Bell Integrator
📁 Нет темы
В чем разница между CSS-селекторами :nth-child и :nth-of-type?
Bell Integrator
📁 Типы данных и селекторы
Что такое CSS-псевдокласс :focus-within?
BI.Zone
📁 Области видимости и фокус
Что такое display: inline-block и как он влияет на элементы вёрстки?
Boomerang
📁 Свойства отображения элементов
Чем отличаются форматы SVG и JPEG?
Clipchamp
Что можно реализовать через CSS?
Clipchamp
Какую дизайн-систему вы использовали в проектах?
Diasoft
📁 Паттерны проектирования
Что такое stacking context в CSS, как он формируется и как влияет на порядок наложения элементов на странице?
DigitalSail
Что такое свойство box-sizing в CSS?
Digital Sector
📁 Специфичность CSS селекторов
Можешь назвать свойства CSS, связанные с позиционированием элементов?
Garage
Как была реализована проверка размеров прикрепленных файлов?
Glowbyte
📁 Свойства отображения элементов
Что такое поток документа и как на него влияет CSS-свойство position?
HolyWeb
📁 Нет темы
Какие значения свойства display в CSS вы знаете?
iFellow
📁 Свойства отображения элементов
Чем отличается единица измерения rem от em в CSS?
iFellow
📁 Нет темы
Что такое единицы измерения rem и em в CSS?
iFellow
📁 Нет темы
Объясните свойства CSS position и их влияние на расположение элементов
Itsports
📁 Специфичность CSS селекторов
В чем разница между тегами ol и ul?
Itsports
📁 Дескрипторы и элементы HTML
Что такое вендорные префиксы в CSS?
Kedoo
📁 Функциональный JS & Web API
Перечислите типы свойства display и объясните их различия
Lofty
Объясните понятия специфичности CSS и селектора с нулевой специфичностью.
Lofty
📁 Дескрипторы и элементы HTML
В чем разница между CSS-переменными и препроцессорными переменными (например, SASS)?
Loyalty
Отобразите список товаров по 4 карточки в ряд на экранах шире 768px
Melon Fashion Group
📁 Свойства отображения элементов
Как показать, что какой-то элемент более важный, чем все остальные?
Middle
📁 Message Brokers
Расскажите о главных различиях между HTML4 и HTML5, включая семантику и доступность (accessibility).
mos.ru
📁 Семантика HTML и HTML5
Какого цвета будет ссылка согласно заданным стилям?
Petshop
📁 Генерация HEX цветов
Почему CSS лучше, чем CSS-in-JS?
Polydev
📁 Специфичность CSS селекторов
Приоритет CSS-селекторов в числовых значениях
Prooftech IT
📁 Нет темы
Какими способами можно выровнять элемент по центру? Приведите примеры.
Prooftech IT
📁 Центрирование элементов
Какие есть способы отобразить текст в одну строку, кроме display:inline-block?
Pyrus
📁 Свойства отображения элементов
Как правильно подключить шрифты в веб-проекте?
Quantum Art
📁 Стилизация компонентов
Для чего нужен CSS-свойство will-change?
Queen Games
📁 Специфичность CSS селекторов
Что такое Z-INDEX и контекст наложения в CSS?
Right Line
📁 Нет темы
Что такое Code splitting для CSS и как он работает?
Sky Capital
📁 Специфичность CSS селекторов
Какие семантические теги лучше использовать для аккордеона вместо div?
Sminex
Чем свойство translate отличается от translate3D в CSS?
Soft Media Group
📁 Программирование и зависимости
Как лучше расположить кнопки: вертикально или горизонтально?
Tildi
Какие технологии применяются для написания стилей в ваших проектах?
Unirest
📁 Стилизация компонентов
Если у контейнера используется display: flex, относительно чего происходит выравнивание при align-items: center?
Unirest
📁 Сравнение Grid и Flexbox
Для чего нужно свойство flex-grow в Flexbox?
Unirest
📁 Сравнение Grid и Flexbox
Что такое BEM и для чего он используется в верстке?
Unisender
📁 Функциональный JS & Web API
Если мы должны разработать веб-приложение с использованием CSS Grid, что мы должны иметь в виду? Как мы можем располагать элементы на странице?
Unknown
Объясните основные функции CSS Grid и сравните его с Flexbox.
Unknown
Что такое семантическая верстка и для чего она нужна?
Wanted
📁 Семантическая верстка
Float, flex, grid — что выберешь и почему?
Wanted
📁 Сравнение Grid и Flexbox
Для чего нужна табличная верстка, например, для email писем?
Wanted
📁 Нет темы
Приходилось ли вам работать с версткой для right-to-left языков? Как вы это реализовывали?
Wanted
📁 Опыт работы во фронтенде
Какие существуют подходы к кроссбраузерной верстке?
Айкон Про
📁 Адаптивная верстка и методы
Объясните принцип работы CSS-свойства z-index
Актион
📁 Нет темы
Как элемент div представлен в DOM?
Алабуга
📁 Нет темы
Расскажите про CSS-функции и их применение.
Алабуга
📁 Специфичность CSS селекторов
Каковы преимущества использования Bootstrap?
Алабуга
📁 Webpack и его компоненты
Почему максимальный z-index может не работать?
Альфа-Банк
📁 Нет темы
Как добиться, чтобы не ждать загрузки шрифта (использование font-display: swap)?
Альфа-Банк
📁 Нет темы
В чем разница между блочными и строчными элементами в HTML/CSS?
Альфа-Банк
📁 Дескрипторы и элементы HTML
Как с помощью свойства float сделать элемент слева или справа, чтобы остальные элементы обтекали его?
Альфа-Банк
📁 Центрирование элементов
Что делает CSS-свойство contain и как оно влияет на производительность и рендеринг?
Альфа-Банк
📁 Специфичность CSS селекторов
Расскажите про изоляцию стилей в CSS и способы её достижения.
Антара
📁 Стилизация компонентов
Как можно убрать или скрыть блок на веб-странице с помощью CSS или JavaScript?
Газпром Медиа
📁 Отрисовка страниц в браузере
Что такое специфичность селектора в CSS и как она работает?
Газпром Медиа
📁 Специфичность CSS селекторов

Объясните понятие специфичности в CSS и как она влияет на стили
Гарда
📁 Специфичность CSS селекторов
Сравните Grid и Flexbox: когда и для чего лучше использовать каждый из них
Гарда
📁 Сравнение Grid и Flexbox
Через какие свойства работаем с маркерами списков
Домклие
📁 Нет темы
Как вы проверяете pixel perfect вёрстку?
Домклик
📁 Свойства отображения элементов
Каковы ваши впечатления от использования Tailwind CSS?
Домклик
📁 Нет темы
Как работает свойство grid-template-columns в CSS Grid?
Домклик
📁 Сравнение Grid и Flexbox
В чем разница между display: block, inline-block и inline?
Домклик
📁 Свойства отображения элементов
Какие методы или инструменты для стилизации вы используете?
Иннотех
📁 Стилизация компонентов
Почему не рекомендуется использовать ID или теги в CSS для стилизации?
Исходный
Сколько заголовков h1 допустимо на странице с точки зрения SEO?
Исходный
Что такое специфичность CSS-селекторов, для чего она нужна и какие есть рекомендации по использованию селекторов?
Исходный
Знаком ли с адаптивной версткой?
Контур
📁 Адаптивная верстка и методы
Как достигаешь pixel perfect вёрстки?
Корпорация Элар
📁 Свойства отображения элементов
Объясните цепочку then в промисах
Ланит Би Пи Эм
📁 Адаптивная верстка и методы
Перечислите и опишите виды позиционирования в CSS: static, relative, absolute, fixed, sticky.
Маквес
📁 Специфичность CSS селекторов
В чем различия между единицами измерения em и rem в CSS?
Маквес
📁 Нет темы
Какие есть значения свойства position в CSS? Как сделать так, чтобы элемент с position: absolute был отцентрирован и растянут на всю ширину родительского блока?
Мостранспорт
📁 Специфичность CSS селекторов
Какие UI-компоненты вы верстали? Опишите ваш опыт.
Омнитек
📁 UI Kit и его особенности
Для чего используется Tailwind CSS и какие преимущества он предоставляет?
Онлайн Решения
📁 Специфичность CSS селекторов
Какие форматы медиафайлов (PNG, JPEG, GIF и др.) поддерживаются для прикрепления в input, и что произойдет при
Как во flex сделать так, чтобы блоки не переносились на новую строку (использование nowrap)?
Петрович-Тех
📁 Сравнение Grid и Flexbox
Что делает CSS reset и как он помогает устранить различия в стилях по умолчанию между разными браузерами?
Петрович-Тех
📁 Специфичность CSS селекторов
Что такое CSS normalize и как этот подход улучшает согласованность отображения элементов в разных браузерах?
Петрович-Тех
📁 Специфичность CSS селекторов
В чем разница между reset и normalize CSS? С каким из них вы работали?
Поле.рф
📁 Специфичность CSS селекторов
Как подключить CSS к HTML-документу?
Российский Университет Дружбы Народов
📁 Специфичность CSS селекторов
Какие плюсы и минусы у используемых вами стилей (например CSS-in-JS)?
Сбер
Flex vs Grid: когда использовать каждый из них?
Сбер
📁 Сравнение Grid и Flexbox
Как сделать разную тему у сайта через чистый CSS?
Сбер
📁 Специфичность CSS селекторов
Как на CSS сделать фигуру: в квадрат должны быть вписаны четыре треугольника с общей вершиной в центре?
Сбер
📁 Специфичность CSS селекторов
Какие свойства display в CSS вы знаете?
Сбер
📁 Специфичность CSS селекторов
Что такое семантическое версионирование (SemVer)?
Сбер
📁 Семантическая верстка
Объясните приоритеты CSS-селекторов.
Сбер
📁 Специфичность CSS селекторов
Что такое спрайты в веб-разработке?
Сбер
📁 Веб-технологии и доступность
Чем отличаются margin от padding
Сбер
📁 Свойства отображения элементов
Почему после изменения CSS не изменился цвет элемента
Северсталь
📁 Специфичность CSS селекторов
Как реализовать пагинацию на фронтенде? Опишите подробно
Стрим Лабс
📁 Адаптивная верстка и методы
У нас есть тег span, как не меняя его свойства display поменять высоту спана?
Транснефть
📁 Свойства отображения элементов
Что такое специфичность (вес) CSS-селекторов и как она влияет на применение стилей в веб-страницах?
Транснефть
📁 Нет темы
CSS задача: убрать маркеры и отступы у ul и html body, добавить бордер для li, затем растянуть ul на всю высоту экрана
Транснефть
📁 Специфичность CSS селекторов
Задача на верстку: покрасьте каждый второй абзац внутри элемента с id="a" в красный цвет и все h2 с классом "bbb" внутри элемента с классом "fff" в синий цвет
Финам
Сброс стилей и нормализация стилей — одно и то же или разные вещи?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Что такое адаптивная верстка и как её реализовать?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Препроцессоры, зачем и какие плюсы
Центральный Банк Рф
📁 Нет темы
Приведите примеры блочных и строчных HTML-тегов и объясните, в чём их отличие.
Эремейч Рус
📁 Дескрипторы и элементы HTML
Какие виды position существуют в CSS?
Эремейч Рус
📁 Специфичность CSS селекторов
Объясните разницу между relative и absolute позиционированием в CSS
Эремейч Рус
📁 Свойства позиционирования
Что такое семантическая верстка и какие HTML-теги используются для её реализации?
Юспи Групп
📁 Семантическая верстка
Что такое CSS reset и normalize, в чем их отличие?
Юспи Групп
📁 Специфичность CSS селекторов
В чем разница между class и id в HTML/CSS?
65Apps
📁 Интерфейсы и типы в TS
Как сделать так, чтобы при нажатии на ссылку скачивался файл? И как сделать, чтобы при переходе по URL файл скачивался автоматически?
Angie
📁 Свойства отображения элементов
Какие ещё CSS правила затрагивают изменение layout?
Argo Studio
📁 Специфичность CSS селекторов
Расскажите про aria-атрибуты и data-* атрибуты в HTML.
Bell Integrator
📁 Типы данных и селекторы
Зачем использовать семантическую верстку? Назовите теги семантической верстки.
Bell Integrator
📁 Семантическая верстка
Рассказать про тег picture, как его использовать
Bell Integrator
📁 Свойства отображения элементов
Объясните специфичность селекторов в CSS
Bell Integrator
📁 Специфичность CSS селекторов
Псевдоклассы и псевдоэлементы: что это такое и в чем их отличия?
Bell Integrator
📁 Псевдоклассы и классы
В чем разница между псевдоклассами :focus и :active?
Bell Integrator
📁 Области видимости и фокус
Назовите значения свойства display и их отличия. Как влияет padding у inline и inline-block элементов?
Bell Integrator
📁 Свойства отображения элементов
Что такое CSS свойство box-sizing, какие значения оно принимает и как влияет на расчет размеров элементов?
Bell Integrator
📁 Свойства отображения элементов
Может ли paint произойти без layout? Может ли layout произойти без paint? Объясните взаимосвязь.
Bell Integrator
📁 Нет темы
Что такое семантическая верстка?
BetBoom
📁 Семантическая верстка
Как правильно обернуть два HTML-элемента, находящихся на одном уровне?
BetBoom
📁 Семантика HTML и HTML5
Зачем нужны псевдоэлементы в CSS?
BI.Zone
📁 Специфичность CSS селекторов
Какие существуют значения CSS свойства display и как они влияют на отображение элементов на веб-странице?
Boomerang
📁 Свойства отображения элементов
Чем отличается позиционирование sticky от fixed в CSS?
Boomerang
📁 Свойства позиционирования
Какие есть способы получить HTML-элемент, включая использование ref с передачей колбэка?
Boomerang
📁 Семантика HTML и HTML5
Сравните CSS Flexbox и CSS Grid: основные отличия и случаи использования
Caltat
📁 Сравнение Grid и Flexbox
Какие основные преимущества использования Bootstrap для быстрой и адаптивной верстки веб-интерфейсов?
Clipchamp
Что такое Bootstrap и как этот CSS-фреймворк помогает ускорить разработку адаптивных веб-интерфейсов?
Clipchamp
Что такое CSS-in-JS и каковы его преимущества и недостатки?
Cosysoft
📁 Специфичность CSS селекторов
Какие библиотеки для стилизации использовали, расскажите про css-modules
Datanomica
📁 Специфичность CSS селекторов
Почему элемент с z-index 5 может перекрывать элемент с z-index 10, если z-index отработал корректно?
DigitalSail
Как ты понимаешь термин «семантика DOM элементов»?
DigitalSail
Чем отличается display от visibility: hidden?
DigitalSail
В чем разница между flexbox и grid в CSS?
Digital Sector
📁 Сравнение Grid и Flexbox
Как стилизовать чекбоксы в CSS?
Digital Sector
📁 Стилизация компонентов
В чем отличия между display: none, opacity и visibility: hidden?
Digital Sector
📁 Нет темы
Как отцентрировать div элемент на странице?
Digital Sector
📁 Нет темы
В чем разница между display: none и opacity?
Digital Sector
📁 Нет темы
Сверстать нянкэт с позиционированием элементов
Dogma

Что такое селекторы в CSS и как они используются?
Egar Technology
📁 Специфичность CSS селекторов
Для чего используется селектор * {} в CSS?
Egar Technology
📁 Специфичность CSS селекторов
Как встроить одну страницу в другую с помощью iframe?
F6 - Команда Кибербезопасности
📁 Нет темы
Что такое свойство flex-basis в CSS и как оно влияет на размер гибкого элемента в flex-контейнере?
Fatzoom
📁 Сравнение Grid и Flexbox
Что такое BEM, опиши своими словами
Funbox
📁 Функциональный JS & Web API
Объясните разницу между flex и grid, где и что вы использовали
Funbox
📁 Сравнение Grid и Flexbox
Что делает атрибут srcset у тега img?
Garage
Какие существуют способы изоляции стилей (Styled Components, CSS Modules) и их преимущества?
Glowbyte
📁 Специфичность CSS селекторов
Какие существуют методы написания стилей в React?
Glowbyte
📁 Стилизация компонентов
Что такое модульные стили в веб-разработке и как они помогают управлять CSS для предотвращения конфликтов и улучшения поддержки кода?
Glowbyte
📁 Стилизация компонентов
Как браузер обрабатывает scss/sass файлы и кто их компилирует?
Glowbyte
📁 Технологии веб-разработки
Вижу опыт с CSS-in-JS, расскажите, как еще вы писали стили?
iFellow
📁 Специфичность CSS селекторов
Объясните разницу между единицами измерения rem и em.
iFellow
📁 Нет темы
Как центрировать элемент по вертикали?
iFellow
📁 Центрирование элементов
Какие способы организации CSS-кода приходилось использовать?
iFellow
📁 Специфичность CSS селекторов
Какие существуют способы позиционирования элемента по горизонтали и вертикали в CSS?
iFellow
📁 Центрирование элементов
Какие существуют способы отцентрировать блок?
iFellow
📁 Центрирование элементов
Может ли элемент с меньшим z-index перекрыть элемент с большим z-index?
iFellow
📁 Нет темы
Какие методы адаптивной верстки вы знаете?
iFellow
📁 Адаптивная верстка и методы
Теоретическая задача: есть шапка (header), слева логотип, справа кнопка. Как сдвинуть кнопку вправо? Ответ: 1) хедеру сделать display: flex, justify-content: space-between 2) кнопке margin-left: auto;
iFellow


Как центрировать блок с помощью CSS? Опишите разные способы
Itsports
📁 Специфичность CSS селекторов
Задача на стилизацию: используя CSS, расположите блоки div.container с вложенными div.gray, div.blue и div.red согласно образцу, применяя flex или grid.
Kaspersky
📁 Специфичность CSS селекторов
Нарисуйте флаг с использованием CSS Grid
Kaspersky
📁 Сравнение Grid и Flexbox
Какие существуют способы организации CSS в проекте?
Lofty
📁 Специфичность CSS селекторов
Как семантически создать popup?
Loyalty
Что такое Tailwind CSS и как в нем реализовать темную тему?
Loyalty
Какие преимущества у CSS-модулей?
Loyalty
Для экранов шириной ниже 768px выводите список товаров по 1 карточке в ряд
Melon Fashion Group
📁 Свойства отображения элементов
Как реализовать увеличение изображения товара при наведении в рамках контейнера
Melon Fashion Group
📁 Свойства отображения элементов
Как реализовать подчеркивание текста товара при наведении и изменение цвета текста при клике
Melon Fashion Group
📁 Генерация HEX цветов
Какие существуют способы центрирования элементов в CSS?
Mobile Up Mts Тех Скриннинг
📁 Специфичность CSS селекторов
Перечислите теги семантической верстки и их назначение
Mobile Up Mts Тех Скриннинг
📁 Семантическая верстка
Отличия HTML5 от HTML предыдущих стандартов
mos.ru
📁 Семантика HTML и HTML5
Как работает z-index и какие есть крайние случаи? Например, когда дочерний z-index 3, а родительский 1, почему дочерний всё равно унаследует родительский 1?
mos.ru
📁 Нет темы
Виды дизайна: адаптивный и отзывчивый. В чем их разница?
Nexign
📁 Паттерны проектирования
Какие HTML-теги следует использовать для интерактивных элементов согласно макету дизайнера?
Petshop
📁 Нет темы
Как сверстать данный список с помощью CSS?
Petshop
📁 Специфичность CSS селекторов
Вычислить количество пикселей, равное 240 (уточнить контекст задачи).
Petshop
📁 Свойства отображения элементов
Какие CSS-селекторы вы знаете?
Prooftech IT
📁 Хуки и замыкания
Что такое медиазапросы и для чего они применяются?
Prooftech IT
📁 Специфичность CSS селекторов
Для чего используются CSS-переменные? Приведите примеры нестандартного применения.
Prooftech IT
📁 Специфичность CSS селекторов
В чем основные отличия между последним стандартом HTML и предыдущими версиями?
Prooftech IT
📁 Семантика HTML и HTML5
Сколько тегов header, footer и main может быть на странице, если внутри section также используются эти теги?
Prooftech IT
📁 Нет темы
В чем отличие HTML-тегов div и span?
Pyrus
📁 Семантика HTML и HTML5
Объясните основные отличия и применение flexbox и grid в CSS.
Quantum Art
📁 Сравнение Grid и Flexbox
Объясните работу CSS-селекторов >, + и ~.
Quantum Art
📁 Операторы сравнения
Что такое единицы измерения em и rem в CSS и как они используются?
Quantum Art
📁 Хуки и замыкания
Что такое медиазапросы в CSS и как их использовать?
Quantum Art
📁 Специфичность CSS селекторов
Что такое модульные стили и css-in-js? В чем их преимущества?
Quantum Art
📁 Специфичность CSS селекторов
Какие новые возможности CSS вы знаете?
Quantum Art
📁 Специфичность CSS селекторов
Как скрыть элемент на странице?
Queen Games
📁 Нет темы
Расскажите про CSS, препроцессоры и различные подходы к стилизации, включая CSS-in-JS. С чем работали, плюсы и минусы
Right Line
📁 Специфичность CSS селекторов
Что такое селекторы в CSS? Расскажите про специфичность
Right Line
📁 Нет темы
Что такое селектор по атрибуту в CSS?
Right Line
📁 Дескрипторы и элементы HTML
Когда лучше использовать CSS Grid, а когда Flexbox? Приведите примеры из опыта
R-Vision
📁 Сравнение Grid и Flexbox
Специфичность CSS: что это и как работает
R-Vision
📁 Специфичность CSS селекторов
Как происходит приоритезация селекторов в CSS?
Selecty
📁 Специфичность CSS селекторов
Какими способами можно скрыть контент на экране у пользователя?
Selecty
📁 Нет темы
Что такое Composition и relayout в контексте верстки?
Sky Capital
📁 Нет темы
Какие семантические теги и атрибут role используются для скринридеров?
Smena
📁 Семантическая верстка

Какие HTML-теги лучше использовать для кнопок на лендинге, если одна открывает модальное окно, а другая — перемещает по странице с появлением тултипа?
Sminex
Как бы вы реализовали аккордеон с помощью HTML и CSS?
Sminex
📁 Специфичность CSS селекторов
Какой тип верстки использовался на вашем проекте?
Staff-IT
📁 Проектные вопросы
Насколько мобильная версия сайта отличалась от десктопной?
Staff-IT
📁 UI Kit и его особенности
Насколько отличался лэйаут мобильной версии от десктопной?
Staff-IT
📁 API и мессенджеры
Работали ли вы с Tailwind CSS и каковы ваши впечатления?
Staff-IT
📁 Нет темы
Какие HTML теги знаешь и для чего они нужны
Tecius
📁 Семантическая верстка
Почему верстать только div-ами — плохая практика
Tecius
📁 Хуки и замыкания
Типы позиционирования элементов и их особенности
Tecius
📁 Нет темы
Какие свойства для контейнера sticky-элемента обязательно нужно соблюдать
Tecius
📁 Свойства позиционирования
Как работают CSS-селекторы и как они взаимодействуют
Tecius
📁 Специфичность CSS селекторов
Как повысить приоритет CSS-селектора с помощью !important
Tecius
📁 Специфичность CSS селекторов
Как реализовать адаптивность сайта с использованием брейкпойнтов и мета-тега viewport?
Tecius
📁 Нет темы
Какие бывают мета-теги и для чего они используются?
Tecius
📁 Семантическая верстка
Как делать анимации? Какие CSS-свойства рекомендуется менять, а какие нет? Если нужно сместить квадратик сверху вниз, что лучше использовать?
Tilda Тильда
📁 Анимации в браузере
Опишите, что произойдет с размерами блоков и цветом бордеров, если добавить ещё два дочерних элемента в структуру <div class="outer"><div class="inner"></div></div> с CSS: .outer { border: 1px solid red; } .inner { border: 1px solid green; width: 100px; height: 100px; }
Tilda Тильда
📁 Специфичность CSS селекторов
Что делает CSS-правило * { box-sizing: border-box; } и как оно работает?
Tilda Тильда
📁 Специфичность CSS селекторов
Какие минусы могут быть у использования `* { box-sizing: border-box; }`?
Tildi
Почему свойство display:inline не работает в данном случае?
Tildi
Какие основные значения у свойства box-sizing и их отличие?

Что не так с версткой карточки товара? Опишите возможные ошибки.
Tildi
Что означает строка `* { box-sizing: border-box; }`?
Tildi
Какие ошибки вы видите в макете формы регистрации?
Tildi
Какие проблемы могут возникнуть с использованием placeholder и label в форме?
Tildi
Почему цена и объем (70 мл) в карточке товара расположены неудобно?
Tildi
Как обозначить обязательные поля в форме?
Tildi
Как сделать, чтобы внутренние div-элементы располагались в одну строку?
Tildi
Достаточно ли задать display:flex родителю, чтобы inner div'ы встали в ряд?
Tildi
В чем особенность inline-блока?
Tildi
Как бы вы выделили цену в карточке товара?
Tildi
Что будет с inline элементом по ширине и высоте?
Tildi
Как будут выглядеть внутренние div'ы, если их три штуки на одном уровне?
Tildi
Как будет выглядеть HTML/CSS код с бордерами?
Tildi
Какие проблемы могут возникнуть с цветом кнопки «Купить» или расположением текста «парфюм женский»?
Tildi
Какие минусы есть у подхода CSS-in-JS?
Unirest
📁 Специфичность CSS селекторов
Какое значение свойства position по умолчанию у элемента в CSS? Какие существуют значения position и как они работают?
Unirest
📁 Специфичность CSS селекторов
В чем отличие Flexbox от Grid в CSS?
Unirest
📁 Сравнение Grid и Flexbox
Что делает свойство align-self в Flexbox?
Unirest
📁 Сравнение Grid и Flexbox
Какие современные подходы к верстке вы знаете?
Unitarius
📁 Адаптивная верстка и методы
Знаком ли ты с анимациями CSS keyframe?

Как вы решаете проблему названия классов в CSS?
Unknown
Вы работали с дизайн-макетами в Figma? В каких единицах измерения предпочитаете верстать?
Unknown
Что делать, если на странице плохая семантика? Как ее улучшить?
Unknown
Знакомы ли вы с методологией БЭМ?
Unknown
Как вы выбираете между использованием гридов и флексов? В каких случаях вы предпочитаете одно над другим?
Unknown
Что бы вы выбрали для создания анимации: CSS или JavaScript? Объясните ваш выбор.
Unknown
Вы используете подход First Mobile или сначала разрабатываете для десктопов?
Unknown
Можешь сравнить CSS-анимации и анимации на JavaScript, их плюсы и минусы? Какие анимации стоит делать на CSS, а какие – на JS?
Unknown
Расскажите, как вы изучали и применяли медиазапросы в CSS для адаптивной верстки веб-страниц?
Unknown
Какие ошибки в доступности (accessibility) чаще всего возникают при верстке с использованием div вместо семантических тегов?
Unknown
Как сделать так, чтобы на больших экранах были видны определённые части приложения, а на мобильных устройствах они скрывались?
Unknown
Как сделать так, чтобы элементы первого блока располагались горизонтально, а подменю — вертикально?
Unknown
Как обеспечить доступность (accessibility) страницы? Какие основные проблемы могут возникнуть?
Unknown
Что означает запись var(--переменная) в CSS и как инициализируются такие переменные?
Unknown
Как самый простой способ отцентрировать текст по высоте и ширине страницы?
Unknown
Как отцентрировать div на странице?
Vk Workspace
📁 Нет темы
В чем отличие между элементами <div> и <span>?
Vk Инфраструктура
📁 Нет темы
В чем суть каскадности в CSS и как браузер определяет приоритеты стилей при их конфликте?
Vk Инфраструктура
📁 Специфичность CSS селекторов
Приведите примеры псевдо-классов и псевдо-элементов в CSS.
Vk Инфраструктура
📁 Специфичность CSS селекторов
В чем отличие между форматами изображений png, jpeg, webp, svg?

CSS: какие существуют единицы измерения и как они используются?
Wildberries
📁 Специфичность CSS селекторов
Какие существуют значения свойства position в CSS?
Wildberries
📁 Специфичность CSS селекторов
Как работают свойства flex-grow и flex: 1 0 0 в CSS Flexbox?
Wildberries
📁 Сравнение Grid и Flexbox
Какие способы позиционирования элемента по центру вы знаете? Подробно объясните, как и почему выбираете тот или иной способ.
X5
📁 Центрирование элементов
Объясните принципы позиционирования в CSS
Аг-Логистика
📁 Специфичность CSS селекторов
Объясни работу Flexbox и Grid в CSS.
Аг-Логистика
📁 Сравнение Grid и Flexbox
Опишите основные принципы CSS анимаций
Аг-Логистика
📁 Анимации в браузере
Что такое вендорные префиксы и зачем они нужны?
Ай-Теко
📁 Функциональный JS & Web API
Расскажи про тег picture и его использование
Ай-Теко
📁 Свойства отображения элементов
Объясни разницу между rem и em в CSS
Ай-Теко
📁 Хуки и замыкания
Из чего состоит HTML? Основные элементы и структура
Актион
📁 Семантика HTML и HTML5
Перечислите CSS-селекторы по убыванию специфичности.
Алабуга
📁 Нет темы
Какие значения принимает свойство CSS position и как они работают?
Алабуга
📁 Свойства позиционирования
Что такое transition-timing-function в CSS и как она работает?
Алабуга
📁 Таймауты и интервалы
Как выровнять изображение по центру без потери качества?
Алабуга
📁 Центрирование элементов
Как по методологии БЭМ сделать footer с 3 вариациями и как их назвать?
Алабуга
📁 Нет темы
Каковы преимущества использования SCSS?
Алабуга
📁 Технологии веб-разработки
Какие существуют фреймворки для CSS?
Алабуга
📁 Специфичность CSS селекторов
Какова специфичность селектора *?
Альфа-Банк
📁 Нет темы
Как отцентрировать элементы с помощью Flexbox и Grid?
Альфа-Банк
📁 Сравнение Grid и Flexbox

Как сделать адаптивную верстку без использования медиа-запросов?
Альфа-Банк
📁 Нет темы
Работали ли вы с CSS? В чем различия между flex и grid?
Антара
📁 Специфичность CSS селекторов
Какие CSS-свойства flexbox вы знаете?
Антара
📁 Сравнение Grid и Flexbox
Какие семантические HTML-теги вы знаете и для чего они используются?
Антара
📁 Семантическая верстка
Какие существуют значения CSS свойства position и как они влияют на расположение элементов на странице?
Армо-Системы
📁 Свойства позиционирования
В чем разница между позиционированием absolute, fixed и sticky?
Армо-Системы
📁 Свойства позиционирования
Как позиционируется элемент с position: fixed относительно чего?
Армо-Системы
📁 Свойства позиционирования
Доводилось работать с accessibility на сайте?
АФЛТ
Напиши селектор, чтобы выбрать последний элемент, который будет внутри блока с классом menu и у него не будет атрибута [target=\\\\_blank\\\\"]"
Аэроклуб
📁 Нет темы
Объясни специфичность CSS-селекторов
Аэроклуб
📁 Специфичность CSS селекторов
Объясни разницу между CSS-селекторами: div p span {color: red}, div, p, span {color: red}, div > p > span {color: red}
Аэроклуб
📁 Специфичность CSS селекторов
Как лучше работать с графиками, используя SVG или Canvas?
Бюро 1440
📁 Свойства отображения элементов
Что такое z-index и как он работает?
Вендорteamf
📁 Нет темы
Что делает CSS-свойство display и какие значения оно может принимать?
Вендорteamf
📁 Свойства отображения элементов
У каких HTML-тегов по умолчанию display имеет значение inline-block?
Вендорteamf
📁 Свойства отображения элементов
В чём техническая и визуальная разница между {visibility: hidden}, {display: none} и {opacity: 0} при скрытии элемента?
Газпромбанк
📁 Нет темы
Как распределяются приоритеты CSS-селекторов? Какого размера будет текст в элементе <div id='test' class='hello' style='font-size: 8px;'>text here</div> при стилях #test { font-size: 20px; } и .hello { font-size: 10px; }?
Газпромбанк
📁 Специфичность CSS селекторов
Что для вас означает pixel perfect верстка и как вы её реализовывали?
Газпромбанк
📁 Свойства отображения элементов
Сравните display: none и visibility: hidden
Газпром Медиа
📁 Нет темы
Как работает директива !important в CSS и когда её следует использовать?
Газпром Медиа
📁 Специфичность CSS селекторов

Что такое семантика в веб-разработке и почему она важна?
Газпром Медиа
📁 Нет темы
Какие способы существуют для избежания коллизий имён в CSS?
Дарвин
📁 Специфичность CSS селекторов
Что такое CSS in JS и как этот подход позволяет писать стили непосредственно в JavaScript для компонентов?
Дарвин
📁 Специфичность CSS селекторов
Расскажите про особенности свойства box-sizing: border-box
Домклие
📁 Свойства отображения элементов
Про свойство position и его значения
Домклие
📁 Свойства позиционирования
Что такое CSS псевдоклассы и как они используются для стилизации элементов в зависимости от их состояния или положения?
Домклие
📁 Псевдоклассы и классы
Почему использование CSS свойства transition с параметром all может негативно влиять на производительность и как этого избежать?
Домклие
📁 Всплытие и погружение событий
Как работает свойство grid-template-columns в CSS Grid и каким образом оно задаёт структуру колонок в сетке?
Домклие
📁 Сравнение Grid и Flexbox
Как использовать repeat в CSS Grid для оптимизации верстки?
Домклие
📁 Рендеринг и рекурсия
Как задать промежутки между колонками и строками в CSS Grid?
Домклие
📁 Свойства отображения элементов
Что такое grid-template-areas и как его использовать в CSS Grid?
Домклие
📁 Сравнение Grid и Flexbox
Расскажите про CSS Modules, их особенности и преимущества.
Домклик
📁 Специфичность CSS селекторов
Как выглядит Tailwind CSS после сборки и какие методы оптимизации применяются?
Домклик
📁 Нет темы
Что такое блочная модель в CSS?
Домклик
📁 Специфичность CSS селекторов
Как рассчитывается вес селекторов в CSS?
Домклик
📁 Специфичность CSS селекторов
Свойство position в CSS и его возможные значения.
Домклик
📁 Свойства позиционирования
Назови несколько семантических строчных и блочных тегов, кроме div и span.
Домклик
📁 Семантическая верстка
В чем разница между position: absolute и position: fixed?
Домклик
📁 Свойства позиционирования
Расскажи про поведение position: sticky.
Домклик
📁 Свойства позиционирования
Что такое Flexbox в CSS и как он используется для создания адаптивных и гибких макетов веб-страниц?
Домклик
📁 Сравнение Grid и Flexbox

Что такое препроцессоры и для чего они нужны?
Домклик
📁 Нет темы
Что вы знаете про анимации в CSS?
Домклик
📁 Анимации в браузере
Зачем нужно минифицировать статические файлы?
Домклик
📁 Свойства отображения элементов
Что такое свойство position в CSS и как различные его значения влияют на расположение элементов на веб-странице?
Иннотех
📁 Специфичность CSS селекторов
Как работает вес селекторов в CSS?
Иннотех
📁 Специфичность CSS селекторов
Каковы преимущества использования CSS-in-JS по сравнению с обычными CSS файлами?
Иннотех
📁 Специфичность CSS селекторов
Как реализуется локализация стилей в чистом CSS и в styled-components? Расскажите про конфликты стилей.
Иннотех
📁 Специфичность CSS селекторов
Расскажите про Flexbox и Grid: что это за технологии и какие из них вы чаще применяли?
Иннотех
📁 Дейли взаимодействия и релизы
В чем разница между единицами измерения em и rem в CSS?
Иннотех
📁 Нет темы
Что ты можешь рассказать про семантическую верстку, почему это важно, какие плюсы для разработчика и других аспектов?
Исходный
В чем основные отличия между HTML4 и HTML5?
Исходный Код
📁 Семантика HTML и HTML5
Какой тег можно использовать для навигации страницы вместо <nav>?
Исходный Код
📁 Отрисовка страниц в браузере
Как будут расположены квадраты с заданными стилями и вложенностью элементов в HTML и CSS? Опишите расположение.
Исходный Код
📁 Специфичность CSS селекторов
Что такое атрибут contentEditable и для чего он используется?
Киберлаб
📁 Семантическая верстка
Какие библиотеки CSS-in-JS вы использовали и почему выбрали Radix UI вместо Material UI на проекте?
Компания Sapiens Solution
📁 Специфичность CSS селекторов
Существуют ли отрицательные значения padding в CSS?
Контур
📁 Плюсы и минусы технологий
Знаешь ли ты препроцессоры sass/scss и как их используешь?
Корпорация Элар
📁 Технологии веб-разработки
Как лучше делать анимации в CSS?
Купер
📁 Анимации в браузере
В чем разница между position: absolute и position: relative?
Лига Цифровой Экономики
📁 Свойства позиционирования
Какие существуют единицы измерения в CSS (px, em, rem, %, vw, vh) и какие из них лучше использовать в разных случаях?
Маквес
📁 Специфичность CSS селекторов
Какие существуют псевдо-классы в CSS и для чего они используются? Примеры: :hover, :active, :focus, :visited, :link, :disabled, :enabled.
Маквес
📁 Специфичность CSS селекторов
Какие существуют псевдо-элементы в CSS и как они работают? Примеры: ::before, ::after.
Маквес
📁 Специфичность CSS селекторов
Как работает свойство z-index в CSS и какие есть нюансы при большом количестве элементов с z-index и вложенностью?
Маквес
📁 Нет темы
Если есть два div-контейнера A и B с z-index 2 и 3 соответственно, внутри A элемент C с z-index 5, а внутри B элемент D с z-index 4, какой элемент (C или D) будет отображаться выше и почему?
Маквес
📁 Нет темы
Что такое media-запросы в CSS и для чего они используются?
Маквес
📁 Специфичность CSS селекторов
Можно ли включить изображения в бандл, чтобы не загружать их с сервера, и как этого добиться?
Название Компании Beget
📁 Свойства отображения элементов
Какие есть способы получить элемент из DOM?
Новый
Что значит "парсить с учетом CSS"?
Новый
Как называется процесс вычисления расположения элементов на странице?
Новый
Какие существуют значения свойства display в CSS и как они влияют на отображение элементов?
Онлайн Решения
📁 Специфичность CSS селекторов
Какие типы селекторов существуют в CSS?
Онлайн Решения
📁 Специфичность CSS селекторов
Объясните, как рассчитывается специфичность селекторов в CSS.
Онлайн Решения
📁 Специфичность CSS селекторов
В чем разница между блочными и строчными элементами
Ооо Мобайлдевелопмент
📁 Дескрипторы и элементы HTML
Почему на версии для ПК кнопка input растянута на весь экран, используются разные стили input'ов, а также присутствуют излишние скроллы по горизонтали и вертикали?
Ооо Ртк
📁 Стилизация компонентов
Существуют ли ограничения по весу загружаемых картинок?
Ооо Ртк
📁 Свойства отображения элементов
Можно ли добавить кнопку или другой элемент для сброса выбранных тегов в dropdown-меню при создании формы?
Ооо Ртк
📁 Нет темы
Как вы относитесь к CSS Nesting?
Ооо Ртк
📁 Специфичность CSS селекторов
Объясните разницу между псевдоклассами и псевдоэлементами в CSS.
ООО Студия
📁 Специфичность CSS селекторов
Расскажите о специфичности селекторов CSS.
ООО Студия
📁 Специфичность CSS селекторов
Как осуществлять верстку pixel perfect?
Петрович-Тех
📁 Свойства отображения элементов
В каком порядке загружаются несколько файлов со стилями и почему?
Поле.рф
📁 Архитектурные подходы
Как сделать адаптивную верстку без использования @media запросов в CSS и без JavaScript? Например, чтобы размер шрифта автоматически менялся в зависимости от устройства (мобильный или десктоп)
Поле.рф
📁 Специфичность CSS селекторов
Если у дива есть padding и border, что входит в его размеры (ширину и высоту)?
Поле.рф
📁 Нет темы
Какие вы знаете псевдоклассы и псевдоэлементы в CSS?
Поле.рф
📁 Псевдоклассы и классы
Перечислите все способы расположить элементы A и B из двух div в одну строку с помощью HTML/CSS
Промсвязьбанк
📁 Специфичность CSS селекторов
Что нового появилось в HTML5 и почему произошёл переход на HTML5?
Российский Университет Дружбы Народов
📁 Семантика HTML и HTML5
Для чего используются мета-теги в HTML?
Российский Университет Дружбы Народов
📁 Семантическая верстка
Делали ли вы адаптивный дизайн? Какие инструменты и подходы использовали?
Сбер
📁 Паттерны проектирования
Сравните CSS и CSS-in-JS: преимущества и недостатки каждого подхода.
Сбер
📁 Специфичность CSS селекторов
В чём разница между Flexbox и Grid в CSS?
Сбер
📁 Сравнение Grid и Flexbox
Для чего нужны медиа-запросы в css?
Сбер
📁 Специфичность CSS селекторов
Что такое design token и как он используется в верстке
Сбер
📁 Паттерны проектирования
Какие псевдоэлементы и псевдоклассы CSS вы знаете и используете в проектах?
Сбер
📁 Псевдоклассы и классы
Назови все свойства flexbox, которые знаешь
Сбер
📁 Сравнение Grid и Flexbox
Когда использовать flexbox, а когда grid
Сбер
📁 Сравнение Grid и Flexbox
Что произойдет, если не указать атрибуты width и height у изображения в HTML?
Сбер
📁 Нет темы
Расскажите про семантику в HTML.
Сбер
📁 Семантика HTML и HTML5
Объясните, как обеспечить доступность (accessibility) в веб-разработке
Сбер
📁 Веб-технологии и доступность
Как скрыть элемент на странице? В чем отличие display:none от других способов скрытия элемента?
Сбер
📁 Нет темы
В чем разница при стилизации элементов Button и Link?
Сбер
📁 Нет темы
Как изолировать стили с помощью Shadow DOM?
Сбер
📁 Специфичность CSS селекторов
Что такое специфичность в CSS и как она влияет на применение стилей?
Сбер
📁 Специфичность CSS селекторов
Объясните свойство display в CSS и его основные значения.
Сбер
📁 Специфичность CSS селекторов
Что такое семантическая верстка и использовали ли вы её в проектах?
Сбер
📁 Семантическая верстка
Какие значения свойства position в CSS вы знаете?
Сбер
📁 Специфичность CSS селекторов
С какими CSS-подходами вы работали (CSS Modules, CSS-in-JS) и какой считаете лучшим?
Сбер
📁 Специфичность CSS селекторов
Объясните семантику в CSS и использование scss.module
Сбер
📁 Технологии веб-разработки
Семантика в CSS. Зачем нужна семантика и что такое aria атрибуты?
Сбер
📁 Семантика HTML и HTML5
Расскажите про приоритеты CSS-стилей.
Сбер
📁 Стилизация компонентов
Приходилось ли сталкиваться с модулями в CSS?
Сбер
📁 Специфичность CSS селекторов
Как работает модульность в CSS?
Сбер
📁 Специфичность CSS селекторов
Что такое CSS Modules и как они помогают избежать конфликтов стилей в больших проектах?
Сбер
📁 Специфичность CSS селекторов
Какие существуют размерности в CSS и как они работают?
Сбер
📁 Специфичность CSS селекторов
Вывести теги загруженных постов, при этом одинаковые теги не должны повторяться
Северсталь
📁 Семантическая верстка
Как сверстать кнопку?
Совкомбанк
📁 Кнопки и счетчики
Что такое Reset.css и Normalize.css и в чем их отличие?
Совкомбанк
📁 Специфичность CSS селекторов
Объясните, как работает свойство box-sizing: border-box
Совкомбанк
📁 Свойства отображения элементов
Что такое дескрипторы свойств объекта
Совкомбанк
📁 Дескрипторы и элементы HTML
Что такое вендерный префикс и для чего он нужен?
Совкомбанк
📁 Функциональный JS & Web API
Реализовать отображение длины символов, введенных в инпуты.
Совкомбанк
📁 Переворот строк
Для чего используется методология БЭМ в верстке и как она помогает структурировать CSS классы?
Согаз
📁 Функциональный JS & Web API
В чем разница между margin и padding в CSS?
Т-Банк
📁 Свойства отображения элементов
Какими способами можно отцентровать элемент в CSS?
Т-Банк
📁 Центрирование элементов
Что приоритетнее в CSS: id или class?
Т-Банк
📁 Интерфейсы и типы в TS
когда использовать grid а когда flex?
Учи.ру
📁 Сравнение Grid и Flexbox
Каким требованиям должен соответствовать HTML, чтобы считаться качественным? Рассмотрите SEO, семантику, доступность и альтернативный текст
Финам
📁 Семантика HTML и HTML5
Задача на семантику: разметьте страницу с формой, используя правильные HTML-теги, включая form, fieldset, legend, label и input
Финам
📁 Семантика HTML и HTML5
Какие семантические теги знаешь?
Финуслуги
📁 Семантическая верстка
Можно ли внутри тега <section> объявить тег <header>? Объясните почему.
Финуслуги
📁 Нет темы
Напишите кастомный чекбокс без использования JavaScript, используя только HTML и CSS.
Финуслуги
📁 Специфичность CSS селекторов
Как расположить элемент по центру на странице с помощью CSS?
Финуслуги
📁 Центрирование элементов
Для чего используются SCSS-модули и как они помогают в организации стилей?
Финуслуги
📁 Технологии веб-разработки
Напишите кастомный чекбокс без использования JavaScript, используя CSS-селектор :has и стилизацию чекмарка.
Финуслуги
📁 Специфичность CSS селекторов
Сверстайте кастомный чекбокс с использованием input type checkbox и стилизацией через CSS.
Финуслуги
📁 Специфичность CSS селекторов
Что такое CSS препроцессоры и как они помогают улучшить процесс написания стилей в веб-разработке?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Расскажите про валидацию HTML-документа.
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Расскажите про методологии CSS (например, БЭМ).
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Помимо медиа-запросов, какие методы применяются для адаптивной верстки?
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Расскажите про блочную модель в CSS и основные параметры, её описывающие.
Франчайзинговая Сеть С Ассортиментом Техники Для Отдыха
Что такое псевдоклассы в CSS и как они используются?
Цб Рф
📁 Специфичность CSS селекторов
В чем разница между Canvas и SVG?
Центральный Банк Рф
📁 Нет темы
Что такое семантические теги в HTML и как их использование улучшает структуру и доступность веб-страниц?
Эремейч Рус
📁 Семантическая верстка
Для чего нужен doctype в HTML?
Эремейч Рус
📁 Типы данных и селекторы
Какими способами можно стилизовать HTML-элемент?
Эремейч Рус
📁 Стилизация компонентов
Что такое специфичность селекторов
Эремейч Рус
📁 Нет темы
Относительно какого элемента позиционируется элемент с position: absolute?
Эремейч Рус
📁 Свойства позиционирования
Что такое миксины в SCSS и как они помогают повторно использовать стили и упрощать поддержку CSS-кода?
Эремейч Рус
📁 Технологии веб-разработки
Что такое CSS-свойство position и какие значения оно принимает?
Юспи Групп
📁 Специфичность CSS селекторов
Как с помощью CSS разместить модальное окно по центру экрана?
Юспи Групп
📁 Специфичность CSS селекторов
Что такое @media в CSS и как использовать медиа-запросы?
Юспи Групп
📁 Специфичность CSS селекторов
Что такое CSS Grid и как он используется для создания адаптивных и сложных макетов веб-страниц?
Юспи Групп
📁 Сравнение Grid и Flexbox
Расскажите про SCSS, есть ли сходства с современным CSS, почему бы вы использовали SCSS?
Яндекс
📁 Технологии веб-разработки
Какой цвет будет у двух <div>, если у них несколько классов .red и .blue, а в CSS .blue определён после .red?
Яндекс
📁 Генерация HEX цветов
Какие мета-теги существуют в HTML и как они влияют на поведение и SEO веб-страницы?
Яндекс
📁 Семантическая верстка
Рассмотрите CSS и определите порядок применения стилей и итоговый цвет фона для элемента с классами box и block.
Яндекс
📁 Генерация HEX цветов
