Какие существуют способы оптимизации производительности Vue-приложений?
В чем отличия методов (methods), вычисляемых свойств (computed) и наблюдателей (watchers) в Vue?
Что такое реактивность данных и как она устроена во Vue3?
Реализуйте компонент на Vue 3 для отрисовки таблицы с динамическими данными
В чем отличия Vuex и Pinia? Какой из них вы предпочитаете и почему?
Чем отличается работа с Vue (виртуальное DOM, жизненный цикл компонентов) от простой отрисовки HTML-страницы?
Что такое реактивность в Vue и что означает динамическое отображение данных?
Какие недостатки вы видите в использовании Vue.js?
Каковы ключевые отличия между Vue 2 и Vue 3 с точки зрения производительности, Composition API и поддержки TypeScript?
Расскажите про Composition API и Options API в Vue, их различия и преимущества
Опишите хуки жизненного цикла Vue и что происходит на каждом этапе
Что такое effectScope в Vue 3 и как он помогает управлять реактивными эффектами в компонентах?
Объясните, что такое trigger в контексте Vue (реактивность)
Для чего используется RxJS во Vue 3?
Какие есть способы создания реактивной переменной во Vue Composition API и каковы их особенности?
Используете ли вы Vue 3? Проводили ли миграцию на SSR?
Как можно напрямую взаимодействовать с Virtual DOM во Vue?
У нас Vue3. Как долго вы обычно пересаживаетесь с одного фреймворка на другой?