Вам необходимо разработать редактор фигур на основе следующих технологий:

TypeScript
React
React-Konva
Konva.js
Цель задания — создать функциональное приложение, позволяющее работать со следующими элементами и функциональностью.

Основные требования

Бесконечный холст:
Холст должен позволять пользователю перемещаться по нему в любую сторону на любое расстояние.
Добавление фигур:
Поддержка минимум трех типов фигур: прямоугольник, круг, треугольник.
Фигуры должны добавляться при клике на холст в позиции курсора.
Зумирование холста:
Реализуйте возможность увеличения и уменьшения масштаба холста с помощью колесика мыши или других подходящих методов.
Опциональные возможности:
Добавление фигур методом рисования: касание холста добавляет фигуру, а движение задает ее размер (до отпускания кнопки мыши).
Использование механизмов обработки событий Konva для взаимодействия с холстом и его компонентами может быть включено по вашему усмотрению.
Управление свойствами и настройками:
Разработайте меню с использованием компонентов HTML (TSX) для управления свойствами элементов, которое открывается по клику на элемент
Реализуйте как минимум одно свойство элемента (примеры: переключение на другой тип формы, изменение размеров через текстовые поля, изменения цвета обводки фигуры и/или заливки).
Оптимизация приложения:
Подумайте над оптимизацией
Минимизируйте количество перерисовок тяжелых компонетов
Размещение проекта:
Разместите проект на GitHub.
Оставте readme по запуску проекта.
Желательно использовать систему контроля версий в процессе разработки с коммитами, включающими описания изменений.
Оценочные критерии

Соответствие требованиям задачи.
Чистота и поддерживаемость кода.
Правильное использование TypeScript и обеспечение строгой типизации.
Грамотная организация состояния компонентов.
Эффективное использование возможностей React и библиотеки Konva.
UX/UI дизайн приложения (простота и интуитивность использования).
Некоторое внимание будет уделяться истории коммитов и их внятности.
Примечание
Вы можете использовать любые дополнительные пакеты и библиотеки для достижения поставленных целей, но убедитесь, что они поддерживаются текущим стеком технологий.