Тестовое задание
В рамках тестового задания требуется разработать пользовательский интерфейс для
отправки и получений сообщений WhatsApp
Время на выполнение задания: 5 дней

Требования:
Требуется разработать пользовательский интерфейс для отправки и получений
сообщений WhatsApp
Требуется использовать сервис GREEN-API https://green-api.com/
Требуется реализовать отправку и получение только текстовых сообщений
Требуется за прототип интерфейса взять внешний вид чата
https://web.whatsapp.com/
Требуется реализовать интерфейс максимально простым с минимальным набором
функций
Требуется отправку сообщений реализовать методом https://greenapi.com/docs/api/sending/SendMessage/
Требуется получение сообщений реализовать методом https://greenapi.com/docs/api/receiving/technology-http-api/
Требуется использовать технологию React
Ожидаемый результат:
Пользователь переходит на сайт чата и вводит свои учетные данные из
системы GREEN-API (idInstance, apiTokenInstance)
Пользователь вводит номер телефона получателя и создает новый чат
Пользователь пишет текстовое сообщение и отправляет его получателю в
WhatsApp
Получатель отвечает на сообщение в мессенджере WhatsApp
Пользователь видит ответ получателя в чате
Результат:
Результат выполнения задания просьба отправить на адрес hr@green-api.com в
формате:
Тема: Тестовое задание на должность - Фронтенд разработчик React

Ваше резюме - приложить файл pdf
Ссылка на репозиторий github
Ссылка на инструкцию для локального запуска проекта
Ссылка на сервис в Интернете (при наличии)
Ссылка на скриншоты/видео-презентацию (при наличии)