Тестовое задание
Это тестовое задание призвано показать ваш подход к решению задач. Выполнение
всех пунктов не столь важно, важнее показать ход ваших мыслей и подход к решению
задачи, даже если вы не успели завершить всё.

Задача
Создать To-Do лист в виде календаря, где каждый день представлен как список задач.
При клике на день открывается модальное окно со списком задач. В этом окне можно
создавать новые задачи, удалять их и помечать как выполненные.

Условия
● Frontend: Реализация с использованием React и всего его встроенного
функционала. Использование дополнительных библиотек допустимо, но
нежелательно.
● Хранение данных: На ваше усмотрение (например, локальное хранилище,
context API и т.д.).

Критерии (реализация всего списка не обязательна, важнее качество, а не
количество)

Приятный внешний вид
Семантическая верстка
Адаптивный дизайн
Реализация через Flexbox или Grid (использование Tailwind или других
CSS-фреймворков не желательно)
Желательно использовать БЭМ
Маркировка праздничных дней с использованием isDayOff() API
Вывод задач по неделе
Использование TypeScript
Покрытие интерфейса тестами
Система профилей: у каждого профиля свой список задач, не отображаемый в
другом профиле
Реализовать Dependency Inversion для внешних HTTP-запросов
Понятная структура проекта
Разворачивание проекта в Docker
Дополнительные Фичи
Реализация дополнительных функций приветствуется, если они демонстрируют ваши
неявные умения. Обязательно укажите эти фичи в документации.

Результат
Разместите результат на GitHub, предоставив ссылку на репозиторий. Желательно,
чтобы история коммитов отражала процесс разработки.