Перед тобой будут стоять следующие задачи:
Дизайн https://onedrive.live.com/?authkey=%21ANwJKZvmwku8RxM&id=37E97C02511E0C72%211732964&cid=37E97C02511E0C72 (доп. ссылка https://support.google.com/drive/answer/6283888?visit_id=638823780258561314-6665669&p=unsupported_browser&rd=1, если не работает первая)
Тестовое задание разделяется на 2 уровня: основное задание https://i.imgur.com/agSVU0G.png и задание повышенной сложности https://i.imgur.com/lJKt1f3.png

Требования к основному заданию:
Сверстать адаптивный макет страницы.
Нижнюю часть https://i.imgur.com/coVqGyT.png на десктопе прижать к низу экрана.
Реализовать интерактивный обратный отсчет от заданной даты к 24.07.2024.
Реализовать валидацию формы подписки в футере и отправку данных с помощью ajax.
После отправки формы должен появляться popup с сообщением об успехе или ошибке передачи данных.
Кнопка Go to the event является ссылкой на сторонний сайт, логотип - ссылкой на текущий.
Работа должна быть добавлена на любой бесплатный хостинг.
Требования к заданию повышенной сложности:
Сохраняются все требования предъявленные к основному заданию
Сверстать дополнительные элементы, которых нет в основном задании
Добавить анимацию появления элементов Animation https://onedrive.live.com/?id=37E97C02511E0C72!1731345&resid=37E97C02511E0C72!1731345&authkey=!AF1yusGx1crnvAY&e=jETVoh&cid=37e97c02511e0c72 (доп. ссылка https://support.google.com/drive/answer/6283888?visit_id=638823782560496718-138040064&p=unsupported_browser&rd=1, если не работает первая).
Реализовать плавный скролл к следующей секции по нажатию кнопки “Other events”
Реализовать анимацию аккордеона, как показано на видео Animation https://onedrive.live.com/?id=37E97C02511E0C72!1731345&resid=37E97C02511E0C72!1731345&authkey=!AF1yusGx1crnvAY&e=jETVoh&cid=37e97c02511e0c72
Кнопки “More information” в аккордеоне ведут на сторонний сайт
Выполнение задания повышенной сложности будет большим плюсом!!!

Работа должна быть сделана на HTML, CSS, JS. Можно использовать препроцессоры или любые JS фреймворки (будет плюсом реализация на Vue.js).
Обязательно: работа должна быть залита на хостинг!!! Код должен быть размещен в репозитории (gitlab, github или других подобных ресурсах где можно онлайн посмотреть весь ваш код).