Цель - создать ToDo App приложение.

Основные требования:
1.Должны быть основные действия CRUD (Create, Read, Update, Delete)2.
Функции Update и Delete должны быть объявлены в родительском компоненте
2.При Delete должно появляться модальное окно с подтверждением
3.(По желанию) Можно реализовать логин/регистрацию
4.В Readme должен быть описан процесс запуска приложения
Ограничения по технологиям нет - основное требование - использование React и функциональных компонентов, использование state manager. Можно использовать любой state manager, написание кода на JavaScript возможно, на TypeScript - приветствуется. Можно использовать любую UI библиотеку. Ограничений или требований по стилям нет.

Решенное задание залить на гитхаб, предоставить ссылку

Все возникающие вопросы по заданию решать самостоятельно, по своему усмотрению.