Технические требования к тестовому заданию
Необходимо сверстать адаптивную вёрстку по макету из Figma

Верстать необходимо по методологии БЭМ. Изображения в проекте должны быть в формате SVG, экспортируемые из макета Figma.

При выполнении тестовой работы использовать фреймворк vue.js или сборщик webpack, например, GULP.

Готовый результат выгрузить в git и предоставить к проекту доступ onuchin@z-ex.ru.

Форма обратной связи
Необходимо создать правила валидации на форму: не отправлять данные формы и отображать ошибки, если:
поле обязательно к заполнению;
в полях ФИО присутствуют недопустимые символы (разрешено использовать кириллицу, по одному пробелу и одному дефису);
email неверного формата;
номер телефона не соответствует формату;
не проставлен чекбокс о согласии;
Написать маску для мобильного номера телефона;
Взаимодействие с API
Для работы с API воспользуйтесь данной документацией.